[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;ARIA V: A SINGULAR MOMENT OF PERFECT CLARITY&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Una salus victis nullam sperare salutem.&amp;quot; -Virgil&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;*&amp;quot;That&amp;#39;s my dream; that&amp;#39;s my nightmare. Crawling, slithering, along the edge of a straight razor...and surviving.&amp;quot; -Colonel Walter E. Kurtz&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;GOLDMAN: Tensions grew in the cell as the professor and I discussed the best way to deal with what Manslave was feeding us. Badtanman&amp;#39;s prickly and reluctant manner had dissolved into elemental panic. The notion of a rational compromise or a workable game plan had long since faded in the distance. And on the horizon, raw emotion. Primal confusion. Sheer insanity. Manslave&amp;#39;s mind made real.&lt;/p&gt;\n\n&lt;p&gt;BADTANMAN: -This is what he does, Goldman. This is what Manslave is known for. Twenty-seven times I&amp;#39;ve seen this. This is what he does. This is what he does, Goldman! I&amp;#39;ve seen him do this twenty-seven times before, twenty seven times okay! You understand?!&lt;/p&gt;\n\n&lt;p&gt;GOLDMAN: -He&amp;#39;s not getting in my head.&lt;/p&gt;\n\n&lt;p&gt;BADTANMAN: -GOD! This is what he does. This is what he does, Goldman. I&amp;#39;ve seen this before, twenty-seven times. He&amp;#39;s gone through pieces of shit like you like fucking....&lt;/p&gt;\n\n&lt;p&gt;-He&amp;#39;s in your mind right now!&lt;/p&gt;\n\n&lt;p&gt;GOLDMAN: -He&amp;#39;s not getting in my head, I&amp;#39;m trying to tell you I can handle this guy.&lt;/p&gt;\n\n&lt;p&gt;BADTANMAN: -I knew it from the moment I saw you, you cocky motherfucker. HE&amp;#39;S IN YOUR MIND!&lt;/p&gt;\n\n&lt;p&gt;GOLDMAN: -I&amp;#39;m trying to tell you-&lt;/p&gt;\n\n&lt;p&gt;BADTANMAN: -You cocky motherfucker, Goldman! He&amp;#39;s got you right where he wants you, ya understand?! YOU ARE IN THE PALM OF HIS HAND!&lt;/p&gt;\n\n&lt;p&gt;GOLDMAN: -THIS IS-&lt;/p&gt;\n\n&lt;p&gt;BADTANMAN: -YOU&amp;#39;RE A LITTLE FLAVOR CRYSTAL IN HIS ICE TEA!&lt;/p&gt;\n\n&lt;p&gt;GOLDMAN: -THIS IS NOTHING! I can deal with this fucking guy, I&amp;#39;ve dealt with this plenty of times! You&amp;#39;re a professor, you&amp;#39;re not me! I can deal with this type of shit!&lt;/p&gt;\n\n&lt;p&gt;BADTANMAN: -TWENTY-SEVEN TIMES!&lt;/p&gt;\n\n&lt;p&gt;GOLDMAN: -You&amp;#39;ve never seen this before!&lt;/p&gt;\n\n&lt;p&gt;BADTANMAN: -I&amp;#39;VE SEEN THIS....TWENTY-SEVEN TIMES!&lt;/p&gt;\n\n&lt;p&gt;GOLDMAN: -YOU&amp;#39;RE NOT ME.&lt;/p&gt;\n\n&lt;p&gt;BADTANMAN: -YOU COCKY MOTHERFUCKER, GOLDMAN.&lt;/p&gt;\n\n&lt;p&gt;-THAT&amp;#39;S ENOUGH, MANSLAVE! THAT&amp;#39;S ENOUGH! THAT&amp;#39;S ENOUGH! THAT&amp;#39;S ENOUGH! YOU&amp;#39;VE HAD YOUR FUN! STOP IT! STOP IT! STOP IT! STOP IT!&lt;/p&gt;\n\n&lt;p&gt;-TWENTY-SEVEN TIMES HE&amp;#39;S GONE THROUGH PIECES OF SHIT LIKE YOU LIKE USED TOILET PAPER!&lt;/p&gt;\n\n&lt;p&gt;GOLDMAN: -I CAN HANDLE HIM! I CAN HANDLE THIS GUY!&lt;/p&gt;\n\n&lt;p&gt;-WHAT THE FUCK IS WRONG WITH YOU? I CAN DEAL WITH THIS SHIT. I&amp;#39;ve been through this sort of thing before, it&amp;#39;s not a big deal! I can deal with this guy, he&amp;#39;s manipulative, he&amp;#39;s gotten in your head and I can fucking tell every-You&amp;#39;re a fucking pussy! Okay?!&lt;/p&gt;\n\n&lt;p&gt;BADTANMAN: -YOU&amp;#39;RE NOTHING! I&amp;#39;m sorry...&lt;/p&gt;\n\n&lt;p&gt;GOLDMAN: -You&amp;#39;ve never seen this before! I&amp;#39;ve seen this guy, I&amp;#39;ve been dealing with this sort of thing for a while!&lt;/p&gt;\n\n&lt;p&gt;-You can&amp;#39;t deal with this guy! Let me come in, let me work it out! I can deal with this, I&amp;#39;ve worked with it! I can do this.&lt;/p&gt;\n\n&lt;p&gt;-You just need to-You need to step back. You need to step back and slow down. You need to get yourself together!&lt;/p&gt;\n\n&lt;p&gt;-He works off things like this! He works off weakness! Right, right! Slow down! Take a step back, I&amp;#39;ll deal with this. I&amp;#39;ll deal with this! I can deal with it! I&amp;#39;m a condealer!&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;ARIA VI: CIRCUS PERVERSE&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Tu fui, ego eris.&amp;quot; -Unknown&lt;/em&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;GOLDMAN: In the end, just as the professor had seen twenty-seven times before, the all-obliterating blackness of Manslave&amp;#39;s soul went out. Like newborn babies, the professor and I yielded. Before the infinite sickness. We prayed for mercy but knew there would be none. OH, THE CRUELTY OF MY NEW MASTER! THE IMPOSSIBLE CRUELTY!&lt;/p&gt;\n\n&lt;p&gt;GOLDMAN: -Mr. Manslave, I don&amp;#39;t feel like I have any money.&lt;/p&gt;\n\n&lt;p&gt;MANSLAVE: -You have me and you have the doctor right here.&lt;/p&gt;\n\n&lt;p&gt;BADTANMAN: -That&amp;#39;s right.&lt;/p&gt;\n\n&lt;p&gt;MANSLAVE: -What say you, Mr. Badtanman?&lt;/p&gt;\n\n&lt;p&gt;BADTANMAN: -I don&amp;#39;t know.&lt;/p&gt;\n\n&lt;p&gt;MANSLAVE: -You say...&lt;/p&gt;\n\n&lt;p&gt;BADTANMAN: -What do you want me to say?&lt;/p&gt;\n\n&lt;p&gt;MANSLAVE: -Say anything that comes to mind, the first thing.&lt;/p&gt;\n\n&lt;p&gt;-Everybody can come. You&amp;#39;re all invited. I invited you.&lt;/p&gt;\n\n&lt;p&gt;GOLDMAN: -What did you do to us?&lt;/p&gt;\n\n&lt;p&gt;MANSLAVE: -I made you my men.&lt;/p&gt;\n\n&lt;p&gt;-I made you my men.&lt;/p&gt;\n\n&lt;p&gt;-You&amp;#39;ve learned well. You&amp;#39;ve learned very well.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;GOLDMAN: It&amp;#39;s ofcourse true that Manslave, like the Marquis de Sade, took much and gave little. But what little he did give opened the doorway to a new spiritual plane. A private island in the far recesses of the psyche. Manslave carried on in his evil ways. There was little his captors could do in the way of actually holding him, because he was so cunning and resourceful. He would come and go from the facility as he pleased. Plotting elaborate escapes only to be recaught weeks later, on purpose for fun. Committing unspeakable atrocities in the meantime. This caused much stress and agony for Badtanman. Less out of frustation for being foiled, and more of the feelings of loneliness and desperate queer love that the Manslave provoked in the old homo. As for myself? Well, let&amp;#39;s just say I&amp;#39;m reading this transcript. Right now. Because I&amp;#39;m you. I am you. You are me. I&amp;#39;m Ronnie Goldman and you&amp;#39;re Ronnie Goldman too. I am you and you are me. You are me, I am youuuu. You&amp;#39;re me, you&amp;#39;re meee, you are me and I am you! I&amp;#39;m Ronnie Goldman, you are too! You&amp;#39;re meee! You are meee, I&amp;#39;m you! YOU&amp;#39;RE ME AND I&amp;#39;M YOU! I&amp;#39;M YOU, I&amp;#39;M YOUUUU! I AM RONNIE GOLDMAN, YOU&amp;#39;RE MANSLAVE! I&amp;#39;M MANSLAAAVE! I&amp;#39;M RONNIE GOLDMAN! YOU&amp;#39;RE MEEEEE! I&amp;#39;M YOUUU! YOU&amp;#39;RE MEEEEEEE! I&amp;#39;M YOU, YOU&amp;#39;RE MEEEEEE!&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Recording found at patient&amp;#39;s home office. Dated 1987 (atleast 3 mos. before psychotic episode and crimes) -Badtanman&lt;/p&gt;\n\n&lt;p&gt;MANSLAVE: I&amp;#39;m sitting down, thinking. About life and uh, meaning of memories. And just mortality, actually. Pretty good reasons for disasters happening or..Wait, what came before that? Yes, the theory that&amp;#39;s considering a god playing some sort of role in the universe. And he&amp;#39;s like, like uh, plane. Plane with this universe. They&amp;#39;re infinite, goes on forever. And...It didn&amp;#39;t go as he planned so, with one sleight of his hand the universe is destroyed. Just, just everything is gone weeee, no, everything is destroyed and then we go on to a different one. And it&amp;#39;s not that he&amp;#39;s destroying the universe as to kill people for a specific reason, he&amp;#39;s just erasing everything that happened so he can do it at another place, or something like that. I was thinking; nothing really matters because the lives of people in no way, shape or form could ever mean anything to some sort of creator or great architect, I mean nothing. Wherever they may reside. If they are then, it seems to me they&amp;#39;re just playing chinese checkers and just having fun not picking which ways people are gonna die.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;THE END&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**ARIA V: A SINGULAR MOMENT OF PERFECT CLARITY**\n\n*\"Una salus victis nullam sperare salutem.\" -Virgil*\n\n*\"That's my dream; that's my nightmare. Crawling, slithering, along the edge of a straight razor...and surviving.\" -Colonel Walter E. Kurtz\n\n---------------------------------\n\nGOLDMAN: Tensions grew in the cell as the professor and I discussed the best way to deal with what Manslave was feeding us. Badtanman's prickly and reluctant manner had dissolved into elemental panic. The notion of a rational compromise or a workable game plan had long since faded in the distance. And on the horizon, raw emotion. Primal confusion. Sheer insanity. Manslave's mind made real.\n\nBADTANMAN: -This is what he does, Goldman. This is what Manslave is known for. Twenty-seven times I've seen this. This is what he does. This is what he does, Goldman! I've seen him do this twenty-seven times before, twenty seven times okay! You understand?!\n\nGOLDMAN: -He's not getting in my head.\n\nBADTANMAN: -GOD! This is what he does. This is what he does, Goldman. I've seen this before, twenty-seven times. He's gone through pieces of shit like you like fucking....\n\n-He's in your mind right now!\n\nGOLDMAN: -He's not getting in my head, I'm trying to tell you I can handle this guy.\n\nBADTANMAN: -I knew it from the moment I saw you, you cocky motherfucker. HE'S IN YOUR MIND!\n\nGOLDMAN: -I'm trying to tell you-\n\nBADTANMAN: -You cocky motherfucker, Goldman! He's got you right where he wants you, ya understand?! YOU ARE IN THE PALM OF HIS HAND!\n\nGOLDMAN: -THIS IS-\n\nBADTANMAN: -YOU'RE A LITTLE FLAVOR CRYSTAL IN HIS ICE TEA!\n\nGOLDMAN: -THIS IS NOTHING! I can deal with this fucking guy, I've dealt with this plenty of times! You're a professor, you're not me! I can deal with this type of shit!\n\nBADTANMAN: -TWENTY-SEVEN TIMES!\n\nGOLDMAN: -You've never seen this before!\n\nBADTANMAN: -I'VE SEEN THIS....TWENTY-SEVEN TIMES!\n\nGOLDMAN: -YOU'RE NOT ME.\n\nBADTANMAN: -YOU COCKY MOTHERFUCKER, GOLDMAN.\n\n-THAT'S ENOUGH, MANSLAVE! THAT'S ENOUGH! THAT'S ENOUGH! THAT'S ENOUGH! YOU'VE HAD YOUR FUN! STOP IT! STOP IT! STOP IT! STOP IT!\n\n-TWENTY-SEVEN TIMES HE'S GONE THROUGH PIECES OF SHIT LIKE YOU LIKE USED TOILET PAPER!\n\nGOLDMAN: -I CAN HANDLE HIM! I CAN HANDLE THIS GUY!\n\n-WHAT THE FUCK IS WRONG WITH YOU? I CAN DEAL WITH THIS SHIT. I've been through this sort of thing before, it's not a big deal! I can deal with this guy, he's manipulative, he's gotten in your head and I can fucking tell every-You're a fucking pussy! Okay?!\n\nBADTANMAN: -YOU'RE NOTHING! I'm sorry...\n\nGOLDMAN: -You've never seen this before! I've seen this guy, I've been dealing with this sort of thing for a while!\n\n-You can't deal with this guy! Let me come in, let me work it out! I can deal with this, I've worked with it! I can do this.\n\n-You just need to-You need to step back. You need to step back and slow down. You need to get yourself together!\n\n-He works off things like this! He works off weakness! Right, right! Slow down! Take a step back, I'll deal with this. I'll deal with this! I can deal with it! I'm a condealer!\n\n---------------------------------\n\n**ARIA VI: CIRCUS PERVERSE**\n\n*\"Tu fui, ego eris.\" -Unknown*\n\n---------------------------------\n\nGOLDMAN: In the end, just as the professor had seen twenty-seven times before, the all-obliterating blackness of Manslave's soul went out. Like newborn babies, the professor and I yielded. Before the infinite sickness. We prayed for mercy but knew there would be none. OH, THE CRUELTY OF MY NEW MASTER! THE IMPOSSIBLE CRUELTY!\n\nGOLDMAN: -Mr. Manslave, I don't feel like I have any money.\n\nMANSLAVE: -You have me and you have the doctor right here.\n\nBADTANMAN: -That's right.\n\nMANSLAVE: -What say you, Mr. Badtanman?\n\nBADTANMAN: -I don't know.\n\nMANSLAVE: -You say...\n\nBADTANMAN: -What do you want me to say?\n\nMANSLAVE: -Say anything that comes to mind, the first thing.\n\n-Everybody can come. You're all invited. I invited you.\n\nGOLDMAN: -What did you do to us?\n\nMANSLAVE: -I made you my men.\n\n-I made you my men.\n\n-You've learned well. You've learned very well.\n\n---------------------------------\n\nGOLDMAN: It's ofcourse true that Manslave, like the Marquis de Sade, took much and gave little. But what little he did give opened the doorway to a new spiritual plane. A private island in the far recesses of the psyche. Manslave carried on in his evil ways. There was little his captors could do in the way of actually holding him, because he was so cunning and resourceful. He would come and go from the facility as he pleased. Plotting elaborate escapes only to be recaught weeks later, on purpose for fun. Committing unspeakable atrocities in the meantime. This caused much stress and agony for Badtanman. Less out of frustation for being foiled, and more of the feelings of loneliness and desperate queer love that the Manslave provoked in the old homo. As for myself? Well, let's just say I'm reading this transcript. Right now. Because I'm you. I am you. You are me. I'm Ronnie Goldman and you're Ronnie Goldman too. I am you and you are me. You are me, I am youuuu. You're me, you're meee, you are me and I am you! I'm Ronnie Goldman, you are too! You're meee! You are meee, I'm you! YOU'RE ME AND I'M YOU! I'M YOU, I'M YOUUUU! I AM RONNIE GOLDMAN, YOU'RE MANSLAVE! I'M MANSLAAAVE! I'M RONNIE GOLDMAN! YOU'RE MEEEEE! I'M YOUUU! YOU'RE MEEEEEEE! I'M YOU, YOU'RE MEEEEEE!\n\n---------------------------------\n\nRecording found at patient's home office. Dated 1987 (atleast 3 mos. before psychotic episode and crimes) -Badtanman\n\nMANSLAVE: I'm sitting down, thinking. About life and uh, meaning of memories. And just mortality, actually. Pretty good reasons for disasters happening or..Wait, what came before that? Yes, the theory that's considering a god playing some sort of role in the universe. And he's like, like uh, plane. Plane with this universe. They're infinite, goes on forever. And...It didn't go as he planned so, with one sleight of his hand the universe is destroyed. Just, just everything is gone weeee, no, everything is destroyed and then we go on to a different one. And it's not that he's destroying the universe as to kill people for a specific reason, he's just erasing everything that happened so he can do it at another place, or something like that. I was thinking; nothing really matters because the lives of people in no way, shape or form could ever mean anything to some sort of creator or great architect, I mean nothing. Wherever they may reside. If they are then, it seems to me they're just playing chinese checkers and just having fun not picking which ways people are gonna die.\n\n**THE END**\n\n\n\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "31yvcf", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "DOCTOR MANSLAVE ᴛʀᴀɴsᴄʀɪᴘᴛ, ᴘʀᴇsᴇɴᴛᴇᴅ ɪɴ LᴜᴄᴀsAʀᴛs KʀʏsᴛᴀʟVɪsɪᴏɴ ] ᴘᴀʀᴛ 4", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 15, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 4, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": 1428587560.0, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_31yvcf", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/31yvcf/doctor_manslave_ᴛʀᴀɴsᴄʀɪᴘᴛ_ᴘʀᴇsᴇɴᴛᴇᴅ_ɪɴ_lᴜᴄᴀsaʀᴛs/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1428587357.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/31yvcf/doctor_manslave_ᴛʀᴀɴsᴄʀɪᴘᴛ_ᴘʀᴇsᴇɴᴛᴇᴅ_ɪɴ_lᴜᴄᴀsaʀᴛs/", "author_flair_text": "shirt unbuttoned", "quarantine": false, "author": "prophetofshit", "created_utc": 1428558557.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.89, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_31yvcf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_31yvcf", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "cq6tami", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "PePe_The_Frog", "can_mod_post": false, "ups": 3, "parent_id": "t1_cq6qxaj", "score": 3, "approved_by": null, "downs": 0, "body": "He wasn't a lawyer. He was you.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He wasn&amp;#39;t a lawyer. He was you.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/31yvcf/doctor_manslave_ᴛʀᴀɴsᴄʀɪᴘᴛ_ᴘʀᴇsᴇɴᴛᴇᴅ_ɪɴ_lᴜᴄᴀsaʀᴛs/cq6tami/", "subreddit_type": "public", "name": "t1_cq6tami", "created": 1428633043.0, "author_flair_text": "samite", "created_utc": 1428604243.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_31yvcf", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "cq6x01i", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "prophetofshit", "can_mod_post": false, "ups": 2, "parent_id": "t1_cq6qxaj", "score": 2, "approved_by": null, "downs": 0, "body": "he's there to settle the accounts or whatever the fuck", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;he&amp;#39;s there to settle the accounts or whatever the fuck&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/31yvcf/doctor_manslave_ᴛʀᴀɴsᴄʀɪᴘᴛ_ᴘʀᴇsᴇɴᴛᴇᴅ_ɪɴ_lᴜᴄᴀsaʀᴛs/cq6x01i/", "subreddit_type": "public", "name": "t1_cq6x01i", "created": 1428638516.0, "author_flair_text": "shirt unbuttoned", "created_utc": 1428609716.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cq6qxaj", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "CharlesDingus", "can_mod_post": false, "ups": 2, "parent_id": "t3_31yvcf", "score": 2, "approved_by": null, "downs": 0, "body": "What is Goldman's job in this?  What do they need a lawyer for?  That's something I've never understood about this.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What is Goldman&amp;#39;s job in this?  What do they need a lawyer for?  That&amp;#39;s something I&amp;#39;ve never understood about this.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/31yvcf/doctor_manslave_ᴛʀᴀɴsᴄʀɪᴘᴛ_ᴘʀᴇsᴇɴᴛᴇᴅ_ɪɴ_lᴜᴄᴀsaʀᴛs/cq6qxaj/", "subreddit_type": "public", "name": "t1_cq6qxaj", "created": 1428629578.0, "author_flair_text": null, "created_utc": 1428600778.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_31yvcf", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "cq74wiq", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "sw33n3y_t0dd", "can_mod_post": false, "ups": 2, "parent_id": "t3_31yvcf", "score": 2, "approved_by": null, "downs": 0, "body": "now do one on billy and the clown", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;now do one on billy and the clown&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/31yvcf/doctor_manslave_ᴛʀᴀɴsᴄʀɪᴘᴛ_ᴘʀᴇsᴇɴᴛᴇᴅ_ɪɴ_lᴜᴄᴀsaʀᴛs/cq74wiq/", "subreddit_type": "public", "name": "t1_cq74wiq", "created": 1428651190.0, "author_flair_text": null, "created_utc": 1428622390.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]