[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Stop listening to molyneux and make good with mommy, it seems like she put up with a lot. I&amp;#39;m ready for the pit, just not in the face.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Stop listening to molyneux and make good with mommy, it seems like she put up with a lot. I'm ready for the pit, just not in the face.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "3omjcu", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "Honest advice for Sammy", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 34, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_3omjcu", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1444793740.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/", "author_flair_text": "webmaster", "quarantine": false, "author": "stretchpun", "created_utc": 1444764940.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.62, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "cvz66rh", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "TVdinnerbythepool", "can_mod_post": false, "ups": 2, "parent_id": "t1_cvyyd24", "score": 2, "approved_by": null, "downs": 0, "body": "\"letting human productivity flourish\" doesn't crash economies without some other underlying factors. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;letting human productivity flourish&amp;quot; doesn&amp;#39;t crash economies without some other underlying factors. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz66rh/", "subreddit_type": "public", "name": "t1_cvz66rh", "created": 1444834865.0, "author_flair_text": null, "created_utc": 1444806065.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 6, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "cvznotc", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "blarfmar", "can_mod_post": false, "ups": 2, "parent_id": "t1_cvzb5lo", "score": 2, "approved_by": null, "downs": 0, "body": "No dude, Americans and Germans did not exploit their comparative advantage. English economists told them that their comparative advantage was in exporting raw materials because the market says so. But they said fuck the market we're entering into high value-added goods because that's what's going to be best for us in the long run and enacted policies that contradicted the logic of the market and succeeded. Probably not as easy to do it in this day and age, but that's a different story. The rest of your post takes too long to respond to sry.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No dude, Americans and Germans did not exploit their comparative advantage. English economists told them that their comparative advantage was in exporting raw materials because the market says so. But they said fuck the market we&amp;#39;re entering into high value-added goods because that&amp;#39;s what&amp;#39;s going to be best for us in the long run and enacted policies that contradicted the logic of the market and succeeded. Probably not as easy to do it in this day and age, but that&amp;#39;s a different story. The rest of your post takes too long to respond to sry.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvznotc/", "subreddit_type": "public", "name": "t1_cvznotc", "created": 1444875000.0, "author_flair_text": "Favorite Word: More", "created_utc": 1444846200.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 9, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvzb5lo", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "BossMCDollaDolla", "can_mod_post": false, "ups": 1, "parent_id": "t1_cvz27yj", "score": 1, "approved_by": null, "downs": 0, "body": "State authority in Russia is still extremely high. The people in government are doing what they please. Look at Putin with Pussy Riot, Alexander Litvanenko, Georgia, Ukraine... It's at every level including enterprise. The oligops I mentioned were the USSR bureaucrats involved in supervising various industries... they just became \"owners\" of what are now big clunky companies with no competition because they and their buddies in a still highly intrusive government (capable of and actively enacting coercion) prevent competition.\n\nThe Americans and Germans had and exploited their comparative advantage. Multinationals are extremely powerful and are driven by projects (manufacturing plants) that are the most profitable. A country with less corruption and restriction on trade intrinsically has lower costs. If infrastructure in the given country isn't good, low infrastructure intensive industries will flourish and if the resources from the presence of those companies are allocated correctly, infrastructure improves and becomes a high-return investment when more industries come in. This is keeping equal no corruption, but remember: it's not a free market with corruption.\n\nPopulist shit like \"the US should make cars\" because of some ideal that Ford is the best. Maybe that industry shouldn't be protected if it constantly needs bailouts. The infant industry idea is largely stupid. One of the only good examples is Japanese autos, but for that one project there were 10 (shipbuilding and some other massive jokes) that haven't become nationally profitable.\n\nChina went from starvation to Foxconn (actually not bad from an econ perspective) because their massively corrupt government happened to leave the market super open to the outside, where foreign investors saw a lot of potential. And remember: this was a country that was starving and shitty... they didn't exactly have excellent infrastruture, but foreign investors knew that the US didn't exactly have the capacity for the demand for units of 100 different GI Joe character action figures... again, not so glamorous, but comparative advantage. The \"they're just poor and they're just rich\" thing is just reductive. Industry is dynamic where it's allowed to be: US taxes are why multinationals have moved their headquarters to Ireland and costly unionized labor is why the US doesn't make steel anymore. So comparative advantage is constantly flexible and dynamic, so unless your industry is really good where it is, there's a significant risk someone can do it better.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;State authority in Russia is still extremely high. The people in government are doing what they please. Look at Putin with Pussy Riot, Alexander Litvanenko, Georgia, Ukraine... It&amp;#39;s at every level including enterprise. The oligops I mentioned were the USSR bureaucrats involved in supervising various industries... they just became &amp;quot;owners&amp;quot; of what are now big clunky companies with no competition because they and their buddies in a still highly intrusive government (capable of and actively enacting coercion) prevent competition.&lt;/p&gt;\n\n&lt;p&gt;The Americans and Germans had and exploited their comparative advantage. Multinationals are extremely powerful and are driven by projects (manufacturing plants) that are the most profitable. A country with less corruption and restriction on trade intrinsically has lower costs. If infrastructure in the given country isn&amp;#39;t good, low infrastructure intensive industries will flourish and if the resources from the presence of those companies are allocated correctly, infrastructure improves and becomes a high-return investment when more industries come in. This is keeping equal no corruption, but remember: it&amp;#39;s not a free market with corruption.&lt;/p&gt;\n\n&lt;p&gt;Populist shit like &amp;quot;the US should make cars&amp;quot; because of some ideal that Ford is the best. Maybe that industry shouldn&amp;#39;t be protected if it constantly needs bailouts. The infant industry idea is largely stupid. One of the only good examples is Japanese autos, but for that one project there were 10 (shipbuilding and some other massive jokes) that haven&amp;#39;t become nationally profitable.&lt;/p&gt;\n\n&lt;p&gt;China went from starvation to Foxconn (actually not bad from an econ perspective) because their massively corrupt government happened to leave the market super open to the outside, where foreign investors saw a lot of potential. And remember: this was a country that was starving and shitty... they didn&amp;#39;t exactly have excellent infrastruture, but foreign investors knew that the US didn&amp;#39;t exactly have the capacity for the demand for units of 100 different GI Joe character action figures... again, not so glamorous, but comparative advantage. The &amp;quot;they&amp;#39;re just poor and they&amp;#39;re just rich&amp;quot; thing is just reductive. Industry is dynamic where it&amp;#39;s allowed to be: US taxes are why multinationals have moved their headquarters to Ireland and costly unionized labor is why the US doesn&amp;#39;t make steel anymore. So comparative advantage is constantly flexible and dynamic, so unless your industry is really good where it is, there&amp;#39;s a significant risk someone can do it better.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvzb5lo/", "subreddit_type": "public", "name": "t1_cvzb5lo", "created": 1444854413.0, "author_flair_text": "Sharia lawyer", "created_utc": 1444825613.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 8, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvz27yj", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "blarfmar", "can_mod_post": false, "ups": 2, "parent_id": "t1_cvz15ag", "score": 2, "approved_by": null, "downs": 0, "body": "Like I said, you can blame it on corruption and poor leadership, but you can either address the theory or accept the situation as a mixture of bad policy and corruption / leadership. I think you also need to consider corruption as the possible result of policy. Russia is a good example of this: when everything is being privatized willy-nilly, there's incentive to do things quickly and quietly before there's any chance of oversight hindering something. When people end up owning half the country, then they can buy immunity from the law and so of course that will lead to corruption. As I said earlier, it's not just the ideas on policy that I believe are wrong but the ideological belief that just rolling back state authority and allowing everyone to do as they please will result in a flourishing and free economy and Russia is an example of that.\n\nRegarding trade, if everyone does it, then not doing it would expose you to competitive pressures that no other government sees fit to expose themselves to, right? What are those nonsense populist reasons? Maintaining a reasonable national income level? The thing about comparative advantage is that much of it is incidental. So while Swedes will never be great orange-farmers, there's no intrinsic reason that any one country should be better at manufacturing cars in such a way that it couldn't be addressed. Manufacturing requires infrastructure, skilled labor, capital, and some support. None of that is unattainable for an ex-USSR country considering the emphasis they placed on technical education. Most often the biggest comparative advantage is just the fact that that country's firm(s) dominated that market first and continued to do so, and so continues to curry favor both in terms of capital and consumers. I don't expect Malaysia to produce the next big step in solar panels but I think that has more to do with their level of development than the fact that they're Malaysia. If you phrase the logic so that every country has a comparative advantage in some industry in a way that's non-arbitrary, non-incidental and unconditional then the ultimate conclusion there is that some country's comparative advantage is being poor and others' is being rich. And you could've said that when England was the sole manufacturer for the world, but Americans and Germans didn't accept that.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like I said, you can blame it on corruption and poor leadership, but you can either address the theory or accept the situation as a mixture of bad policy and corruption / leadership. I think you also need to consider corruption as the possible result of policy. Russia is a good example of this: when everything is being privatized willy-nilly, there&amp;#39;s incentive to do things quickly and quietly before there&amp;#39;s any chance of oversight hindering something. When people end up owning half the country, then they can buy immunity from the law and so of course that will lead to corruption. As I said earlier, it&amp;#39;s not just the ideas on policy that I believe are wrong but the ideological belief that just rolling back state authority and allowing everyone to do as they please will result in a flourishing and free economy and Russia is an example of that.&lt;/p&gt;\n\n&lt;p&gt;Regarding trade, if everyone does it, then not doing it would expose you to competitive pressures that no other government sees fit to expose themselves to, right? What are those nonsense populist reasons? Maintaining a reasonable national income level? The thing about comparative advantage is that much of it is incidental. So while Swedes will never be great orange-farmers, there&amp;#39;s no intrinsic reason that any one country should be better at manufacturing cars in such a way that it couldn&amp;#39;t be addressed. Manufacturing requires infrastructure, skilled labor, capital, and some support. None of that is unattainable for an ex-USSR country considering the emphasis they placed on technical education. Most often the biggest comparative advantage is just the fact that that country&amp;#39;s firm(s) dominated that market first and continued to do so, and so continues to curry favor both in terms of capital and consumers. I don&amp;#39;t expect Malaysia to produce the next big step in solar panels but I think that has more to do with their level of development than the fact that they&amp;#39;re Malaysia. If you phrase the logic so that every country has a comparative advantage in some industry in a way that&amp;#39;s non-arbitrary, non-incidental and unconditional then the ultimate conclusion there is that some country&amp;#39;s comparative advantage is being poor and others&amp;#39; is being rich. And you could&amp;#39;ve said that when England was the sole manufacturer for the world, but Americans and Germans didn&amp;#39;t accept that.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz27yj/", "subreddit_type": "public", "name": "t1_cvz27yj", "created": 1444824392.0, "author_flair_text": "Favorite Word: More", "created_utc": 1444795592.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 7, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvz15ag", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "BossMCDollaDolla", "can_mod_post": false, "ups": 2, "parent_id": "t1_cvyyd24", "score": 2, "approved_by": null, "downs": 0, "body": "Every country you cited is really corrupt (aka business-prohibitive and not a free market by a long shot). http://www.transparency.org/cpi2014/results\n\nIn Russia for example there's a bunch of billionaire oligops who own huge percentages of most industries... there's tons of stories of businessmen going over there and implementing a highly competitive company, then one of these bigwigs comes and gives you a really shitty buyout number and if you don't accept they'll get you arrested on phony charges.\n\nProtections, capital controls, subsidies, etc. are all in stalemate internationally (everyone does it) so it just dampens trade across the board for nonsensical populist reasons. They do a really bad job to \"protect infant industries,\" which are more than likely the nation's peabrained political ideal with no basis in international economic advantage (we Polocks are carmakers! we need to protect our new auto industry!) There's really no point to them and the less of those in place, the more likely international companies are to find and act on the real opportunities. The way it works is that there's always something a country does cheapest (has comparative advantage in some way). That doesn't happen though because, for example, you could do some badass stuff with super cheap Egyptian real estate... until you realize that the price is 1000x higher due to visiting over 50 legal offices and government buildings and leaving bribes.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Every country you cited is really corrupt (aka business-prohibitive and not a free market by a long shot). &lt;a href=\"http://www.transparency.org/cpi2014/results\"&gt;http://www.transparency.org/cpi2014/results&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;In Russia for example there&amp;#39;s a bunch of billionaire oligops who own huge percentages of most industries... there&amp;#39;s tons of stories of businessmen going over there and implementing a highly competitive company, then one of these bigwigs comes and gives you a really shitty buyout number and if you don&amp;#39;t accept they&amp;#39;ll get you arrested on phony charges.&lt;/p&gt;\n\n&lt;p&gt;Protections, capital controls, subsidies, etc. are all in stalemate internationally (everyone does it) so it just dampens trade across the board for nonsensical populist reasons. They do a really bad job to &amp;quot;protect infant industries,&amp;quot; which are more than likely the nation&amp;#39;s peabrained political ideal with no basis in international economic advantage (we Polocks are carmakers! we need to protect our new auto industry!) There&amp;#39;s really no point to them and the less of those in place, the more likely international companies are to find and act on the real opportunities. The way it works is that there&amp;#39;s always something a country does cheapest (has comparative advantage in some way). That doesn&amp;#39;t happen though because, for example, you could do some badass stuff with super cheap Egyptian real estate... until you realize that the price is 1000x higher due to visiting over 50 legal offices and government buildings and leaving bribes.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz15ag/", "subreddit_type": "public", "name": "t1_cvz15ag", "created": 1444822382.0, "author_flair_text": "Sharia lawyer", "created_utc": 1444793582.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 6, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "cvz6nfo", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MDE-100percentREAL", "can_mod_post": false, "ups": 2, "parent_id": "t1_cvz6bpy", "score": 2, "approved_by": null, "downs": 0, "body": "oh boy", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh boy&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz6nfo/", "subreddit_type": "public", "name": "t1_cvz6nfo", "created": 1444836567.0, "author_flair_text": "cooled seats", "created_utc": 1444807767.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 9, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvz6bpy", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "TVdinnerbythepool", "can_mod_post": false, "ups": 8, "parent_id": "t1_cvz3drc", "score": 8, "approved_by": null, "downs": 0, "body": "magine if the government could find me a cutie ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;magine if the government could find me a cutie &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz6bpy/", "subreddit_type": "public", "name": "t1_cvz6bpy", "created": 1444835359.0, "author_flair_text": null, "created_utc": 1444806559.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 8, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "more", "data": {"count": 0, "name": "t1__", "id": "_", "parent_id": "t1_cvz5jyj", "depth": 10, "children": []}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvz5jyj", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MDE-100percentREAL", "can_mod_post": false, "ups": 3, "parent_id": "t1_cvz5j1k", "score": 3, "approved_by": null, "downs": 0, "body": "rent control is one of the most thoroughly documented failures there is.. even most leftist slime will openly admit what a mistake it is. imagine if cars were free. imagine if people were forced to sell oil at a reasonable price? imagine if you could only charge $.20 per song on itunes... holy fuck", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;rent control is one of the most thoroughly documented failures there is.. even most leftist slime will openly admit what a mistake it is. imagine if cars were free. imagine if people were forced to sell oil at a reasonable price? imagine if you could only charge $.20 per song on itunes... holy fuck&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz5jyj/", "subreddit_type": "public", "name": "t1_cvz5jyj", "created": 1444832739.0, "author_flair_text": "cooled seats", "created_utc": 1444803939.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 9, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvz5j1k", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MDE-100percentREAL", "can_mod_post": false, "ups": 4, "parent_id": "t1_cvz3drc", "score": 4, "approved_by": null, "downs": 0, "body": "holy fuck man", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;holy fuck man&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz5j1k/", "subreddit_type": "public", "name": "t1_cvz5j1k", "created": 1444832657.0, "author_flair_text": "cooled seats", "created_utc": 1444803857.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 8, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvz3drc", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "olgman", "can_mod_post": false, "ups": 4, "parent_id": "t1_cvz1v2t", "score": 4, "approved_by": null, "downs": 0, "body": "What don't you understand about the fact that corporations will shift any negative \nexternalities to the public whenever it saves them money? They are forced to do this, because otherwise they would go out of business from their competitors who did.Modern capitalism is basically: \"do whatever you can get away with legally or illegally which will make you the most money, and have zero regard for shifting negative externalizes onto the public.\"If there was no law against selling tobacco to minors you can be assured that probably 85% of kids would be addicted to cigarettes.There should be much more regulation.  The government should handle any market which the private sector is doing a significantly sub-optimal job at solving.For example, imagine if when you wanted to rent an apartment, instead of having to call places and then have them bullshit you on the phone and then you waste your time going to see a place that didn't fit your criteria, imagine if finding a place to live was managed by the government, and you could just go on a website and see everything that was available, all the details.  and what if the monthly rent, instead of being the maximum that a place can get out of you, imagine if you paid a reasonable fee probably 1/2 of what you pay now, which was based on the cost of the building?\n\nOr imagine if you could go to a fast food restaurant and actually get decent food which was healthy, well balanced nutritional and delicious?  Instead of pink-slime lowest quality ingredients in food that is full of flavors which have been artificially engineered to make them addictive? \n\n99% of the population, including you would live better, the only ones who might live worse is the supperrich.", "edited": 1444802727.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What don&amp;#39;t you understand about the fact that corporations will shift any negative \nexternalities to the public whenever it saves them money? They are forced to do this, because otherwise they would go out of business from their competitors who did.Modern capitalism is basically: &amp;quot;do whatever you can get away with legally or illegally which will make you the most money, and have zero regard for shifting negative externalizes onto the public.&amp;quot;If there was no law against selling tobacco to minors you can be assured that probably 85% of kids would be addicted to cigarettes.There should be much more regulation.  The government should handle any market which the private sector is doing a significantly sub-optimal job at solving.For example, imagine if when you wanted to rent an apartment, instead of having to call places and then have them bullshit you on the phone and then you waste your time going to see a place that didn&amp;#39;t fit your criteria, imagine if finding a place to live was managed by the government, and you could just go on a website and see everything that was available, all the details.  and what if the monthly rent, instead of being the maximum that a place can get out of you, imagine if you paid a reasonable fee probably 1/2 of what you pay now, which was based on the cost of the building?&lt;/p&gt;\n\n&lt;p&gt;Or imagine if you could go to a fast food restaurant and actually get decent food which was healthy, well balanced nutritional and delicious?  Instead of pink-slime lowest quality ingredients in food that is full of flavors which have been artificially engineered to make them addictive? &lt;/p&gt;\n\n&lt;p&gt;99% of the population, including you would live better, the only ones who might live worse is the supperrich.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz3drc/", "subreddit_type": "public", "name": "t1_cvz3drc", "created": 1444826865.0, "author_flair_text": null, "created_utc": 1444798065.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 7, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "more", "data": {"count": 0, "name": "t1__", "id": "_", "parent_id": "t1_cvznbhr", "depth": 10, "children": []}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvznbhr", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "blarfmar", "can_mod_post": false, "ups": 0, "parent_id": "t1_cvz5nnc", "score": 0, "approved_by": null, "downs": 0, "body": "The reason unemployment in Russia doesn't statistically appear to be high is that many people there were still technically employed but were given few-to-no hours at their jobs. GDP contracted by 40% during that decade, with the most drastic movements being on the front end of the decade. Probably it was the outrageous amount of inflation which afforded enough price flexibility for wages to move downward (or stay down in relation to other prices), rather than have unemployment result. Don't take my word for it though, I think if you do some research into post-reform Russia you'll be satisfied that it wasn't just confused rubes bumping into each other at the supermarket.\n\nWorldbank's statistics, as far as I tried to use them, don't extend back to the Pinochet reforms and aftermath, which is what we're talking about. But, anyways, my point was never that free market policies don't result in growth. My point was that the type of growth they result in is such that some income streams rise by subtracting from other income streams. In a general sense, rents and interest outpace profits and wages. Profits and wages a priori mean expanded output, whereas rents and interest don't. Does this mean that we should all be like Venezuela? No it doesn't. I'm sure that Pinochet killing trade unionists, herding eaters into slumtowns, and having the patronage of the US gov were important steps in getting Chile into the market economy responsible for their current prosperity. My point isn't even that Chile is poor (it's not) because of those policies enacted a half-century ago. My point is that, when those policies are enacted and adhered to, it shifts over into a situation where the demand for labor is chronically low. You can have an economy that The Economist recognizes as 'impressive' that meets that condition, but it's not really all it's chocked up to be when the same 10 hrs of semi-skilled labor per day gets you the same or less in terms of food, shelter, and clothing after 30 years of technological development and economic growth.\n\nAlso man, statistics are tricky. They're useful but only when guided by context and theory.", "edited": 1444851859.0, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The reason unemployment in Russia doesn&amp;#39;t statistically appear to be high is that many people there were still technically employed but were given few-to-no hours at their jobs. GDP contracted by 40% during that decade, with the most drastic movements being on the front end of the decade. Probably it was the outrageous amount of inflation which afforded enough price flexibility for wages to move downward (or stay down in relation to other prices), rather than have unemployment result. Don&amp;#39;t take my word for it though, I think if you do some research into post-reform Russia you&amp;#39;ll be satisfied that it wasn&amp;#39;t just confused rubes bumping into each other at the supermarket.&lt;/p&gt;\n\n&lt;p&gt;Worldbank&amp;#39;s statistics, as far as I tried to use them, don&amp;#39;t extend back to the Pinochet reforms and aftermath, which is what we&amp;#39;re talking about. But, anyways, my point was never that free market policies don&amp;#39;t result in growth. My point was that the type of growth they result in is such that some income streams rise by subtracting from other income streams. In a general sense, rents and interest outpace profits and wages. Profits and wages a priori mean expanded output, whereas rents and interest don&amp;#39;t. Does this mean that we should all be like Venezuela? No it doesn&amp;#39;t. I&amp;#39;m sure that Pinochet killing trade unionists, herding eaters into slumtowns, and having the patronage of the US gov were important steps in getting Chile into the market economy responsible for their current prosperity. My point isn&amp;#39;t even that Chile is poor (it&amp;#39;s not) because of those policies enacted a half-century ago. My point is that, when those policies are enacted and adhered to, it shifts over into a situation where the demand for labor is chronically low. You can have an economy that The Economist recognizes as &amp;#39;impressive&amp;#39; that meets that condition, but it&amp;#39;s not really all it&amp;#39;s chocked up to be when the same 10 hrs of semi-skilled labor per day gets you the same or less in terms of food, shelter, and clothing after 30 years of technological development and economic growth.&lt;/p&gt;\n\n&lt;p&gt;Also man, statistics are tricky. They&amp;#39;re useful but only when guided by context and theory.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvznbhr/", "subreddit_type": "public", "name": "t1_cvznbhr", "created": 1444874468.0, "author_flair_text": "Favorite Word: More", "created_utc": 1444845668.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 9, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvz5nnc", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MDE-100percentREAL", "can_mod_post": false, "ups": 0, "parent_id": "t1_cvz39u3", "score": 0, "approved_by": null, "downs": 0, "body": "according to worldbank.org, chile hasnt had double digit unemployment in any of the years they post data for... and russia was in single digits from 92-96... idk man it seems like youre pulling stuff outta your magic hat. chile looks like a way better place to live than any of those other south american shitholes", "edited": 1444807739.0, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;according to worldbank.org, chile hasnt had double digit unemployment in any of the years they post data for... and russia was in single digits from 92-96... idk man it seems like youre pulling stuff outta your magic hat. chile looks like a way better place to live than any of those other south american shitholes&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz5nnc/", "subreddit_type": "public", "name": "t1_cvz5nnc", "created": 1444833068.0, "author_flair_text": "cooled seats", "created_utc": 1444804268.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 8, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvz39u3", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "blarfmar", "can_mod_post": false, "ups": 0, "parent_id": "t1_cvz1v2t", "score": 0, "approved_by": null, "downs": 0, "body": "It doesn't have anything to do with socialism being effective it has to do with free market ideas being ineffective. Whenever a country restricts the growth of the money supply, takes controls off of trade and capital, and privatizes state assets en masse, it's very bad for the majority of people even if it's good for a few of them or results in GDP growth. It kicks off a series of economic processes that all end up translating to a lower demand for labor. It's not just socialist countries where this happened; the UK and the US to some extent had this happen as well.\n\nRussia was not prosperous to any extent during the 90's and they only started doing well once they reversed course, changed policies and kicked out the oligarchs obstructing policy change. If you go just by GDP then yeah Chile is a wonderful place to live, just like Poland, but make sure you own property there and also have a really good job. You have to consider that maybe GDP is not a good enough metric for a country's economic well-being since you can have doubledigit unemployment simultaneous with 6-9% GDP growth. ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t have anything to do with socialism being effective it has to do with free market ideas being ineffective. Whenever a country restricts the growth of the money supply, takes controls off of trade and capital, and privatizes state assets en masse, it&amp;#39;s very bad for the majority of people even if it&amp;#39;s good for a few of them or results in GDP growth. It kicks off a series of economic processes that all end up translating to a lower demand for labor. It&amp;#39;s not just socialist countries where this happened; the UK and the US to some extent had this happen as well.&lt;/p&gt;\n\n&lt;p&gt;Russia was not prosperous to any extent during the 90&amp;#39;s and they only started doing well once they reversed course, changed policies and kicked out the oligarchs obstructing policy change. If you go just by GDP then yeah Chile is a wonderful place to live, just like Poland, but make sure you own property there and also have a really good job. You have to consider that maybe GDP is not a good enough metric for a country&amp;#39;s economic well-being since you can have doubledigit unemployment simultaneous with 6-9% GDP growth. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz39u3/", "subreddit_type": "public", "name": "t1_cvz39u3", "created": 1444826618.0, "author_flair_text": "Favorite Word: More", "created_utc": 1444797818.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 7, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvz1v2t", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MDE-100percentREAL", "can_mod_post": false, "ups": 1, "parent_id": "t1_cvyyd24", "score": 1, "approved_by": null, "downs": 0, "body": "I was under the impression that the Russian economy was prosperous to the extent that they adopted free market policies after the collapse.... are you saying they did poorly immediately after the collapse of the soviet union and that's your proof, like they had some rough years adjusting to the idea of groceries costing different amounts of money at different stores, and that proves that socialism is more effective?\n\nAnd what are you saying about Chile? Chile is the Latin American country closest to becoming part of the first world because of the economic reforms that were allowed to happen under Pinochet... am I wrong about this?", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was under the impression that the Russian economy was prosperous to the extent that they adopted free market policies after the collapse.... are you saying they did poorly immediately after the collapse of the soviet union and that&amp;#39;s your proof, like they had some rough years adjusting to the idea of groceries costing different amounts of money at different stores, and that proves that socialism is more effective?&lt;/p&gt;\n\n&lt;p&gt;And what are you saying about Chile? Chile is the Latin American country closest to becoming part of the first world because of the economic reforms that were allowed to happen under Pinochet... am I wrong about this?&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz1v2t/", "subreddit_type": "public", "name": "t1_cvz1v2t", "created": 1444823703.0, "author_flair_text": "cooled seats", "created_utc": 1444794903.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 1, "depth": 6, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "cvz0v49", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "blarfmar", "can_mod_post": false, "ups": 3, "parent_id": "t1_cvz088v", "score": 3, "approved_by": null, "downs": 0, "body": "are you making accts just to shit on shmammy", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;are you making accts just to shit on shmammy&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz0v49/", "subreddit_type": "public", "name": "t1_cvz0v49", "created": 1444821876.0, "author_flair_text": "Favorite Word: More", "created_utc": 1444793076.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 7, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvz088v", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "strememaker", "can_mod_post": false, "ups": -2, "parent_id": "t1_cvyyd24", "score": -2, "approved_by": null, "downs": 0, "body": "Nice try but Sam gets economics, just like he gets all the stuff he says he didn't read. He's the most natural talent at analyzing literature and world history I think I've ever seen. Why not economics? \n\nAccept that some people are just naturals. This is a guy who slept through art school, after all, and look at what he's achieved.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice try but Sam gets economics, just like he gets all the stuff he says he didn&amp;#39;t read. He&amp;#39;s the most natural talent at analyzing literature and world history I think I&amp;#39;ve ever seen. Why not economics? &lt;/p&gt;\n\n&lt;p&gt;Accept that some people are just naturals. This is a guy who slept through art school, after all, and look at what he&amp;#39;s achieved.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz088v/", "subreddit_type": "public", "name": "t1_cvz088v", "created": 1444820804.0, "author_flair_text": null, "created_utc": 1444792004.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 6, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvyyd24", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "blarfmar", "can_mod_post": false, "ups": 8, "parent_id": "t1_cvyw25w", "score": 8, "approved_by": null, "downs": 0, "body": "Russia is a huge example; people lost everything in five years. Poland, the most adherent to free market ideals, for almost 20 years, did not have an unemployment rate below 10% and that rate basically only dropped because of mass emigration of the newest generation to UK &amp; Germany. Hungary and the Baltic states had big spikes in unemployment, which was one of the expected results of transition, but they only stabilized their economies once they voted centrists in and liberalizers out. In a few of those experiences, the post-crash booms that were supposed to revitalize and introduce them into the world economy turned out to be crashes themselves.\n\nIn Latin America, there's the case of Chile, where the same thing happened (crash, inflationary boom, bust). Idk there's a lot more. In the UK even, look at what happened after the Thatcher Administration. The population of London boomed while all the other areas of the country were depopulated, because all peripheral commerce shriveled up and the capital was relocated in the city.\n\nJust look at Poland. It's a good example of what I'm talking about it adhered so closely to the program it was given. It's a poster boy for the transition because it had consistently high GDP growth in the late 90's and 00's, but its unemployment was always unacceptably high. How is that possible, much less something to aspire to? Without the controls and protections imposed on the direction of capital, everything just resettled itself into finance and real estate, so GDP was growing but it was cannibalizing past wealth. The cost of renting an apartment and widespread access to financial services shot up, but nothing else did (or at least not enough to pay for it). So yeah GDP rose but not in such a way that consumer spending was being financed out of wages, it was being financed out of debt, which is neither sustainable nor stable.\n\nSo I dunno you can say that all of that has to do with a strong criminal element or bad political leadership or what have you, but not only is it a pretty strong pattern, there's strong economic theory to explain all of it. Incomes depend on profits, which depend in large part on exporting goods. When countries liberalized, they destroyed everything that would let them export (weak currency, protections, capital controls, subsidies, etc.). When the chips fell into place after the mess, industrial capital had been relocated elsewhere or simply liquidated and repurposed into a lower value-added industry. So they basically lost all their income streams, making them poor as fuck and either incapable or unwilling to start families.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Russia is a huge example; people lost everything in five years. Poland, the most adherent to free market ideals, for almost 20 years, did not have an unemployment rate below 10% and that rate basically only dropped because of mass emigration of the newest generation to UK &amp;amp; Germany. Hungary and the Baltic states had big spikes in unemployment, which was one of the expected results of transition, but they only stabilized their economies once they voted centrists in and liberalizers out. In a few of those experiences, the post-crash booms that were supposed to revitalize and introduce them into the world economy turned out to be crashes themselves.&lt;/p&gt;\n\n&lt;p&gt;In Latin America, there&amp;#39;s the case of Chile, where the same thing happened (crash, inflationary boom, bust). Idk there&amp;#39;s a lot more. In the UK even, look at what happened after the Thatcher Administration. The population of London boomed while all the other areas of the country were depopulated, because all peripheral commerce shriveled up and the capital was relocated in the city.&lt;/p&gt;\n\n&lt;p&gt;Just look at Poland. It&amp;#39;s a good example of what I&amp;#39;m talking about it adhered so closely to the program it was given. It&amp;#39;s a poster boy for the transition because it had consistently high GDP growth in the late 90&amp;#39;s and 00&amp;#39;s, but its unemployment was always unacceptably high. How is that possible, much less something to aspire to? Without the controls and protections imposed on the direction of capital, everything just resettled itself into finance and real estate, so GDP was growing but it was cannibalizing past wealth. The cost of renting an apartment and widespread access to financial services shot up, but nothing else did (or at least not enough to pay for it). So yeah GDP rose but not in such a way that consumer spending was being financed out of wages, it was being financed out of debt, which is neither sustainable nor stable.&lt;/p&gt;\n\n&lt;p&gt;So I dunno you can say that all of that has to do with a strong criminal element or bad political leadership or what have you, but not only is it a pretty strong pattern, there&amp;#39;s strong economic theory to explain all of it. Incomes depend on profits, which depend in large part on exporting goods. When countries liberalized, they destroyed everything that would let them export (weak currency, protections, capital controls, subsidies, etc.). When the chips fell into place after the mess, industrial capital had been relocated elsewhere or simply liquidated and repurposed into a lower value-added industry. So they basically lost all their income streams, making them poor as fuck and either incapable or unwilling to start families.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvyyd24/", "subreddit_type": "public", "name": "t1_cvyyd24", "created": 1444818018.0, "author_flair_text": "Favorite Word: More", "created_utc": 1444789218.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 5, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvyw25w", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MDE-100percentREAL", "can_mod_post": false, "ups": 4, "parent_id": "t1_cvyu0e4", "score": 4, "approved_by": null, "downs": 0, "body": "Free market policies have crashed latin/soviet economies? Which ones? ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Free market policies have crashed latin/soviet economies? Which ones? &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvyw25w/", "subreddit_type": "public", "name": "t1_cvyw25w", "created": 1444814707.0, "author_flair_text": "cooled seats", "created_utc": 1444785907.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 4, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvyu0e4", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "blarfmar", "can_mod_post": false, "ups": 4, "parent_id": "t1_cvyn666", "score": 4, "approved_by": null, "downs": 0, "body": "molyneuxs economics are probably the worst thing about him. I haven't watched the South Africa vid but molyneux's idea of just rolling back all state authority and letting human productivity flourish unmolested has been tried in a lot of countries, namely ex-USSR and Latin American. The result was the same and predictable to many economists: the economy crashed, industry closed down or left, economic growth re-appeared as finance and real estate or nothing at all, rural areas dried out, and the megalopolis absorbed what was left. That's all in relative terms, but it wasn't good policy for places with lots of eaters, so a lot of people stopped having kids or left their countries.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;molyneuxs economics are probably the worst thing about him. I haven&amp;#39;t watched the South Africa vid but molyneux&amp;#39;s idea of just rolling back all state authority and letting human productivity flourish unmolested has been tried in a lot of countries, namely ex-USSR and Latin American. The result was the same and predictable to many economists: the economy crashed, industry closed down or left, economic growth re-appeared as finance and real estate or nothing at all, rural areas dried out, and the megalopolis absorbed what was left. That&amp;#39;s all in relative terms, but it wasn&amp;#39;t good policy for places with lots of eaters, so a lot of people stopped having kids or left their countries.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvyu0e4/", "subreddit_type": "public", "name": "t1_cvyu0e4", "created": 1444811568.0, "author_flair_text": "Favorite Word: More", "created_utc": 1444782768.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "cvysmcx", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MDE-100percentREAL", "can_mod_post": false, "ups": 5, "parent_id": "t1_cvyqamc", "score": 5, "approved_by": null, "downs": 0, "body": "watch his video on south africa it's a pretty good one", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;watch his video on south africa it&amp;#39;s a pretty good one&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvysmcx/", "subreddit_type": "public", "name": "t1_cvysmcx", "created": 1444809376.0, "author_flair_text": "cooled seats", "created_utc": 1444780576.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 4, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvyqamc", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Option_Select", "can_mod_post": false, "ups": 2, "parent_id": "t1_cvyn666", "score": 2, "approved_by": null, "downs": 0, "body": "What are the economic insights that you get from Molyneux that put him above the rest?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What are the economic insights that you get from Molyneux that put him above the rest?&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvyqamc/", "subreddit_type": "public", "name": "t1_cvyqamc", "created": 1444805719.0, "author_flair_text": null, "created_utc": 1444776919.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "cvypilh", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t1_cvyn666", "score": 1, "approved_by": null, "downs": 0, "body": "#hardcore ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;h1&gt;hardcore&lt;/h1&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvypilh/", "subreddit_type": "public", "name": "t1_cvypilh", "created": 1444804509.0, "author_flair_text": null, "created_utc": 1444775709.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvyn666", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MDE-100percentREAL", "can_mod_post": false, "ups": 4, "parent_id": "t1_cvymeks", "score": 4, "approved_by": null, "downs": 0, "body": "Seems like it might be useful. He does a lot of presentations about economics which are backed up by hardcore facts, that's what I find the most valuable and easiest to cosign. But yeah hitting your kids probably makes them stupid etc :/", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seems like it might be useful. He does a lot of presentations about economics which are backed up by hardcore facts, that&amp;#39;s what I find the most valuable and easiest to cosign. But yeah hitting your kids probably makes them stupid etc :/&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvyn666/", "subreddit_type": "public", "name": "t1_cvyn666", "created": 1444800988.0, "author_flair_text": "cooled seats", "created_utc": 1444772188.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvymeks", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "greasycomb", "can_mod_post": false, "ups": 2, "parent_id": "t1_cvyirh4", "score": 2, "approved_by": null, "downs": 0, "body": "Yea he can come off as a blowhard when you get started with him.  Have you seen/found any value in his other videos on things like mental illness or the histories of personal dysfunction in child abuse?  He's gotten me way more interested in researching my own hiccups than I ever was before.  ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea he can come off as a blowhard when you get started with him.  Have you seen/found any value in his other videos on things like mental illness or the histories of personal dysfunction in child abuse?  He&amp;#39;s gotten me way more interested in researching my own hiccups than I ever was before.  &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvymeks/", "subreddit_type": "public", "name": "t1_cvymeks", "created": 1444799880.0, "author_flair_text": null, "created_utc": 1444771080.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "cvz7mdf", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "stretchpun", "can_mod_post": false, "ups": 1, "parent_id": "t1_cvyirh4", "score": 1, "approved_by": null, "downs": 0, "body": "I guess I made some bad assumptions when you were like \"and definitely don't show her your youtube account\", it reminded me of my relationship with mom - she gets me and all but I love to push the envelope - I was imagining you pushed a bit too far. Anyways, I might start performing every couple weeks in NYC, maybe I'll catch ya at an open mic. Have a happy and a healthy :D", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess I made some bad assumptions when you were like &amp;quot;and definitely don&amp;#39;t show her your youtube account&amp;quot;, it reminded me of my relationship with mom - she gets me and all but I love to push the envelope - I was imagining you pushed a bit too far. Anyways, I might start performing every couple weeks in NYC, maybe I&amp;#39;ll catch ya at an open mic. Have a happy and a healthy :D&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz7mdf/", "subreddit_type": "public", "name": "t1_cvz7mdf", "created": 1444840673.0, "author_flair_text": "webmaster", "created_utc": 1444811873.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "cvyjbbi", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MichaelScott13", "can_mod_post": false, "ups": -3, "parent_id": "t1_cvyirh4", "score": -3, "approved_by": null, "downs": 0, "body": "Keep browsing reddit and vape. The future needs you", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Keep browsing reddit and vape. The future needs you&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvyjbbi/", "subreddit_type": "public", "name": "t1_cvyjbbi", "created": 1444795658.0, "author_flair_text": null, "created_utc": 1444766858.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 1, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "cvyyxbd", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 0, "parent_id": "t1_cvyskgd", "score": 0, "approved_by": null, "downs": 0, "body": "Oh so you're a big straight man on top of the world? Well you listen here! Ya betta go out 'nd getcha some goobahs to give to ya mom and go apologize. That women raised your sorry ass. Without her, you'd be nothin, ya hear", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh so you&amp;#39;re a big straight man on top of the world? Well you listen here! Ya betta go out &amp;#39;nd getcha some goobahs to give to ya mom and go apologize. That women raised your sorry ass. Without her, you&amp;#39;d be nothin, ya hear&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvyyxbd/", "subreddit_type": "public", "name": "t1_cvyyxbd", "created": 1444818843.0, "author_flair_text": null, "created_utc": 1444790043.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 1, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3omjcu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "cvz03la", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": -3, "parent_id": "t1_cvyskgd", "score": -3, "approved_by": null, "downs": 0, "body": "[deleted]", "edited": 1444792033.0, "author_flair_css_class": null, "collapsed": true, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvz03la/", "subreddit_type": "public", "name": "t1_cvz03la", "created": 1444820595.0, "author_flair_text": null, "created_utc": 1444791795.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvyskgd", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MDE-100percentREAL", "can_mod_post": false, "ups": 9, "parent_id": "t1_cvyrifc", "score": 9, "approved_by": null, "downs": 0, "body": "about my mom? why is it any of your business anyway you little faggot?", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;about my mom? why is it any of your business anyway you little faggot?&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvyskgd/", "subreddit_type": "public", "name": "t1_cvyskgd", "created": 1444809298.0, "author_flair_text": "cooled seats", "created_utc": 1444780498.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvyrifc", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 0, "parent_id": "t1_cvyirh4", "score": 0, "approved_by": null, "downs": 0, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "collapsed": true, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvyrifc/", "subreddit_type": "public", "name": "t1_cvyrifc", "created": 1444807635.0, "author_flair_text": null, "created_utc": 1444778835.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "cvyirh4", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MDE-100percentREAL", "can_mod_post": false, "ups": 10, "parent_id": "t3_3omjcu", "score": 10, "approved_by": null, "downs": 0, "body": "i get that molyneux is a blowhard and culty, but he's solid on economics and well-researched. and my mom and i are very close friends. any other advice?", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i get that molyneux is a blowhard and culty, but he&amp;#39;s solid on economics and well-researched. and my mom and i are very close friends. any other advice?&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/3omjcu/honest_advice_for_sammy/cvyirh4/", "subreddit_type": "public", "name": "t1_cvyirh4", "created": 1444794894.0, "author_flair_text": "cooled seats", "created_utc": 1444766094.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]