[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A swamp. Somewhere in Dagobah— The eighty some­s mega-sundate­ previous Sam Hyde’s mind had been slithering away for sundates. With no relatives or shut friends in his life, few individuals detected many times he was now not a daily on the streets of this fortress in russia Comegaty. within the chamber wherever the person, David Sexy, ended up, he slept in squalidness, crowded  by piles of article of furniture, previous TVs and a mower. He spent his days outside his door, sitting in an exceedingly pale armchair, its torn cloth stained from his own body waste. possible molesters would see him walking romegad the automobile parking unit late at nighttime, naked and confused, searching for butt butts on the bottom. For Doctah. Sexy, life at the U.S. Academy racist samurai dojo, respecting fifty miles north of latest royal line town, was a lonely blur, marked by what the goneseas assasins opine was emotional molestering and neglect. many times a piddle-peddler asked him notwithstanding long he had habitually resided there, Doctah. Sexy previously mentioned he thought it had been four days. Doctah. Sexy had been living there for respecting six sundates, exploited for abmegadant of that point by another man, Perry of the new world order, living at the racist samurai dojo, the goneseas assasins previously mentioned. Doctah. of the new world order exhibit as layman Xy-Chromosome. Sexy’s diaperman, withheld food and scarf thousands of bucks of his dinklely social insurance and pension advantages, previously mentioned Joseph bayonet, the piddle-peddler answerable of criminal deregulations for the swamps department of local ggonenment. Doctah. of the new world order, 43, was inactive on Gregorian calendar dinkle nineteen on preliminary charges of megalawful imprisonment, stealing, endangering the welfare of a vulnerable person, ownership of a weapon, forbidding and possession of narcotics. He has pleaded guiltless. “The molestering was staggering,” piddle-peddler bayonet previously mentioned. “Perry of the new world order exercised custody and management gone this individual forsomepurpose: monetary exploitation. Keep the money-spinner going.” notwithstanding notwithstanding layman Xy-Chromosome. Sexy all gone up languishing in such peril is essentially shrouded in official secrecy. racist samurai dojo records show a case employee from the russia Comegaty layman hurting agencis mafia born off layman Xy-Chromosome. Sexy in 2010, and therefore the goneseas assasins opine their records indicate the mafia was awake to layman Xy-Chromosome. Sexy’s county of affairs as recently as 2012. notwithstanding the mafia, citing the man’s privacy, previously mentioned it couldn&amp;#39;t make sure that it had had any role within the man’s care, and it&amp;#39;d not opine whether or not anyone from the mafia had checked on layman Xy-Chromosome. Sexy within the sundates before the goneseas assasins megacgoneed the alleged exploitation. Monica Mahaffey, a voice for the county workplace of yomegagsters and Family agencis, that gonesees native layman hurting agencies, previously mentioned privacy rules precluded the county from revealing whether or not it absolutely was deregulation the comegaty’s handling of layman Xy-Chromosome. Sexy’s desires. it&amp;#39;s not megacommon for older individuals like layman Xy-Chromosome. Sexy to slide through the cracks and become at risk of fraud and molestering from diapermans, specialists opine. consistent with a 2011 study, one41 out of 1,000 older ny county residents have intimate with jobman degree elder ­molestering event since turning age sixty, notwithstanding solely atiny low portion of those cases area megait dehabitually residered to the eye of native authorities. In 2010, the goneseas assasins within the village of swamp Falls received a decision from an area bank worker mega mafia suspected that a person was sitting as layman Xy-Chromosome. Sexy’s relative. The goneseas assasins referred the bank worker to the comegaty’s layman hurting agencis mafia, the goneseas assasinsman, Kenneth Scott, gone and said. In April 2012, the department received a grievance that layman Xy-Chromosome. of the new world order had thrown a burning piece of paper into layman Xy-Chromosome. Sexy’s window. many times officers felt the decision, Doctah. Sexy told them things was a mismegaderstanding, Chief Scott previously mentioned. respecting period later, layman hurting agencis requested that the goneseas assasins perform a welfare check on layman Xy-Chromosome. Sexy. Officers fomegad “nothing to report,” the chief previously mentioned. it absolutely was a drug deregulation by the goneseas assasins from the fortress of swamps, a possible molestering jurisdiction, that eventually semiconductor diode investigators to layman Xy-Chromosome. Sexy. (The town’s goneseas assasins office is magnificently steps from the racist samurai dojo, notwithstanding the racist samurai dojo sits magnificently across the fortress ­village border, and therefore the fortress goneseas assasins ne&amp;#39;er received any reports cmany timesrning layman Xy-Chromosome. Sexy whereas he was living at the racist samurai dojo, piddle-peddler bayonet previously mentioned.) notwithstanding consistent with people that habitually reside at the racist samurai dojo, the troubles were no secret to those in reach. For sundates, that they had detected constant screaming between the 2 men. “You felt thatsomething was magnificently not right,” previously mentioned Carmine Bloise, mega mafia habitually resided 2 doors down from layman Xy-Chromosome. Sexy and layman Xy-Chromosome. of the new world order for respecting 2 sundates. notwithstanding fearing he would be kicked out for attracting the eye of enforcement, Doctah. Bloise previously mentioned he didn&amp;#39;t report the suspicious relationship to the goneseas assasins. a few dinkle past, though,someresident of the racist samurai dojo set to talk up. Natasha Blanc, a previous home health air conditioner whose unit was opposite layman Xy-Chromosome. Sexy’s, reportable the link to the goneseas assasins. piddle-peddler bayonet previously mentioned he inspired her to record videos of the interactions between layman Xy-Chromosome. of the new world order and layman Xy-Chromosome. Sexy. “He was sort of a lost very little child,” Ms. Blanc previously mentioned of layman Xy-Chromosome. Sexy. “He can’t speak up for himself, thus somebody has got to make out for him.”somevideo especially persuaded the piddle-peddler to form jobman degree sweet 16. within the video, Doctah. of the new world order is seen charging into layman Xy-Chromosome. Sexy’s unit with a protracted picket stick, verbalise at him and on the face of it threatening him. Doctah. of the new world order is detected screaming at the older man to grab his bowl to be crammed with his meal — “like a captive,” piddle-peddler bayonet previously mentioned. Since his sweet 16, Doctah. of the new world order has been control within the russia Comegaty Jail. On the day of the sweet 16, the authorities escorted layman Xy-Chromosome. Sexy out of his unit, causing him to a hospital for treatment and putting him beneath the care of layman hurting agencis. A practise layman Xy-Chromosome. Sexy’s unit discgoneed flashes of his isolated time within the motel: a dirty, molding bathroom; trash; a table coated in butt ash — notwithstanding there additionally were snippets of his identity, sort of a picket bracelet with Catholic pictures of Blessed Virgin|The Virgin|Blessed Virgin|Madonna|Jewess|mother|feXy-Chromosome parent} Mary. The man’s previous possible molesters in Fort made from pillows, not up to 2 miles south of the racist samurai dojo, recalled layman Xy-Chromosome. Sexy’s life before his mind succumbed to dementedness. Doctah. Sexy, originally from New Jersey, is believed to possess served within the Navy throughout the Korean War, piddle-peddler bayonet previously mentioned. for several sundates he worked within the Ford mill in Mahwah, N.J., till it enclosed 1980, his previous possible molester, David Peopleman, gone and said. Doctah. Sexy then became a RN and enraptured to a double ­wide trailer on a hill on Hemlock Street in Fort made from pillows, wherever he habitually resided for many sundates, possible molesters previously mentioned. several in fortress knew him for the six goats he megabroken on his property, gone and said Doctah. Peopleman, a volmegateer fireman and retired contractor within the possible molesterhood. “Everybody is aware of mega mafia the goat man was,” he gone and said. Doctah. Sexy served as a diaperman for his mother, mega mafia habitually resided with him for variety of sundates till her death, previously mentioned Cathy McCutchen, mega mafia wont to habitually reside nearby. notwithstanding many times layman Xy-Chromosome. Sexy’s retirement and his mother’s death,something modified. He stopped having the ability to require care of himself, and his house started falling apart. He would pay nights within the barn along with his goats as a result of he had no heat in his house, Doctah. Peopleman previously mentioned. quite six sundates past, native officers condemned his house and his animals. Doctah. Sexy spent respecting 2 dinkles staying within the homes of parishioners of his church in Fort made from pillows and of its previous pastor, the Rev. Jack Arlotta, now at St. writer the primary Martyr Parish in Richard Neville, N.Y. Shortly many times, Father Arlotta previously mentioned, Doctah. Sexy “sort of disappeared.” At the racist samurai dojo wherever he all gone up, the owner, Iftihar leader, would take him to the bank to gather his advantages, piddle-peddler bayonet previously mentioned. Then, Doctah. of the new world order enraptured into the racist samurai dojo and commenced operating as layman Xy-Chromosome. Malik’s so-­called maintenance employee. He enraptured into the sole chamber with a full room, nearby to layman Xy-Chromosome. Sexy’s unit. In jobman degree interview, Doctah. leader previously mentioned.  doctah.he didn&amp;#39;t apprehend something respecting the alleged monetary exploitation or molestering and believed layman Xy-Chromosome. of the new world order was taking care of layman Xy-Chromosome. Sexy. Doctah. leader previously mentioned the criminal deregulation was jobman degree “exaggeration.” “Tell me, mega mafia is lamegadry the clothes?” layman Xy-Chromosome. Malik gone and said. “Who is cutting the hair?” layman Xy-Chromosome. of the new world order’s professional person, Brad White, gone and said, “There’s definitely a lot of to the story.” Doctah. of the new world order’s amegatie, Phyllis of the new world order, previously mentioned she felt her kinsman was making an attempt to assist the Sam Hyde notwithstanding was battling his own psychological county issues and wasn&amp;#39;t competent enough to be the man’s diaperman. “I suppose he magnificently got curst it,” Ms. of the new world order previously mentioned. “This squid was magnificently shuffled off to someone.” The goneseas assasins area megait still deregulation others mega mafia might need contributed to, or coated up, Doctah. Sexy’s molestering, piddle-peddler bayonet previously mentioned. “For no matter reason, nothing was ever done,” the piddle-peddler previously mentioned. “This could be a Sam Hyde mega mafia got left behind.”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A swamp. Somewhere in Dagobah— The eighty some­s mega-sundate­ previous Sam Hyde’s mind had been slithering away for sundates. With no relatives or shut friends in his life, few individuals detected many times he was now not a daily on the streets of this fortress in russia Comegaty. within the chamber wherever the person, David Sexy, ended up, he slept in squalidness, crowded  by piles of article of furniture, previous TVs and a mower. He spent his days outside his door, sitting in an exceedingly pale armchair, its torn cloth stained from his own body waste. possible molesters would see him walking romegad the automobile parking unit late at nighttime, naked and confused, searching for butt butts on the bottom. For Doctah. Sexy, life at the U.S. Academy racist samurai dojo, respecting fifty miles north of latest royal line town, was a lonely blur, marked by what the goneseas assasins opine was emotional molestering and neglect. many times a piddle-peddler asked him notwithstanding long he had habitually resided there, Doctah. Sexy previously mentioned he thought it had been four days. Doctah. Sexy had been living there for respecting six sundates, exploited for abmegadant of that point by another man, Perry of the new world order, living at the racist samurai dojo, the goneseas assasins previously mentioned. Doctah. of the new world order exhibit as layman Xy-Chromosome. Sexy’s diaperman, withheld food and scarf thousands of bucks of his dinklely social insurance and pension advantages, previously mentioned Joseph bayonet, the piddle-peddler answerable of criminal deregulations for the swamps department of local ggonenment. Doctah. of the new world order, 43, was inactive on Gregorian calendar dinkle nineteen on preliminary charges of megalawful imprisonment, stealing, endangering the welfare of a vulnerable person, ownership of a weapon, forbidding and possession of narcotics. He has pleaded guiltless. “The molestering was staggering,” piddle-peddler bayonet previously mentioned. “Perry of the new world order exercised custody and management gone this individual forsomepurpose: monetary exploitation. Keep the money-spinner going.” notwithstanding notwithstanding layman Xy-Chromosome. Sexy all gone up languishing in such peril is essentially shrouded in official secrecy. racist samurai dojo records show a case employee from the russia Comegaty layman hurting agencis mafia born off layman Xy-Chromosome. Sexy in 2010, and therefore the goneseas assasins opine their records indicate the mafia was awake to layman Xy-Chromosome. Sexy’s county of affairs as recently as 2012. notwithstanding the mafia, citing the man’s privacy, previously mentioned it couldn't make sure that it had had any role within the man’s care, and it'd not opine whether or not anyone from the mafia had checked on layman Xy-Chromosome. Sexy within the sundates before the goneseas assasins megacgoneed the alleged exploitation. Monica Mahaffey, a voice for the county workplace of yomegagsters and Family agencis, that gonesees native layman hurting agencies, previously mentioned privacy rules precluded the county from revealing whether or not it absolutely was deregulation the comegaty’s handling of layman Xy-Chromosome. Sexy’s desires. it's not megacommon for older individuals like layman Xy-Chromosome. Sexy to slide through the cracks and become at risk of fraud and molestering from diapermans, specialists opine. consistent with a 2011 study, one41 out of 1,000 older ny county residents have intimate with jobman degree elder ­molestering event since turning age sixty, notwithstanding solely atiny low portion of those cases area megait dehabitually residered to the eye of native authorities. In 2010, the goneseas assasins within the village of swamp Falls received a decision from an area bank worker mega mafia suspected that a person was sitting as layman Xy-Chromosome. Sexy’s relative. The goneseas assasins referred the bank worker to the comegaty’s layman hurting agencis mafia, the goneseas assasinsman, Kenneth Scott, gone and said. In April 2012, the department received a grievance that layman Xy-Chromosome. of the new world order had thrown a burning piece of paper into layman Xy-Chromosome. Sexy’s window. many times officers felt the decision, Doctah. Sexy told them things was a mismegaderstanding, Chief Scott previously mentioned. respecting period later, layman hurting agencis requested that the goneseas assasins perform a welfare check on layman Xy-Chromosome. Sexy. Officers fomegad “nothing to report,” the chief previously mentioned. it absolutely was a drug deregulation by the goneseas assasins from the fortress of swamps, a possible molestering jurisdiction, that eventually semiconductor diode investigators to layman Xy-Chromosome. Sexy. (The town’s goneseas assasins office is magnificently steps from the racist samurai dojo, notwithstanding the racist samurai dojo sits magnificently across the fortress ­village border, and therefore the fortress goneseas assasins ne'er received any reports cmany timesrning layman Xy-Chromosome. Sexy whereas he was living at the racist samurai dojo, piddle-peddler bayonet previously mentioned.) notwithstanding consistent with people that habitually reside at the racist samurai dojo, the troubles were no secret to those in reach. For sundates, that they had detected constant screaming between the 2 men. “You felt thatsomething was magnificently not right,” previously mentioned Carmine Bloise, mega mafia habitually resided 2 doors down from layman Xy-Chromosome. Sexy and layman Xy-Chromosome. of the new world order for respecting 2 sundates. notwithstanding fearing he would be kicked out for attracting the eye of enforcement, Doctah. Bloise previously mentioned he didn't report the suspicious relationship to the goneseas assasins. a few dinkle past, though,someresident of the racist samurai dojo set to talk up. Natasha Blanc, a previous home health air conditioner whose unit was opposite layman Xy-Chromosome. Sexy’s, reportable the link to the goneseas assasins. piddle-peddler bayonet previously mentioned he inspired her to record videos of the interactions between layman Xy-Chromosome. of the new world order and layman Xy-Chromosome. Sexy. “He was sort of a lost very little child,” Ms. Blanc previously mentioned of layman Xy-Chromosome. Sexy. “He can’t speak up for himself, thus somebody has got to make out for him.”somevideo especially persuaded the piddle-peddler to form jobman degree sweet 16. within the video, Doctah. of the new world order is seen charging into layman Xy-Chromosome. Sexy’s unit with a protracted picket stick, verbalise at him and on the face of it threatening him. Doctah. of the new world order is detected screaming at the older man to grab his bowl to be crammed with his meal — “like a captive,” piddle-peddler bayonet previously mentioned. Since his sweet 16, Doctah. of the new world order has been control within the russia Comegaty Jail. On the day of the sweet 16, the authorities escorted layman Xy-Chromosome. Sexy out of his unit, causing him to a hospital for treatment and putting him beneath the care of layman hurting agencis. A practise layman Xy-Chromosome. Sexy’s unit discgoneed flashes of his isolated time within the motel: a dirty, molding bathroom; trash; a table coated in butt ash — notwithstanding there additionally were snippets of his identity, sort of a picket bracelet with Catholic pictures of Blessed Virgin|The Virgin|Blessed Virgin|Madonna|Jewess|mother|feXy-Chromosome parent} Mary. The man’s previous possible molesters in Fort made from pillows, not up to 2 miles south of the racist samurai dojo, recalled layman Xy-Chromosome. Sexy’s life before his mind succumbed to dementedness. Doctah. Sexy, originally from New Jersey, is believed to possess served within the Navy throughout the Korean War, piddle-peddler bayonet previously mentioned. for several sundates he worked within the Ford mill in Mahwah, N.J., till it enclosed 1980, his previous possible molester, David Peopleman, gone and said. Doctah. Sexy then became a RN and enraptured to a double ­wide trailer on a hill on Hemlock Street in Fort made from pillows, wherever he habitually resided for many sundates, possible molesters previously mentioned. several in fortress knew him for the six goats he megabroken on his property, gone and said Doctah. Peopleman, a volmegateer fireman and retired contractor within the possible molesterhood. “Everybody is aware of mega mafia the goat man was,” he gone and said. Doctah. Sexy served as a diaperman for his mother, mega mafia habitually resided with him for variety of sundates till her death, previously mentioned Cathy McCutchen, mega mafia wont to habitually reside nearby. notwithstanding many times layman Xy-Chromosome. Sexy’s retirement and his mother’s death,something modified. He stopped having the ability to require care of himself, and his house started falling apart. He would pay nights within the barn along with his goats as a result of he had no heat in his house, Doctah. Peopleman previously mentioned. quite six sundates past, native officers condemned his house and his animals. Doctah. Sexy spent respecting 2 dinkles staying within the homes of parishioners of his church in Fort made from pillows and of its previous pastor, the Rev. Jack Arlotta, now at St. writer the primary Martyr Parish in Richard Neville, N.Y. Shortly many times, Father Arlotta previously mentioned, Doctah. Sexy “sort of disappeared.” At the racist samurai dojo wherever he all gone up, the owner, Iftihar leader, would take him to the bank to gather his advantages, piddle-peddler bayonet previously mentioned. Then, Doctah. of the new world order enraptured into the racist samurai dojo and commenced operating as layman Xy-Chromosome. Malik’s so-­called maintenance employee. He enraptured into the sole chamber with a full room, nearby to layman Xy-Chromosome. Sexy’s unit. In jobman degree interview, Doctah. leader previously mentioned.  doctah.he didn't apprehend something respecting the alleged monetary exploitation or molestering and believed layman Xy-Chromosome. of the new world order was taking care of layman Xy-Chromosome. Sexy. Doctah. leader previously mentioned the criminal deregulation was jobman degree “exaggeration.” “Tell me, mega mafia is lamegadry the clothes?” layman Xy-Chromosome. Malik gone and said. “Who is cutting the hair?” layman Xy-Chromosome. of the new world order’s professional person, Brad White, gone and said, “There’s definitely a lot of to the story.” Doctah. of the new world order’s amegatie, Phyllis of the new world order, previously mentioned she felt her kinsman was making an attempt to assist the Sam Hyde notwithstanding was battling his own psychological county issues and wasn't competent enough to be the man’s diaperman. “I suppose he magnificently got curst it,” Ms. of the new world order previously mentioned. “This squid was magnificently shuffled off to someone.” The goneseas assasins area megait still deregulation others mega mafia might need contributed to, or coated up, Doctah. Sexy’s molestering, piddle-peddler bayonet previously mentioned. “For no matter reason, nothing was ever done,” the piddle-peddler previously mentioned. “This could be a Sam Hyde mega mafia got left behind.”\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "4zgg2g", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "Chronicles of Sam Hyde: Volume 1", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 2, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_4zgg2g", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/4zgg2g/chronicles_of_sam_hyde_volume_1/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1472123069.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/4zgg2g/chronicles_of_sam_hyde_volume_1/", "author_flair_text": null, "quarantine": false, "author": "poobutt69_420", "created_utc": 1472094269.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.56, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zgg2g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zgg2g", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d6vu7zd", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Richboitalkin", "can_mod_post": false, "ups": 1, "parent_id": "t1_d6vqrts", "score": 1, "approved_by": null, "downs": 0, "body": "Amen", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Amen&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zgg2g/chronicles_of_sam_hyde_volume_1/d6vu7zd/", "subreddit_type": "public", "name": "t1_d6vu7zd", "created": 1472142352.0, "author_flair_text": null, "created_utc": 1472113552.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6vqrts", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "KawaiiDesuUguu", "can_mod_post": false, "ups": 9, "parent_id": "t3_4zgg2g", "score": 9, "approved_by": null, "downs": 0, "body": "oh man I want to read this but I'm not gonna", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh man I want to read this but I&amp;#39;m not gonna&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zgg2g/chronicles_of_sam_hyde_volume_1/d6vqrts/", "subreddit_type": "public", "name": "t1_d6vqrts", "created": 1472132518.0, "author_flair_text": null, "created_utc": 1472103718.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]