[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "youtu.be", "approved_at_utc": null, "banned_by": null, "media_embed": {"content": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/MiCJG8Q2Uds?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "width": 600, "scrolling": false, "height": 338}, "thumbnail_width": 140, "subreddit": "milliondollarextreme", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": {"oembed": {"provider_url": "https://www.youtube.com/", "title": "The Truth.", "type": "video", "html": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/MiCJG8Q2Uds?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "thumbnail_width": 480, "height": 338, "width": 600, "version": "1.0", "author_name": "TobyTurner", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/MiCJG8Q2Uds/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/user/TobyTurner"}, "type": "youtube.com"}, "is_reddit_media_domain": false, "link_flair_text": null, "id": "4evgs9", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "The Truth", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 12, "approved_by": null, "over_18": false, "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/GuXwxDZlspTm4Zu1l7uXgnymCrxNIsV8qtUHL5xiu6g.jpg?s=e0151a345bc63197aea4762daec3cb89", "width": 480, "height": 360}, "resolutions": [{"url": "https://i.redditmedia.com/GuXwxDZlspTm4Zu1l7uXgnymCrxNIsV8qtUHL5xiu6g.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=b28c163f2f063ca768f140feba29b7a4", "width": 108, "height": 81}, {"url": "https://i.redditmedia.com/GuXwxDZlspTm4Zu1l7uXgnymCrxNIsV8qtUHL5xiu6g.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=fe08303aa6ab581fb95c6420ae7e6273", "width": 216, "height": 162}, {"url": "https://i.redditmedia.com/GuXwxDZlspTm4Zu1l7uXgnymCrxNIsV8qtUHL5xiu6g.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=fc79db7f67b15e24f0caa0468a854ba5", "width": 320, "height": 240}], "variants": {}, "id": "wE0tBZw5Ig-c0cNrmysO4QelOdRAQFwShpByhvSkJm8"}], "enabled": false}, "num_comments": 13, "thumbnail": "https://b.thumbs.redditmedia.com/jJdaVGc-6g2J-wGRynWYEbwJjxIiQ9nsXIA5xUW1nGU.jpg", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {"content": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/MiCJG8Q2Uds?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "width": 600, "scrolling": false, "media_domain_url": "https://www.redditmedia.com/mediaembed/4evgs9", "height": 338}, "removal_reason": null, "post_hint": "rich:video", "can_gild": false, "thumbnail_height": 105, "parent_whitelist_status": "all_ads", "name": "t3_4evgs9", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/4evgs9/the_truth/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1460730234.0, "url": "https://youtu.be/MiCJG8Q2Uds", "author_flair_text": "/r/DebateBananas", "quarantine": false, "author": "never_say_negro", "created_utc": 1460701434.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": {"oembed": {"provider_url": "https://www.youtube.com/", "title": "The Truth.", "type": "video", "html": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/MiCJG8Q2Uds?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "thumbnail_width": 480, "height": 338, "width": 600, "version": "1.0", "author_name": "TobyTurner", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/MiCJG8Q2Uds/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/user/TobyTurner"}, "type": "youtube.com"}, "upvote_ratio": 0.79, "mod_reports": [], "is_self": false, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4evgs9", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d249xmj", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "aroundme", "can_mod_post": false, "ups": 8, "parent_id": "t3_4evgs9", "score": 8, "approved_by": null, "downs": 0, "body": "Sam Hyde raped me in the butt after a show in Bawstun. And he filmed it landscape to humiliate me further. (ha! now he has to make a new video! or do I have to write this on tumblr?)", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sam Hyde raped me in the butt after a show in Bawstun. And he filmed it landscape to humiliate me further. (ha! now he has to make a new video! or do I have to write this on tumblr?)&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4evgs9/the_truth/d249xmj/", "subreddit_type": "public", "name": "t1_d249xmj", "created": 1460772254.0, "author_flair_text": "OFFICIAL BOY TOY OF SAMUEL J. HYDE", "created_utc": 1460743454.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4evgs9", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d23v165", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 6, "parent_id": "t3_4evgs9", "score": 6, "approved_by": null, "downs": 0, "body": "i only dimly know what this is about but its funny (?) that he's making himself cry in the video ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i only dimly know what this is about but its funny (?) that he&amp;#39;s making himself cry in the video &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4evgs9/the_truth/d23v165/", "subreddit_type": "public", "name": "t1_d23v165", "created": 1460749528.0, "author_flair_text": null, "created_utc": 1460720728.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4evgs9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4evgs9", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d24qi78", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ugonnagetit", "can_mod_post": false, "ups": 2, "parent_id": "t1_d24qi33", "score": 2, "approved_by": null, "downs": 0, "body": "Feb 26th, 2013. I came over to help him with something, I’m not sure what. My friend Alissa was having a party I wanted to go to and he kept telling me not to leave. I told him I had to go. He was being flirty and cute. I was conditioned to enjoy the tension and “game.” But I told him I was going. He asked if I would take a shot with him. Just one before I left. Yes, I know I should not have even said yes and taken a shot before driving. I am aware. But you have to understand, at this time drugs were running rampant in this house and I was so exposed to drug and alcohol abuse that I was just used to it. I said ok and took a shot with him. Instantly I knew something was wrong. At first I thought it was shitty vodka. I even asked what vodka it was since it was the worst taste I ever had. Then I saw his face… and I realized I knew what that bitter taste was. I asked him if he had slipped something in my drink. ::insert cute grin with gryphon voice denying it:: I asked a bunch of times and he denied. But I already knew the answer. I also knew that the people who die from mdma/molly have always been mixing it with alcohol. That both of those together are a DEADLY mix. That Toby is a drug addict and that the amount of drugs he put in my drink are far more than I will EVER be capable of handling. I start crying and telling him he’s going to kill me. Why would he try to hurt me. That he is selfish and that I am going to die because of him. This somehow gives him a moment of clarity or maybe it was just the drugs taking effect, but he admits to putting it in my drink. He tells me it was only just a little bit and it must have still been on the glass from when he used it. Then he admits fully to doing it. He starts crying as well and admitting he is a sex addict and drug addict and needs to get help. I am SO FUCKED UP at this point that I honestly don’t remember what happened. Did we have sex? Did we only talk? I’m not sure. All I know is at some point he is passed out cuddling me on his beanbag chair and I’m just staring straight ahead wide awake with anxiety. I literally feel like I am being held hostage and kidnapped. I don’t know this man. I want to escape but I am so fucked up that I cant leave. Once I feel like I can maneuver a car (the next afternoon), I drive home. I really shouldn’t have drove but I needed to escape him. I come home and my roommates are in the kitchen. They would be so mad if they knew I was still talking to Toby after the blatant rape, so I tell them that someone at a bar drugged me. They tell me to go to the hospital and I say I just want to lay down. I go in my bed and just start sobbing. I was fucked up on this drug for 3 days. I regret never going to the hospital. I regret never going to the cops for what he did. I honestly thought about his career ruined and I didn’t want to hurt him bc I loved him. How messed up is that? He had just tried to kill me. I knew I was too weak to go to the hospital, but I made sure to text him what he did so I would have evidence. So I would at least have a text proof that he drugged me. So he couldn’t turn around and deny like he always did. Like he denies ever dating me now. What’s messed up is the text he gave me before I texted the proof. “'twas fun”. Yeah. FUN.\nI wish I could say I stopped talking to him after that. But we all know that’s not true. He said he would change his ways and I took him back again. March 2, 2013, I go in his bathroom and see a black thong and condom in his trashcan. He’s in the other room gaming, so I walk in there and grab him by the arm and he’s shocked, but I take him to the bathroom where I have put the items on the floor and I push his face down towards it. His response??? “what?”    'WHAT?!?’    “yeah what?…so?” and I’m livid. I say ‘Who the fuck is she?’ He tells me “It doesn’t matter. You’ll never meet her.” I really wanted to destroy and break everything in his house on the way out, but I just grab my stuff and go. Done. \nExcept not, bc I’m an idiot and I stay friends. The last time I ever have sex with him is Memorial Day of 2013. This isn’t by choice of course. This is a violent hate fuck after he thinks I am flirting with Max Landis at his (Toby’s) bbq party. Then of course I find out he was hooking up with another girl from the same party who is also a friend. The list goes on and on. \n\nMid to late 2013-  He finally has a relationship with someone else. (By this time, they are known as “mains” in my circle of friends that know the drill). So luckily I can say I never slept with him after that. But things still were messed up because he would always try to use me to masturbate. Either do it in front of me or try to grab my hand to do it for him. It’s disgusting and i’m embarrassed but it’s the truth so whatever. I became “just a friend” and I really thought things were looking up. We started doing songs together, even though I was helping him write them throughout this whole time. But NOW I was included and he was actually letting people know we were friends! Yay. Gag. I wont get into the lack of payment for anything I did, cause that’s a separate issue. But I knew I was being used. I was just so happy to be included! Yay. Gag. He always strung me along and would wave that carrot of songs or gaming to get me to come back. \n\n2014- He tells me we will perform Depressing Song at Playlist. I’m super happy bc we wrote it together  and it was our “look how magic we are together” song. Once it gets close to Playlist time… he starts getting wishywashy like he always does. I ask him if we really are going to play the song because he never gives me a straight answer and he starts telling me he only has passes for Seth and Gabe and he doesn’t know. Then tells me he will only be doing standup. This is after I already have my flight and hotel. So now he all of a sudden doesn’t have a pass for me that he said he would have. So I decide to go anyways. My amazing friend gets me into playlist and I have a really good time even though I know the drill of if Toby sees me there, he will ignore me and I have to lie to fans and play along that he’s just sooooo awesome. He asks what I’m doing and I text him that I’m hanging with these other youtubers and he gets mad (and jealous) because I shorten their channel name and accuses me of acting too cool. I say they’re my friends and that’s just what I call them. He then texts a mutual friend and says something along the lines of, “April is on her high horse and I’m about to put her down.” The day of his performance, I tell another mutual friend that I just KNOW he’s going to play our song. She assures me he wouldn’t do that. I have Toby energy and we are super connected. I FEEL IT. I know he is. And he does… I’m going to admit to the internets, that I almost committed suicide. I was in the worst pain I have ever felt in my life. Worse than the cheating, the lying, the physical and mental abuse. I’m not sure why, but to deny me the very thing I created… to perform my song when it was my DREAM to be up there… That was worse than death. I was on a high balcony of my hotel, and the opportunity presented itself. Luckily I didn’t go through with it. I vowed not to talk to him. He didn’t get to use me in this new life. I spent all of 2014 getting constant texts from him. Some spamming, blaming, and attacking me, some saying he wanted to say sorry. Towards August I think, I started to respond. I have only seen him a few times since then. I saw him a few months ago in January at a friend’s birthday and though he was nice to me in person, he started flirting with my best friend and then was trying to text her to entice her to hang out with him. When I texted him to stop (bc hello we’re bffs and she’s gonna show me), the attacking verbal abuse was back again. He never changes.\nHe’s still abusing and damaging women. There are women with stories similar to mine. He’s still playing his games of multiple girls at a time. Still asking hot chicks to game with him as a pick up line. I keep hoping maybe he has changed and I tried not to give the gory details to the women he tricks and fucks over. But I see he hasn’t. Two “mains” found out about each other just the other day.\n\n\nWhy did I tell such extreme detail of the worst parts of my life and about him? Because last night I was working and went to a Toys R Us and saw a Tobuscus toy in the isle. I started to cry and have a panic attack. I was supposed to be professional, but I couldn’t help it. I wanted to run up to the cashier and tell her that they are selling a drug addict rapist to children. They are selling a sexual predator and don’t even know it. But I know even if I did that, his toys would be out on the floor as soon as I left. Because people don’t now. Parents don’t know how terrible and toxic he is. How he hurts and destroys the best part of you. All they know is his funny voices and his characters. The back of the package called him a hero. I’m sorry but a hero doesn’t disrespect, abuse, rape, and drug women. He is not a hero. He is not a role model. He is a sick sick man.\n\n##tobuscus #tobyturner #youtube #sexual abuse #abusive #rape #tobygames", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Feb 26th, 2013. I came over to help him with something, I’m not sure what. My friend Alissa was having a party I wanted to go to and he kept telling me not to leave. I told him I had to go. He was being flirty and cute. I was conditioned to enjoy the tension and “game.” But I told him I was going. He asked if I would take a shot with him. Just one before I left. Yes, I know I should not have even said yes and taken a shot before driving. I am aware. But you have to understand, at this time drugs were running rampant in this house and I was so exposed to drug and alcohol abuse that I was just used to it. I said ok and took a shot with him. Instantly I knew something was wrong. At first I thought it was shitty vodka. I even asked what vodka it was since it was the worst taste I ever had. Then I saw his face… and I realized I knew what that bitter taste was. I asked him if he had slipped something in my drink. ::insert cute grin with gryphon voice denying it:: I asked a bunch of times and he denied. But I already knew the answer. I also knew that the people who die from mdma/molly have always been mixing it with alcohol. That both of those together are a DEADLY mix. That Toby is a drug addict and that the amount of drugs he put in my drink are far more than I will EVER be capable of handling. I start crying and telling him he’s going to kill me. Why would he try to hurt me. That he is selfish and that I am going to die because of him. This somehow gives him a moment of clarity or maybe it was just the drugs taking effect, but he admits to putting it in my drink. He tells me it was only just a little bit and it must have still been on the glass from when he used it. Then he admits fully to doing it. He starts crying as well and admitting he is a sex addict and drug addict and needs to get help. I am SO FUCKED UP at this point that I honestly don’t remember what happened. Did we have sex? Did we only talk? I’m not sure. All I know is at some point he is passed out cuddling me on his beanbag chair and I’m just staring straight ahead wide awake with anxiety. I literally feel like I am being held hostage and kidnapped. I don’t know this man. I want to escape but I am so fucked up that I cant leave. Once I feel like I can maneuver a car (the next afternoon), I drive home. I really shouldn’t have drove but I needed to escape him. I come home and my roommates are in the kitchen. They would be so mad if they knew I was still talking to Toby after the blatant rape, so I tell them that someone at a bar drugged me. They tell me to go to the hospital and I say I just want to lay down. I go in my bed and just start sobbing. I was fucked up on this drug for 3 days. I regret never going to the hospital. I regret never going to the cops for what he did. I honestly thought about his career ruined and I didn’t want to hurt him bc I loved him. How messed up is that? He had just tried to kill me. I knew I was too weak to go to the hospital, but I made sure to text him what he did so I would have evidence. So I would at least have a text proof that he drugged me. So he couldn’t turn around and deny like he always did. Like he denies ever dating me now. What’s messed up is the text he gave me before I texted the proof. “&amp;#39;twas fun”. Yeah. FUN.\nI wish I could say I stopped talking to him after that. But we all know that’s not true. He said he would change his ways and I took him back again. March 2, 2013, I go in his bathroom and see a black thong and condom in his trashcan. He’s in the other room gaming, so I walk in there and grab him by the arm and he’s shocked, but I take him to the bathroom where I have put the items on the floor and I push his face down towards it. His response??? “what?”    &amp;#39;WHAT?!?’    “yeah what?…so?” and I’m livid. I say ‘Who the fuck is she?’ He tells me “It doesn’t matter. You’ll never meet her.” I really wanted to destroy and break everything in his house on the way out, but I just grab my stuff and go. Done. \nExcept not, bc I’m an idiot and I stay friends. The last time I ever have sex with him is Memorial Day of 2013. This isn’t by choice of course. This is a violent hate fuck after he thinks I am flirting with Max Landis at his (Toby’s) bbq party. Then of course I find out he was hooking up with another girl from the same party who is also a friend. The list goes on and on. &lt;/p&gt;\n\n&lt;p&gt;Mid to late 2013-  He finally has a relationship with someone else. (By this time, they are known as “mains” in my circle of friends that know the drill). So luckily I can say I never slept with him after that. But things still were messed up because he would always try to use me to masturbate. Either do it in front of me or try to grab my hand to do it for him. It’s disgusting and i’m embarrassed but it’s the truth so whatever. I became “just a friend” and I really thought things were looking up. We started doing songs together, even though I was helping him write them throughout this whole time. But NOW I was included and he was actually letting people know we were friends! Yay. Gag. I wont get into the lack of payment for anything I did, cause that’s a separate issue. But I knew I was being used. I was just so happy to be included! Yay. Gag. He always strung me along and would wave that carrot of songs or gaming to get me to come back. &lt;/p&gt;\n\n&lt;p&gt;2014- He tells me we will perform Depressing Song at Playlist. I’m super happy bc we wrote it together  and it was our “look how magic we are together” song. Once it gets close to Playlist time… he starts getting wishywashy like he always does. I ask him if we really are going to play the song because he never gives me a straight answer and he starts telling me he only has passes for Seth and Gabe and he doesn’t know. Then tells me he will only be doing standup. This is after I already have my flight and hotel. So now he all of a sudden doesn’t have a pass for me that he said he would have. So I decide to go anyways. My amazing friend gets me into playlist and I have a really good time even though I know the drill of if Toby sees me there, he will ignore me and I have to lie to fans and play along that he’s just sooooo awesome. He asks what I’m doing and I text him that I’m hanging with these other youtubers and he gets mad (and jealous) because I shorten their channel name and accuses me of acting too cool. I say they’re my friends and that’s just what I call them. He then texts a mutual friend and says something along the lines of, “April is on her high horse and I’m about to put her down.” The day of his performance, I tell another mutual friend that I just KNOW he’s going to play our song. She assures me he wouldn’t do that. I have Toby energy and we are super connected. I FEEL IT. I know he is. And he does… I’m going to admit to the internets, that I almost committed suicide. I was in the worst pain I have ever felt in my life. Worse than the cheating, the lying, the physical and mental abuse. I’m not sure why, but to deny me the very thing I created… to perform my song when it was my DREAM to be up there… That was worse than death. I was on a high balcony of my hotel, and the opportunity presented itself. Luckily I didn’t go through with it. I vowed not to talk to him. He didn’t get to use me in this new life. I spent all of 2014 getting constant texts from him. Some spamming, blaming, and attacking me, some saying he wanted to say sorry. Towards August I think, I started to respond. I have only seen him a few times since then. I saw him a few months ago in January at a friend’s birthday and though he was nice to me in person, he started flirting with my best friend and then was trying to text her to entice her to hang out with him. When I texted him to stop (bc hello we’re bffs and she’s gonna show me), the attacking verbal abuse was back again. He never changes.\nHe’s still abusing and damaging women. There are women with stories similar to mine. He’s still playing his games of multiple girls at a time. Still asking hot chicks to game with him as a pick up line. I keep hoping maybe he has changed and I tried not to give the gory details to the women he tricks and fucks over. But I see he hasn’t. Two “mains” found out about each other just the other day.&lt;/p&gt;\n\n&lt;p&gt;Why did I tell such extreme detail of the worst parts of my life and about him? Because last night I was working and went to a Toys R Us and saw a Tobuscus toy in the isle. I started to cry and have a panic attack. I was supposed to be professional, but I couldn’t help it. I wanted to run up to the cashier and tell her that they are selling a drug addict rapist to children. They are selling a sexual predator and don’t even know it. But I know even if I did that, his toys would be out on the floor as soon as I left. Because people don’t now. Parents don’t know how terrible and toxic he is. How he hurts and destroys the best part of you. All they know is his funny voices and his characters. The back of the package called him a hero. I’m sorry but a hero doesn’t disrespect, abuse, rape, and drug women. He is not a hero. He is not a role model. He is a sick sick man.&lt;/p&gt;\n\n&lt;h2&gt;tobuscus #tobyturner #youtube #sexual abuse #abusive #rape #tobygames&lt;/h2&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4evgs9/the_truth/d24qi78/", "subreddit_type": "public", "name": "t1_d24qi78", "created": 1460797496.0, "author_flair_text": "trae with the weather", "created_utc": 1460768696.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4evgs9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4evgs9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4evgs9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4evgs9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4evgs9", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d24zhfd", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "never_say_negro", "can_mod_post": false, "ups": 3, "parent_id": "t1_d24wob4", "score": 3, "approved_by": null, "downs": 0, "body": "i think it just means be yourself and don't let these niggahs discourage u", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i think it just means be yourself and don&amp;#39;t let these niggahs discourage u&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4evgs9/the_truth/d24zhfd/", "subreddit_type": "public", "name": "t1_d24zhfd", "created": 1460815915.0, "author_flair_text": "/r/DebateBananas", "created_utc": 1460787115.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 5, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4evgs9", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d24wshh", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t1_d24wob4", "score": 1, "approved_by": null, "downs": 0, "body": "lol", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4evgs9/the_truth/d24wshh/", "subreddit_type": "public", "name": "t1_d24wshh", "created": 1460809091.0, "author_flair_text": null, "created_utc": 1460780291.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 5, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d24wob4", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ugonnagetit", "can_mod_post": false, "ups": 1, "parent_id": "t1_d24wne6", "score": 1, "approved_by": null, "downs": 0, "body": "FUCK YOU for my paragraph could have been a coherent couple of sentences but it's now run on reiterating the same thing autisticly over and over FUCK YOU butanefat, it's YOUR FAULT", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;FUCK YOU for my paragraph could have been a coherent couple of sentences but it&amp;#39;s now run on reiterating the same thing autisticly over and over FUCK YOU butanefat, it&amp;#39;s YOUR FAULT&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4evgs9/the_truth/d24wob4/", "subreddit_type": "public", "name": "t1_d24wob4", "created": 1460808844.0, "author_flair_text": "trae with the weather", "created_utc": 1460780044.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 4, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d24wne6", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ugonnagetit", "can_mod_post": false, "ups": 1, "parent_id": "t1_d24w1jc", "score": 1, "approved_by": null, "downs": 0, "body": "i think he's saying is there such a way that someone can want to be abusive like, they see that another person is so weak, they have such a negative amount of strength, that it just makes someone, who is already abusive, desire to further abuse that person? but then the sentence is like, but maybe there is such a weak person that is just so weak that the effect of their weakness, even to a normal person, provokes said normal person into wanting to abuse them? and to that i say NO the only way that even the most weak gullible person ever, if you feel like you want to abuse them, you're not normal, taking advantage of someone is not normal. and i dont think that there is such a thing that someone is so weak that is takes someone otherwise normal person's sobriety and the effect is that the normal person wants to abuse them. i think this cannot work because if it did, that person would not be normal. NO there is not some person is so weak spell that can be casted onto an otherwise normal person and incite to be abusive just for the sake that the other person is so weak. FUCK YOU", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i think he&amp;#39;s saying is there such a way that someone can want to be abusive like, they see that another person is so weak, they have such a negative amount of strength, that it just makes someone, who is already abusive, desire to further abuse that person? but then the sentence is like, but maybe there is such a weak person that is just so weak that the effect of their weakness, even to a normal person, provokes said normal person into wanting to abuse them? and to that i say NO the only way that even the most weak gullible person ever, if you feel like you want to abuse them, you&amp;#39;re not normal, taking advantage of someone is not normal. and i dont think that there is such a thing that someone is so weak that is takes someone otherwise normal person&amp;#39;s sobriety and the effect is that the normal person wants to abuse them. i think this cannot work because if it did, that person would not be normal. NO there is not some person is so weak spell that can be casted onto an otherwise normal person and incite to be abusive just for the sake that the other person is so weak. FUCK YOU&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4evgs9/the_truth/d24wne6/", "subreddit_type": "public", "name": "t1_d24wne6", "created": 1460808791.0, "author_flair_text": "trae with the weather", "created_utc": 1460779991.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d24w1jc", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "27YearOldPerson", "can_mod_post": false, "ups": 1, "parent_id": "t1_d24vgig", "score": 1, "approved_by": null, "downs": 0, "body": "i keep reading this fucking post but i cant understand it what the fuck", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i keep reading this fucking post but i cant understand it what the fuck&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4evgs9/the_truth/d24w1jc/", "subreddit_type": "public", "name": "t1_d24w1jc", "created": 1460807508.0, "author_flair_text": null, "created_utc": 1460778708.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d24vgig", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t1_d24qi33", "score": 1, "approved_by": null, "downs": 0, "body": "is there such a defense as provocation of abuse by the other person displaying so much weakness that it's like a negative amount of strength that it just draws abuse by gravity? like would spontaneuosly put any normal person into a violent power trip by being around them at such a negative amount of power ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;is there such a defense as provocation of abuse by the other person displaying so much weakness that it&amp;#39;s like a negative amount of strength that it just draws abuse by gravity? like would spontaneuosly put any normal person into a violent power trip by being around them at such a negative amount of power &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4evgs9/the_truth/d24vgig/", "subreddit_type": "public", "name": "t1_d24vgig", "created": 1460806328.0, "author_flair_text": null, "created_utc": 1460777528.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d24qi33", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ugonnagetit", "can_mod_post": false, "ups": 2, "parent_id": "t3_4evgs9", "score": 2, "approved_by": null, "downs": 0, "body": "The truth about Tobuscus\n\n:::TRIGGER WARNING::: abuse, rape, drugs, pretty much everything terrible\n\nBefore I start, I want to say that this is the hardest thing I’ve ever had to do in my life. I understand that I am setting myself up to be attacked in more ways than has already been done to me. People may accuse me of lying and may try any tactic to protect him because they don’t know who he truly is. I will have to take the heat for being the first person to openly come out about this, though I am NOT the only one who has experienced the abuse from him. There are soooo sooo many of us. I know of some, I’m friends with some, and I’m without a doubt sure there are some I don’t even know about. It’s not my place to tell their stories. I can really only tell mine.\n\n\n\nThroughout the five years of knowing him, I have been mentally and physically abused… by Toby Turner.\n\n\n\nI first met Toby when I was working at E3 in June 2011. I had flown there from Georgia and he was doing a hosting gig. He added me on facebook and as I was returning home, eventually my number. We texted almost daily and Facetimed with each other. He kept telling me that I should move there and that he needed a female host for his new gaming show, so a month after E3 I had bought a new car and packed my stuff for LA. I didn’t know at the time but that would be the one of many broken promises.\n\n\n\n-I was writing way too many details when I realized that I have WAY too many things to tell that happened in five years. So I’ll cut out the small stuff. I was being cheated on since day one. He would fluctuate between telling me we weren’t together, to saying we were. Once I started finding the evidence of other women, he would fluctuate between admitting he was cheating, then to saying he told me he didn’t want anything serious. Every time I would try to leave, he would tempt me with saying he was ready to come out about dating me now. He would say he was just worried about what the fans would say to me and all the hate I would get. But he never cared about that. When he started dating Olga, we were still dating. He told me that they weren’t real and it was just a show for subscribers and views. At the beginning I actually believed that. Then my gut feeling was going off like crazy and I realized I was just being weak. I stopped seeing him and started seeing someone else. Of course I kept getting texts that he missed me and that I was the one he wanted. Once I stopped seeing the other guy, we went right back to dating. On and off just as I now know was coinciding with Olga and his breakups. Or maybe the breakups were lies. Who really knows. I know this makes me look really dumb, but you have to understand how he makes women feel. It felt like a drug. I would try to date other people and I was so stuck and in love with him that no one ever compared. But I notice now how I was also being manipulated and forced. He thought it was a game to keep going when I would say No. He would grab me and try to tear my pants off and I would say No and pull them back up. So forcefully that they would tear. I still have my pants folded in the drawer that have ripped belt loops and holes in the crotch from him trying to tear his way in. I even headbutted him once bc I was starting to see another guy and did not want to be physical with him. But I was so scared of losing him that I would just let him win and have his way with me. He would call me his girlfriend, then if he found out I told someone I was dating him he would accuse me of trying to ruin his career and insult me.\n\n2013 was when the drugs really started. I’m not going to get into too much detail with that, but this was when the abuse started getting very violent. By this time I was conditioned to always make sure he was happy and I had so many panic attacks and anxiety when I was with him because I never wanted to upset him. We were writing most of his parodies and songs together and then fighting when the “high” would start to fade. Everything was a bipolar mess. There was an incident where we met up for dinner (his classic line “wanna eat?”) and he was on drugs of course. I told him not to park in the 30min parking spot. He was immune to all rules in his mind (“im a god”) so he left it. Our conversation at dinner turned toxic. He said some girl was aborting his baby, I said years ago I had a miscarriage but would have had it. This caused him to get angry that I would have kept the kid. He called me stupid, a faggot, among other things. (FYI to this day he STILL calls me a faggot. He uses that term all the time and calls me names even when he is being “nice”) So I am upset and trying to stand up for myself but only making it worse. I’m sure I cried at some point. I was always crying. We leave the restaurant and low and behold, his Range Rover got towed. He is yelling and mad. We get a uber(taxi?) and go back to his place. By this time I am absolutely terrified and just trying to not make him more upset. He started punching things in the kitchen. He kicks his stove and I get out of the way as he punches the pantry door. It has a big giant crack in it. (He later covered it with a chinese new year calendar and made jokes on vlogs saying “how did this get here?”) I’m crying and he’s blaming me for stuff, and then I go and sit down on the beanbag chair he has in the living room. He starts screaming at me to get the fuck out of his house. I’m balling and crying and asking him why he is doing this to me and he is screaming at the top of his lungs that he hates me and to get the fuck out of his house and that he’ll call the cops. He grabs his phone and saying he’s calling the cops and I’m just crying and crying. He screams and asks me “did you hear what I said you stupid fucking dumb blonde?!” (he would always tell me he hated blonde hair) and so I stand up to leave. I’m hysterical and get in my car and I speed off to drive away and he jumps out in front of my car. Immediately saying imsorryimsorryimsorrycmere cmere… I’m crying and I stop the car and he pulls me into the house. I’m nothing but a hyperventilating crying mess and I’m having a panic attack and shaking, when he starts taking off my pants and saying shhhhhh. He sets me down on the end of the bed and starts having sex with me. The entire time I’m crying and mumbling for him to stop but he keeps saying shhh. After he’s finished, he pulls my pants back on and I turn to my side and keep crying. I honestly don’t remember if he cuddled me after. Maybe he did. Once again I was psychologically damaged and stuck around. I even dyed my hair brunette to please him. We spent valentines together. At this point I knew I had to find a way to get over him. I just didn’t know how. He was turned on every time I cried and he was always mean and insulting to me, so this was the pattern. Friends tried to intervene and I actually lost a few because I kept going back to him and they thought I was weak and an idiot. I was. I finally mustered the strength and told him we should be just friends.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The truth about Tobuscus&lt;/p&gt;\n\n&lt;p&gt;:::TRIGGER WARNING::: abuse, rape, drugs, pretty much everything terrible&lt;/p&gt;\n\n&lt;p&gt;Before I start, I want to say that this is the hardest thing I’ve ever had to do in my life. I understand that I am setting myself up to be attacked in more ways than has already been done to me. People may accuse me of lying and may try any tactic to protect him because they don’t know who he truly is. I will have to take the heat for being the first person to openly come out about this, though I am NOT the only one who has experienced the abuse from him. There are soooo sooo many of us. I know of some, I’m friends with some, and I’m without a doubt sure there are some I don’t even know about. It’s not my place to tell their stories. I can really only tell mine.&lt;/p&gt;\n\n&lt;p&gt;Throughout the five years of knowing him, I have been mentally and physically abused… by Toby Turner.&lt;/p&gt;\n\n&lt;p&gt;I first met Toby when I was working at E3 in June 2011. I had flown there from Georgia and he was doing a hosting gig. He added me on facebook and as I was returning home, eventually my number. We texted almost daily and Facetimed with each other. He kept telling me that I should move there and that he needed a female host for his new gaming show, so a month after E3 I had bought a new car and packed my stuff for LA. I didn’t know at the time but that would be the one of many broken promises.&lt;/p&gt;\n\n&lt;p&gt;-I was writing way too many details when I realized that I have WAY too many things to tell that happened in five years. So I’ll cut out the small stuff. I was being cheated on since day one. He would fluctuate between telling me we weren’t together, to saying we were. Once I started finding the evidence of other women, he would fluctuate between admitting he was cheating, then to saying he told me he didn’t want anything serious. Every time I would try to leave, he would tempt me with saying he was ready to come out about dating me now. He would say he was just worried about what the fans would say to me and all the hate I would get. But he never cared about that. When he started dating Olga, we were still dating. He told me that they weren’t real and it was just a show for subscribers and views. At the beginning I actually believed that. Then my gut feeling was going off like crazy and I realized I was just being weak. I stopped seeing him and started seeing someone else. Of course I kept getting texts that he missed me and that I was the one he wanted. Once I stopped seeing the other guy, we went right back to dating. On and off just as I now know was coinciding with Olga and his breakups. Or maybe the breakups were lies. Who really knows. I know this makes me look really dumb, but you have to understand how he makes women feel. It felt like a drug. I would try to date other people and I was so stuck and in love with him that no one ever compared. But I notice now how I was also being manipulated and forced. He thought it was a game to keep going when I would say No. He would grab me and try to tear my pants off and I would say No and pull them back up. So forcefully that they would tear. I still have my pants folded in the drawer that have ripped belt loops and holes in the crotch from him trying to tear his way in. I even headbutted him once bc I was starting to see another guy and did not want to be physical with him. But I was so scared of losing him that I would just let him win and have his way with me. He would call me his girlfriend, then if he found out I told someone I was dating him he would accuse me of trying to ruin his career and insult me.&lt;/p&gt;\n\n&lt;p&gt;2013 was when the drugs really started. I’m not going to get into too much detail with that, but this was when the abuse started getting very violent. By this time I was conditioned to always make sure he was happy and I had so many panic attacks and anxiety when I was with him because I never wanted to upset him. We were writing most of his parodies and songs together and then fighting when the “high” would start to fade. Everything was a bipolar mess. There was an incident where we met up for dinner (his classic line “wanna eat?”) and he was on drugs of course. I told him not to park in the 30min parking spot. He was immune to all rules in his mind (“im a god”) so he left it. Our conversation at dinner turned toxic. He said some girl was aborting his baby, I said years ago I had a miscarriage but would have had it. This caused him to get angry that I would have kept the kid. He called me stupid, a faggot, among other things. (FYI to this day he STILL calls me a faggot. He uses that term all the time and calls me names even when he is being “nice”) So I am upset and trying to stand up for myself but only making it worse. I’m sure I cried at some point. I was always crying. We leave the restaurant and low and behold, his Range Rover got towed. He is yelling and mad. We get a uber(taxi?) and go back to his place. By this time I am absolutely terrified and just trying to not make him more upset. He started punching things in the kitchen. He kicks his stove and I get out of the way as he punches the pantry door. It has a big giant crack in it. (He later covered it with a chinese new year calendar and made jokes on vlogs saying “how did this get here?”) I’m crying and he’s blaming me for stuff, and then I go and sit down on the beanbag chair he has in the living room. He starts screaming at me to get the fuck out of his house. I’m balling and crying and asking him why he is doing this to me and he is screaming at the top of his lungs that he hates me and to get the fuck out of his house and that he’ll call the cops. He grabs his phone and saying he’s calling the cops and I’m just crying and crying. He screams and asks me “did you hear what I said you stupid fucking dumb blonde?!” (he would always tell me he hated blonde hair) and so I stand up to leave. I’m hysterical and get in my car and I speed off to drive away and he jumps out in front of my car. Immediately saying imsorryimsorryimsorrycmere cmere… I’m crying and I stop the car and he pulls me into the house. I’m nothing but a hyperventilating crying mess and I’m having a panic attack and shaking, when he starts taking off my pants and saying shhhhhh. He sets me down on the end of the bed and starts having sex with me. The entire time I’m crying and mumbling for him to stop but he keeps saying shhh. After he’s finished, he pulls my pants back on and I turn to my side and keep crying. I honestly don’t remember if he cuddled me after. Maybe he did. Once again I was psychologically damaged and stuck around. I even dyed my hair brunette to please him. We spent valentines together. At this point I knew I had to find a way to get over him. I just didn’t know how. He was turned on every time I cried and he was always mean and insulting to me, so this was the pattern. Friends tried to intervene and I actually lost a few because I kept going back to him and they thought I was weak and an idiot. I was. I finally mustered the strength and told him we should be just friends.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4evgs9/the_truth/d24qi33/", "subreddit_type": "public", "name": "t1_d24qi33", "created": 1460797491.0, "author_flair_text": "trae with the weather", "created_utc": 1460768691.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4evgs9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4evgs9", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d23y1rx", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ewd444", "can_mod_post": false, "ups": 1, "parent_id": "t1_d23w9m0", "score": 1, "approved_by": null, "downs": 0, "body": "Search tobuscus on Google it came up for me", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Search tobuscus on Google it came up for me&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4evgs9/the_truth/d23y1rx/", "subreddit_type": "public", "name": "t1_d23y1rx", "created": 1460755915.0, "author_flair_text": null, "created_utc": 1460727115.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d23w9m0", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "filmfood", "can_mod_post": false, "ups": 1, "parent_id": "t3_4evgs9", "score": 1, "approved_by": null, "downs": 0, "body": "anyone know that girls tumblr? I wanna read that shit", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;anyone know that girls tumblr? I wanna read that shit&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4evgs9/the_truth/d23w9m0/", "subreddit_type": "public", "name": "t1_d23w9m0", "created": 1460752481.0, "author_flair_text": null, "created_utc": 1460723681.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4evgs9", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d25kgvn", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "stretchpun", "can_mod_post": false, "ups": 0, "parent_id": "t3_4evgs9", "score": 0, "approved_by": null, "downs": 0, "body": "This guy is so fucking annoying, that's what she gets for thinking this guy is cool - I mean fuck him too, I hope he his asshole torn open by Bubba \"I just gave that little white boy AIDS\"", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This guy is so fucking annoying, that&amp;#39;s what she gets for thinking this guy is cool - I mean fuck him too, I hope he his asshole torn open by Bubba &amp;quot;I just gave that little white boy AIDS&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4evgs9/the_truth/d25kgvn/", "subreddit_type": "public", "name": "t1_d25kgvn", "created": 1460866806.0, "author_flair_text": "webmaster", "created_utc": 1460838006.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]