[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "i.redd.it", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": 140, "subreddit": "milliondollarextreme", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": true, "link_flair_text": null, "id": "4zsspr", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "What are you gonna do when SHTF?", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 10, "approved_by": null, "over_18": false, "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/U2q_a5vwsu2H7o-HJlligrKoZX6JR195Xk6P-AwDZKA.png?s=6daf6f41094ff971974e006970af34fd", "width": 892, "height": 1493}, "resolutions": [{"url": "https://i.redditmedia.com/U2q_a5vwsu2H7o-HJlligrKoZX6JR195Xk6P-AwDZKA.png?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=dc0f03d7eeb65cabbb12809aa5a8a6bd", "width": 108, "height": 180}, {"url": "https://i.redditmedia.com/U2q_a5vwsu2H7o-HJlligrKoZX6JR195Xk6P-AwDZKA.png?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=a32c94c1643b52e8dc242b8270cc4e46", "width": 216, "height": 361}, {"url": "https://i.redditmedia.com/U2q_a5vwsu2H7o-HJlligrKoZX6JR195Xk6P-AwDZKA.png?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=7a46c3bc21779ada443122f450274370", "width": 320, "height": 535}, {"url": "https://i.redditmedia.com/U2q_a5vwsu2H7o-HJlligrKoZX6JR195Xk6P-AwDZKA.png?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=bd1c00197446db386731aaba9a4ba548", "width": 640, "height": 1071}], "variants": {}, "id": "QhHI2JWdeu8QLqq_hSqa26dNxOYxUGz5dKCn_IXSJH4"}], "enabled": true}, "num_comments": 37, "thumbnail": "https://b.thumbs.redditmedia.com/wYCHdAC9mkqLfQ55CCn9iUNZDEbgUb1gsZ55foOEgaM.jpg", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "post_hint": "image", "can_gild": false, "thumbnail_height": 140, "parent_whitelist_status": "all_ads", "name": "t3_4zsspr", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1472302667.0, "url": "https://i.redd.it/k51nvzjjwuhx.png", "author_flair_text": "Don't force feed, inspire hunger", "quarantine": false, "author": "Fascist_Forever", "created_utc": 1472273867.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.7, "mod_reports": [], "is_self": false, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d6yhz4i", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Zeta_Nigga", "can_mod_post": false, "ups": 9, "parent_id": "t3_4zsspr", "score": 9, "approved_by": null, "downs": 0, "body": "Don't believe the assistants lies", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t believe the assistants lies&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yhz4i/", "subreddit_type": "public", "name": "t1_d6yhz4i", "created": 1472302965.0, "author_flair_text": "Criminally Ironic", "created_utc": 1472274165.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d6z4k84", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NemesisNMS", "can_mod_post": false, "ups": 2, "parent_id": "t1_d6z475i", "score": 2, "approved_by": null, "downs": 0, "body": "&gt; see, you're making it very easy, i get one whiff of this conpiratardian mindset and i immediately know that i have absolutely nothing to discuss with you and that anything you could possibly say has no significance or serious thought or serious factual backing at all.\n\nexactly my point, I asked you a simple question and you refuse to even entertain an answer. you are incapable of actually changing your mind based on new evidence. you have the kind of thought process a religious fundamentalist has about their holy book, or that a 4 year old has about their mom. even though she smokes crack, she's always going to be beautiful. you're afraid that your government isn't a benevolent entity there to protect and serve you. maybe one day you'll wake up to the realities of the world. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;see, you&amp;#39;re making it very easy, i get one whiff of this conpiratardian mindset and i immediately know that i have absolutely nothing to discuss with you and that anything you could possibly say has no significance or serious thought or serious factual backing at all.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;exactly my point, I asked you a simple question and you refuse to even entertain an answer. you are incapable of actually changing your mind based on new evidence. you have the kind of thought process a religious fundamentalist has about their holy book, or that a 4 year old has about their mom. even though she smokes crack, she&amp;#39;s always going to be beautiful. you&amp;#39;re afraid that your government isn&amp;#39;t a benevolent entity there to protect and serve you. maybe one day you&amp;#39;ll wake up to the realities of the world. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z4k84/", "subreddit_type": "public", "name": "t1_d6z4k84", "created": 1472355718.0, "author_flair_text": null, "created_utc": 1472326918.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 5, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6z475i", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 4, "parent_id": "t1_d6yzc4x", "score": 4, "approved_by": null, "downs": 0, "body": "[deleted]", "edited": 1504397377.0, "author_flair_css_class": null, "collapsed": true, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z475i/", "subreddit_type": "public", "name": "t1_d6z475i", "created": 1472355128.0, "author_flair_text": null, "created_utc": 1472326328.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 4, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yzc4x", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NemesisNMS", "can_mod_post": false, "ups": 2, "parent_id": "t1_d6ywpbk", "score": 2, "approved_by": null, "downs": 0, "body": "&gt;controlled demolition in the context of 9/11\n\nhave you even read the official NIST report on how WTC 7 fell down?\n\nthat's a pretty straightforward question. I'd like you to answer that before you start throwing out ad homs. \n\n&gt;will mozart be forbidden in europe in the upcoming years? did non-white migrants destroy any cultural relic in europe so far?\n\nare you aware that in Sweden rape has increased 1400% since they started taking in immigrants from the middle east en masse? Rotherham, they had over 1500 young girls discovered to be raped in child sex operations run by muslim immigrants over 10 years. did you hear about the 1000 sexual attacks that happened in Cologne on NYE? Are you aware that in many cities across Europe there are \"no-go zones\", you must have heard about this, these are places where police do not patrol because they are densely populated with muslim migrants. There's a video of a news reporter in Sweden talking about a muslim community there, they got physically assaulted by like 4 muslim guys, camera rolling, and the cops showed up but didn't do anything about it, it's like the cops are afraid. The police in these countries do not mention the race of a suspect out of fear of leftist backlash and being called a \"racist\", could you imagine that shit happening in the USA? \n\n\"Hey we have a robbery in progress, suspect fled on foot. He's about 6 feet tall wearing a red shirt and white shorts\" , \" Ok, what does he look like?\", \"Well, he's got a partial beard, brown eyes \" , \"OK but what kind of person is he?\" , \"What do you mean what 'kind' of person? human beings are all the same, we're all just one species\", \" yeah but what race is he?\" \"WHAT? race is a social construct! racist!\",\n\n and yet they want you to remember race when it's some kind of cultural heritage celebration, or when they need to remind you of how poorly white people treated their race 100 years ago. All over Europe there are radicalized muslims who push for Sharia law, they immigrated to Europe NOT to learn how to become European, but to take advantage of the wealth and prosperity of Europe, they keep their culture and ideals with them when they moved in, which is why in Paris for example you have huge enclaves of Muslims who do not even speak French and make no attempt to adapt to French life, they had to ban the Burqa because so many women walked around covered up it didn't look like a French city. There are some places in Europe which leftist politicians are pushing to allow child marriages, so when some guy moves to Germany from Afghanistan and brings his 12 year old WIFE, his marriage to her can be legally binding. That's the kind of sick shit I'm talking about. Dude, you really need to spend some time actually watching and reading the news, not mainstream news, but actual news that tells you what's going on for real. Watch Stephan Molyneux's video on muslim migration to Europe, they've increased immigration from muslim countries by millions in the past 10 years, and people like Merkel shame anyone who disagrees with it as racist, she even removed a German flag from a stage she was on because of how guilt ridden she is about her heritage, it's the neurosis of white guilt that tells Europeans to be ashamed of who they are, and what people who look like them did a long time ago. and \"white people\" are the majority tax payer in these countries, and their tax dollars are funding the free housing and welfare given to the muslim migrants who don't even want to learn their language. their poor birth rate should be fixed by letting in a wave of young muslim men to \"fix the problem\", the problem being a white majority according to European leftists. That's the danger with the SJW marxism, they literally hate white culture, what it means to be white, and even though they are all feminist they will partner with the most anti-feminist society on the globe in Islam in order to fight their mutual enemy. It's suicidal, just look at the rise in Islamic terror attacks in the past year. The wikipedia page on 2015 terror attacks explains everything, 95% of all terrorism worldwide is islamic. Even the muslims who have been in Europe for decades are against this new wave of immigrants, because those muslims have integrated and the new migrants coming in are in such numbers that they don't need to assimilate, they can keep their ways and habits with them. And they'll let ANYBODY in, did you hear about the Chinese tourist who lost his wallet, and when he went to report it, the situation got confused and they put him in a refugee camp and gave him money? he was there for 12 DAYS before they fixed it. Imagine if that was an ISIS suicide bomber? he wouldn't need 12 days. \n\n&gt;things are relativity decent only in the last 70 years tops, before that the lives of most people in europe were godawful\n\nLOL WUT? the Renaissance? Beethoven? Gutenberg? Columbus? De Carte? Newton? Voltaire? Einstein? Look at London in 1900 and tell me things were \"Godawful\". the lives of Europeans since the 1700's have been arguably better than anyone on the planet. The Industrial Revolution STARTED in Europe, wealth and prosperity has been the defining characteristic of Europe for like 300 years bro. \"Godawful\" by today's standards, because they didn't have AC and smartphones, but if you had a choice of where to be born anytime in the past few centuries, most people would choose a western European nation. \n\nWhat's really shit about your post though, is your obvious apathy and unwillingness to even defend what is culturally European. are you a liberal? you sound like someone who has no convictions or rationalizations about history, cultural and political history. What would you rather see happen? You don't seem to really care what happens to them, which comes off like you're apathetic towards the entire idea of having a successful, free, capitalist western nation. You speak of 7% of muslims like they DON'T have the power to destroy. Were you under a rock when 130 people got massacred in Paris last year? what about the people who died in Nice? Brussels? Madrid? London? What about the uncounted young women who are sexually assaulted? There are numerous individual murders that don't make global headlines, look closely and you hear about them. And for you to talk about the \"inbred, imbecile south\", you're talking about white people being inbred? There's more incest prevalent in black communities than white, so that's an ironic point to make, and last I checked 50 people in Orlando weren't killed by a white guy this year, that was a Muslim. the 12 cops killed by BlackLiesMatter this year haven't been killed by white people, those were black criminals killing those cops for an ideological cult. \n\nLet me guess, you aren't white. I think that's what I'm getting at, you aren't white, so you are totally clueless about white cultural history and heritage. You have no sense of history with white people, and you probably have actively been brainwashed into being against it because you were told how white people hurt your ancestors in ancient history. White Europeans countries suffering doesn't matter to you because you don't trace yourself back to Europe. Even if you were a black transsexual, the fact that modern life has most if not all of its benefits directly because of what white people invented, discovered and accomplished in the past 300 years, should let in on the knowledge that without a free, white Europe, and by extension the USA, the world may eventually get to a point where the greatest places to live are what we would consider 3rd world today. Food for thought. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;controlled demolition in the context of 9/11&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;have you even read the official NIST report on how WTC 7 fell down?&lt;/p&gt;\n\n&lt;p&gt;that&amp;#39;s a pretty straightforward question. I&amp;#39;d like you to answer that before you start throwing out ad homs. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;will mozart be forbidden in europe in the upcoming years? did non-white migrants destroy any cultural relic in europe so far?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;are you aware that in Sweden rape has increased 1400% since they started taking in immigrants from the middle east en masse? Rotherham, they had over 1500 young girls discovered to be raped in child sex operations run by muslim immigrants over 10 years. did you hear about the 1000 sexual attacks that happened in Cologne on NYE? Are you aware that in many cities across Europe there are &amp;quot;no-go zones&amp;quot;, you must have heard about this, these are places where police do not patrol because they are densely populated with muslim migrants. There&amp;#39;s a video of a news reporter in Sweden talking about a muslim community there, they got physically assaulted by like 4 muslim guys, camera rolling, and the cops showed up but didn&amp;#39;t do anything about it, it&amp;#39;s like the cops are afraid. The police in these countries do not mention the race of a suspect out of fear of leftist backlash and being called a &amp;quot;racist&amp;quot;, could you imagine that shit happening in the USA? &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hey we have a robbery in progress, suspect fled on foot. He&amp;#39;s about 6 feet tall wearing a red shirt and white shorts&amp;quot; , &amp;quot; Ok, what does he look like?&amp;quot;, &amp;quot;Well, he&amp;#39;s got a partial beard, brown eyes &amp;quot; , &amp;quot;OK but what kind of person is he?&amp;quot; , &amp;quot;What do you mean what &amp;#39;kind&amp;#39; of person? human beings are all the same, we&amp;#39;re all just one species&amp;quot;, &amp;quot; yeah but what race is he?&amp;quot; &amp;quot;WHAT? race is a social construct! racist!&amp;quot;,&lt;/p&gt;\n\n&lt;p&gt;and yet they want you to remember race when it&amp;#39;s some kind of cultural heritage celebration, or when they need to remind you of how poorly white people treated their race 100 years ago. All over Europe there are radicalized muslims who push for Sharia law, they immigrated to Europe NOT to learn how to become European, but to take advantage of the wealth and prosperity of Europe, they keep their culture and ideals with them when they moved in, which is why in Paris for example you have huge enclaves of Muslims who do not even speak French and make no attempt to adapt to French life, they had to ban the Burqa because so many women walked around covered up it didn&amp;#39;t look like a French city. There are some places in Europe which leftist politicians are pushing to allow child marriages, so when some guy moves to Germany from Afghanistan and brings his 12 year old WIFE, his marriage to her can be legally binding. That&amp;#39;s the kind of sick shit I&amp;#39;m talking about. Dude, you really need to spend some time actually watching and reading the news, not mainstream news, but actual news that tells you what&amp;#39;s going on for real. Watch Stephan Molyneux&amp;#39;s video on muslim migration to Europe, they&amp;#39;ve increased immigration from muslim countries by millions in the past 10 years, and people like Merkel shame anyone who disagrees with it as racist, she even removed a German flag from a stage she was on because of how guilt ridden she is about her heritage, it&amp;#39;s the neurosis of white guilt that tells Europeans to be ashamed of who they are, and what people who look like them did a long time ago. and &amp;quot;white people&amp;quot; are the majority tax payer in these countries, and their tax dollars are funding the free housing and welfare given to the muslim migrants who don&amp;#39;t even want to learn their language. their poor birth rate should be fixed by letting in a wave of young muslim men to &amp;quot;fix the problem&amp;quot;, the problem being a white majority according to European leftists. That&amp;#39;s the danger with the SJW marxism, they literally hate white culture, what it means to be white, and even though they are all feminist they will partner with the most anti-feminist society on the globe in Islam in order to fight their mutual enemy. It&amp;#39;s suicidal, just look at the rise in Islamic terror attacks in the past year. The wikipedia page on 2015 terror attacks explains everything, 95% of all terrorism worldwide is islamic. Even the muslims who have been in Europe for decades are against this new wave of immigrants, because those muslims have integrated and the new migrants coming in are in such numbers that they don&amp;#39;t need to assimilate, they can keep their ways and habits with them. And they&amp;#39;ll let ANYBODY in, did you hear about the Chinese tourist who lost his wallet, and when he went to report it, the situation got confused and they put him in a refugee camp and gave him money? he was there for 12 DAYS before they fixed it. Imagine if that was an ISIS suicide bomber? he wouldn&amp;#39;t need 12 days. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;things are relativity decent only in the last 70 years tops, before that the lives of most people in europe were godawful&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;LOL WUT? the Renaissance? Beethoven? Gutenberg? Columbus? De Carte? Newton? Voltaire? Einstein? Look at London in 1900 and tell me things were &amp;quot;Godawful&amp;quot;. the lives of Europeans since the 1700&amp;#39;s have been arguably better than anyone on the planet. The Industrial Revolution STARTED in Europe, wealth and prosperity has been the defining characteristic of Europe for like 300 years bro. &amp;quot;Godawful&amp;quot; by today&amp;#39;s standards, because they didn&amp;#39;t have AC and smartphones, but if you had a choice of where to be born anytime in the past few centuries, most people would choose a western European nation. &lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s really shit about your post though, is your obvious apathy and unwillingness to even defend what is culturally European. are you a liberal? you sound like someone who has no convictions or rationalizations about history, cultural and political history. What would you rather see happen? You don&amp;#39;t seem to really care what happens to them, which comes off like you&amp;#39;re apathetic towards the entire idea of having a successful, free, capitalist western nation. You speak of 7% of muslims like they DON&amp;#39;T have the power to destroy. Were you under a rock when 130 people got massacred in Paris last year? what about the people who died in Nice? Brussels? Madrid? London? What about the uncounted young women who are sexually assaulted? There are numerous individual murders that don&amp;#39;t make global headlines, look closely and you hear about them. And for you to talk about the &amp;quot;inbred, imbecile south&amp;quot;, you&amp;#39;re talking about white people being inbred? There&amp;#39;s more incest prevalent in black communities than white, so that&amp;#39;s an ironic point to make, and last I checked 50 people in Orlando weren&amp;#39;t killed by a white guy this year, that was a Muslim. the 12 cops killed by BlackLiesMatter this year haven&amp;#39;t been killed by white people, those were black criminals killing those cops for an ideological cult. &lt;/p&gt;\n\n&lt;p&gt;Let me guess, you aren&amp;#39;t white. I think that&amp;#39;s what I&amp;#39;m getting at, you aren&amp;#39;t white, so you are totally clueless about white cultural history and heritage. You have no sense of history with white people, and you probably have actively been brainwashed into being against it because you were told how white people hurt your ancestors in ancient history. White Europeans countries suffering doesn&amp;#39;t matter to you because you don&amp;#39;t trace yourself back to Europe. Even if you were a black transsexual, the fact that modern life has most if not all of its benefits directly because of what white people invented, discovered and accomplished in the past 300 years, should let in on the knowledge that without a free, white Europe, and by extension the USA, the world may eventually get to a point where the greatest places to live are what we would consider 3rd world today. Food for thought. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yzc4x/", "subreddit_type": "public", "name": "t1_d6yzc4x", "created": 1472347349.0, "author_flair_text": null, "created_utc": 1472318549.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6ywpbk", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t1_d6yvu8q", "score": 1, "approved_by": null, "downs": 0, "body": "[deleted]", "edited": 1504397372.0, "author_flair_css_class": null, "collapsed": true, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6ywpbk/", "subreddit_type": "public", "name": "t1_d6ywpbk", "created": 1472343033.0, "author_flair_text": null, "created_utc": 1472314233.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 1, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yvu8q", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NemesisNMS", "can_mod_post": false, "ups": 5, "parent_id": "t1_d6yrldn", "score": 5, "approved_by": null, "downs": 0, "body": "explain exactly what you saw wrong with that quote, and what \"irony\" are you talking about? he said what he said very plainly, and what he said is absolutely correct. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;explain exactly what you saw wrong with that quote, and what &amp;quot;irony&amp;quot; are you talking about? he said what he said very plainly, and what he said is absolutely correct. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yvu8q/", "subreddit_type": "public", "name": "t1_d6yvu8q", "created": 1472341589.0, "author_flair_text": null, "created_utc": 1472312789.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yrldn", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 2, "parent_id": "t3_4zsspr", "score": 2, "approved_by": null, "downs": 0, "body": "[deleted]", "edited": 1504397368.0, "author_flair_css_class": null, "collapsed": true, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yrldn/", "subreddit_type": "public", "name": "t1_d6yrldn", "created": 1472333512.0, "author_flair_text": null, "created_utc": 1472304712.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 1, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d6yiluk", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "undergrownaverage", "can_mod_post": false, "ups": 5, "parent_id": "t1_d6yi91f", "score": 5, "approved_by": null, "downs": 0, "body": "Pfffftt... i could totally run a fortune 500 company... 5 mill a year? Ez", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pfffftt... i could totally run a fortune 500 company... 5 mill a year? Ez&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yiluk/", "subreddit_type": "public", "name": "t1_d6yiluk", "created": 1472304414.0, "author_flair_text": "WhiteApologetic", "created_utc": 1472275614.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d6z3rh3", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Lying2women", "can_mod_post": false, "ups": 2, "parent_id": "t1_d6z35mi", "score": 2, "approved_by": null, "downs": 0, "body": "I know. On one hand every other time people have prophesied doom for us they've been wrong, but on the other hand I just don't see how what we have now is sustainable. The global economy is basically a big collective fantasy. I'm not very intelligent on economics or finance but it just seems like a bad idea to just print money to get us out of trouble, it's kind of like admitting your money isn't worth anything. I just don't know how we ever got ourselves into this shit. I don't really have enough to survive to collapse and live in a state where arming yourself is basically impossible. I'm just glad that I'm young and don't really have anything to lose if a global collapse happened tomorrow. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know. On one hand every other time people have prophesied doom for us they&amp;#39;ve been wrong, but on the other hand I just don&amp;#39;t see how what we have now is sustainable. The global economy is basically a big collective fantasy. I&amp;#39;m not very intelligent on economics or finance but it just seems like a bad idea to just print money to get us out of trouble, it&amp;#39;s kind of like admitting your money isn&amp;#39;t worth anything. I just don&amp;#39;t know how we ever got ourselves into this shit. I don&amp;#39;t really have enough to survive to collapse and live in a state where arming yourself is basically impossible. I&amp;#39;m just glad that I&amp;#39;m young and don&amp;#39;t really have anything to lose if a global collapse happened tomorrow. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z3rh3/", "subreddit_type": "public", "name": "t1_d6z3rh3", "created": 1472354419.0, "author_flair_text": null, "created_utc": 1472325619.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 7, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6z35mi", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NemesisNMS", "can_mod_post": false, "ups": 2, "parent_id": "t1_d6z2s8g", "score": 2, "approved_by": null, "downs": 0, "body": "yeah no kidding, I keep running up against walls in my own mind that I built like 10 years ago when I come across things, I have to exert my  own mental power in order to make sense of some stuff. I actually appreciate the act of changing my mind on things because I can tell myself that I am striving to have the most rational thought process, like a scientist will throw out something he's believed his entire life like yesterday's newspaper if he found out there's evidence to contradict it. but as for your last statement, I honestly try not to think too much about a Great Collapse because every time I hear or think about it I can sense how likely and worst of all, inevitable it sounds given the state of our monetary system and what's going on at a Federal level. That would be a really big shame to enter into another depression, because this time the world is armed with nukes and a global depression hasn't happened in that environment. and then you look at timelines comparing the fall of great empires, the economics of boom/bust, and a lot of evidence points to us being due for a big shakeup in the near future. Really shitty because I definitely don't have any kind of resources to last a year or two, and I don't have the armament to defend myself from people who are heavily armed and doing whatever they want. lol. kinda surreal to even think about it. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah no kidding, I keep running up against walls in my own mind that I built like 10 years ago when I come across things, I have to exert my  own mental power in order to make sense of some stuff. I actually appreciate the act of changing my mind on things because I can tell myself that I am striving to have the most rational thought process, like a scientist will throw out something he&amp;#39;s believed his entire life like yesterday&amp;#39;s newspaper if he found out there&amp;#39;s evidence to contradict it. but as for your last statement, I honestly try not to think too much about a Great Collapse because every time I hear or think about it I can sense how likely and worst of all, inevitable it sounds given the state of our monetary system and what&amp;#39;s going on at a Federal level. That would be a really big shame to enter into another depression, because this time the world is armed with nukes and a global depression hasn&amp;#39;t happened in that environment. and then you look at timelines comparing the fall of great empires, the economics of boom/bust, and a lot of evidence points to us being due for a big shakeup in the near future. Really shitty because I definitely don&amp;#39;t have any kind of resources to last a year or two, and I don&amp;#39;t have the armament to defend myself from people who are heavily armed and doing whatever they want. lol. kinda surreal to even think about it. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z35mi/", "subreddit_type": "public", "name": "t1_d6z35mi", "created": 1472353437.0, "author_flair_text": null, "created_utc": 1472324637.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 6, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6z2s8g", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Lying2women", "can_mod_post": false, "ups": 2, "parent_id": "t1_d6z1wbz", "score": 2, "approved_by": null, "downs": 0, "body": "Yea I love Stephan. I was a liberal too until I was about 20 then I moved to left-libertarianism to just sort of general right with sort of a mix of libertarian and nationalist ideas. Idk tho my mind on this stuff changes on the daily. As much as I would love to see a third party in my life time I really don't know how much longer America can last in its current state, we're quickly running out of time to right this ship without resorting to radical measures in my opinion. But maybe I'm just a pessimist who knows. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea I love Stephan. I was a liberal too until I was about 20 then I moved to left-libertarianism to just sort of general right with sort of a mix of libertarian and nationalist ideas. Idk tho my mind on this stuff changes on the daily. As much as I would love to see a third party in my life time I really don&amp;#39;t know how much longer America can last in its current state, we&amp;#39;re quickly running out of time to right this ship without resorting to radical measures in my opinion. But maybe I&amp;#39;m just a pessimist who knows. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z2s8g/", "subreddit_type": "public", "name": "t1_d6z2s8g", "created": 1472352834.0, "author_flair_text": null, "created_utc": 1472324034.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 5, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6z1wbz", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NemesisNMS", "can_mod_post": false, "ups": 3, "parent_id": "t1_d6z15gc", "score": 3, "approved_by": null, "downs": 0, "body": "I'm glad you brought that up, Gary supporting the TPP is exactly what I was talking about earlier, he's actually kind of naive I think, he literally thinks it means \"free market\" because it's \"free trade\". That's why I made the emphasis that I did, I consider myself Libertarian because I'm absolutely opposed to Big Governmental policies like the War on Drugs, foreign intervention, adult sex laws, massive entitlement, insane amounts of regulation and so on, but when I hear people like Gary have this naive notion that giving even Multi-Nation billion dollar corporations total freedom, it burns me up because capitalism works best when competition is at it's peak. Small businesses cannot thrive when they don't have the legal ability to navigate through the minefield of the US legal and tax code like multi-nationals, how can he believe that allowing them to consolidate their monopoly on the market be a free market principle? in a free market, a person with a better idea should have the opportunity to succeed, but they are artificially held back by having to go up against companies that in many cases can have the rules changed in their own favor. Campaign finance reform is one of the most important things we can do, money should not be considered free speech in the context of a political election and it's obvious that allowing anybody to give any amount of money to a government official is literally like allowing bribery, yet Johnson supports it. I do struggle with my own political philosophy, I was a liberal in my early 20's and I'm 28 now, but I stopped believing a lot of that shit because my life experience trumped my preconceived beliefs through observation. I do consider myself a libertarian despite having real disagreements with a lot of people in the libertarian movement, I'm definitely not an an-cap but I do enjoy listening to what people like Stephan Molyneux have to say because it's refreshing as hell to hear some real ideas instead of the garbage boilerplate nonsense that Clinton spouts as she continues on her mission to gain power. To be honest I'm voting for Johnson as a protest vote, I'm going to be very upset if I grow into old age and never see a 3rd party POTUS get elected (if we don't get nuked by then). ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad you brought that up, Gary supporting the TPP is exactly what I was talking about earlier, he&amp;#39;s actually kind of naive I think, he literally thinks it means &amp;quot;free market&amp;quot; because it&amp;#39;s &amp;quot;free trade&amp;quot;. That&amp;#39;s why I made the emphasis that I did, I consider myself Libertarian because I&amp;#39;m absolutely opposed to Big Governmental policies like the War on Drugs, foreign intervention, adult sex laws, massive entitlement, insane amounts of regulation and so on, but when I hear people like Gary have this naive notion that giving even Multi-Nation billion dollar corporations total freedom, it burns me up because capitalism works best when competition is at it&amp;#39;s peak. Small businesses cannot thrive when they don&amp;#39;t have the legal ability to navigate through the minefield of the US legal and tax code like multi-nationals, how can he believe that allowing them to consolidate their monopoly on the market be a free market principle? in a free market, a person with a better idea should have the opportunity to succeed, but they are artificially held back by having to go up against companies that in many cases can have the rules changed in their own favor. Campaign finance reform is one of the most important things we can do, money should not be considered free speech in the context of a political election and it&amp;#39;s obvious that allowing anybody to give any amount of money to a government official is literally like allowing bribery, yet Johnson supports it. I do struggle with my own political philosophy, I was a liberal in my early 20&amp;#39;s and I&amp;#39;m 28 now, but I stopped believing a lot of that shit because my life experience trumped my preconceived beliefs through observation. I do consider myself a libertarian despite having real disagreements with a lot of people in the libertarian movement, I&amp;#39;m definitely not an an-cap but I do enjoy listening to what people like Stephan Molyneux have to say because it&amp;#39;s refreshing as hell to hear some real ideas instead of the garbage boilerplate nonsense that Clinton spouts as she continues on her mission to gain power. To be honest I&amp;#39;m voting for Johnson as a protest vote, I&amp;#39;m going to be very upset if I grow into old age and never see a 3rd party POTUS get elected (if we don&amp;#39;t get nuked by then). &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z1wbz/", "subreddit_type": "public", "name": "t1_d6z1wbz", "created": 1472351438.0, "author_flair_text": null, "created_utc": 1472322638.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 4, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6z15gc", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Lying2women", "can_mod_post": false, "ups": 3, "parent_id": "t1_d6z0qo1", "score": 3, "approved_by": null, "downs": 0, "body": "I personally do like trump but I can see why others don't. Usually I would vote 3rd party or not at all. Now you probably know more about this than I do,  but Gary seems like a crypto-globalist to me.  He's said he would sign the TTP, is in favor of implementing a carbon tax, has praised Clinton's ability and has said he would put Mitt Romney in his cabinet (I think he said as sec of state but I can't remember off the top of my head). Still probably better than the average establishment guy, and it might be worth it just to try and break the two party system, I just don't think Gary is the candidate everyone seems to talk him to be. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I personally do like trump but I can see why others don&amp;#39;t. Usually I would vote 3rd party or not at all. Now you probably know more about this than I do,  but Gary seems like a crypto-globalist to me.  He&amp;#39;s said he would sign the TTP, is in favor of implementing a carbon tax, has praised Clinton&amp;#39;s ability and has said he would put Mitt Romney in his cabinet (I think he said as sec of state but I can&amp;#39;t remember off the top of my head). Still probably better than the average establishment guy, and it might be worth it just to try and break the two party system, I just don&amp;#39;t think Gary is the candidate everyone seems to talk him to be. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z15gc/", "subreddit_type": "public", "name": "t1_d6z15gc", "created": 1472350282.0, "author_flair_text": null, "created_utc": 1472321482.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6z0qo1", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NemesisNMS", "can_mod_post": false, "ups": 2, "parent_id": "t1_d6yye1e", "score": 2, "approved_by": null, "downs": 0, "body": "I appreciate your response, I kind of emphasized the notion that free trade isn't something that Libertarians should consider to be a Libertarian principle because I've listened to several who actually believe that free trade is a great idea. They hear \"free trade\" and they think \"free market\", and that's absolutely not the case. There's so much fuckery going on at the international level, multi-national corporations executing the literal exploitation of 3rd world countries' pay gap to the 1st world to make higher profit isn't supposed to be something conservatives are in favor of because it actually hurts their own country. It gives you cheaper goods but less producers to spend money on them. That's a fuzzy divide in right wing thought at the moment I believe, where does adherence to nationalism stop and adherence to free market capitalism begin when some practices that take place in capitalism work to the DETRIMENT of your nation? As far as I'm concerned, you're absolutely right, establishment vs. anti-establishment isn't a left-right issue, people try to make it out to be but again you are correct, this election has shown that what used to be considered establishment 10 years ago, conservatism, is now anti-establishment as the leftists have become the establishment in Clinton. Bernie vs. Trump would have been a great election. That way we know whoever won, the people running the great scam would have been shaken up pretty badly in the end. \n\nI personally dislike Trump, I think he's a bombastic personality who is lacking the tack, maturity and character to be a good POTUS, but I am fully cognizant of Hillary Clinton's bullshit and in no way would I ever vote for her. I do support some of what Trump wants to do such as abolish some free trade agreements, but based on some of the things that comes out of his mouth I think he's shot himself in the foot in the general and I don't believe he can win given the huge number of women who are voting for Clinton no matter what because she has a vag just like they do! and women don't really think that deep into things, so it's predictable where that's going. And the fact that hispanics and blacks especially are set to vote democrat again, the numbers just aren't adding up. There aren't enough white guys, unfortunately lol. I am planning on voting for Gary Johnson anyway, I would love for him to be in the debates. If there were ever a year for a 3rd party to do really well and put 3rd, 4th, 5th parties in the ballpark, this would be it. People are so predictable though, and with our already abysmal voter turnout compared to democracies elsewhere, I have little hope in my fellow American to actually be engaged enough to make this an exciting election year. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I appreciate your response, I kind of emphasized the notion that free trade isn&amp;#39;t something that Libertarians should consider to be a Libertarian principle because I&amp;#39;ve listened to several who actually believe that free trade is a great idea. They hear &amp;quot;free trade&amp;quot; and they think &amp;quot;free market&amp;quot;, and that&amp;#39;s absolutely not the case. There&amp;#39;s so much fuckery going on at the international level, multi-national corporations executing the literal exploitation of 3rd world countries&amp;#39; pay gap to the 1st world to make higher profit isn&amp;#39;t supposed to be something conservatives are in favor of because it actually hurts their own country. It gives you cheaper goods but less producers to spend money on them. That&amp;#39;s a fuzzy divide in right wing thought at the moment I believe, where does adherence to nationalism stop and adherence to free market capitalism begin when some practices that take place in capitalism work to the DETRIMENT of your nation? As far as I&amp;#39;m concerned, you&amp;#39;re absolutely right, establishment vs. anti-establishment isn&amp;#39;t a left-right issue, people try to make it out to be but again you are correct, this election has shown that what used to be considered establishment 10 years ago, conservatism, is now anti-establishment as the leftists have become the establishment in Clinton. Bernie vs. Trump would have been a great election. That way we know whoever won, the people running the great scam would have been shaken up pretty badly in the end. &lt;/p&gt;\n\n&lt;p&gt;I personally dislike Trump, I think he&amp;#39;s a bombastic personality who is lacking the tack, maturity and character to be a good POTUS, but I am fully cognizant of Hillary Clinton&amp;#39;s bullshit and in no way would I ever vote for her. I do support some of what Trump wants to do such as abolish some free trade agreements, but based on some of the things that comes out of his mouth I think he&amp;#39;s shot himself in the foot in the general and I don&amp;#39;t believe he can win given the huge number of women who are voting for Clinton no matter what because she has a vag just like they do! and women don&amp;#39;t really think that deep into things, so it&amp;#39;s predictable where that&amp;#39;s going. And the fact that hispanics and blacks especially are set to vote democrat again, the numbers just aren&amp;#39;t adding up. There aren&amp;#39;t enough white guys, unfortunately lol. I am planning on voting for Gary Johnson anyway, I would love for him to be in the debates. If there were ever a year for a 3rd party to do really well and put 3rd, 4th, 5th parties in the ballpark, this would be it. People are so predictable though, and with our already abysmal voter turnout compared to democracies elsewhere, I have little hope in my fellow American to actually be engaged enough to make this an exciting election year. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z0qo1/", "subreddit_type": "public", "name": "t1_d6z0qo1", "created": 1472349625.0, "author_flair_text": null, "created_utc": 1472320825.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yye1e", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Lying2women", "can_mod_post": false, "ups": 3, "parent_id": "t1_d6yi91f", "score": 3, "approved_by": null, "downs": 0, "body": "I don't think being anti-corporatist is a left-right thing. More of an establishment/oligarch vs the population thing. There is a reason Trump received more votes than any republican ever and why many establishment republican are voting Clinton this year. No right wing person I know (my self included) doesn't think income inequality is a problem, everyone agrees basically that we're being screwed big time by corporations and the government. I agree with all you said tho. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think being anti-corporatist is a left-right thing. More of an establishment/oligarch vs the population thing. There is a reason Trump received more votes than any republican ever and why many establishment republican are voting Clinton this year. No right wing person I know (my self included) doesn&amp;#39;t think income inequality is a problem, everyone agrees basically that we&amp;#39;re being screwed big time by corporations and the government. I agree with all you said tho. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yye1e/", "subreddit_type": "public", "name": "t1_d6yye1e", "created": 1472345816.0, "author_flair_text": null, "created_utc": 1472317016.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d6z4fhw", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NemesisNMS", "can_mod_post": false, "ups": 1, "parent_id": "t1_d6z4cjn", "score": 1, "approved_by": null, "downs": 0, "body": "incomes on the bottom 80% have stagnated and in some cases reversed on average, a very small number of Americans are wealther than ever. In terms of Purchasing Power, Americans on average are much worse than they were in 1980. The middle class has become a husk of what it was 30 years ago. Where have you been while all the globalization has been going on? Manufacturing isn't some kind of fringe element of the economy, financial and debt sectors and service industry are the majority of our GDP, that's like building a house on wet sand. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;incomes on the bottom 80% have stagnated and in some cases reversed on average, a very small number of Americans are wealther than ever. In terms of Purchasing Power, Americans on average are much worse than they were in 1980. The middle class has become a husk of what it was 30 years ago. Where have you been while all the globalization has been going on? Manufacturing isn&amp;#39;t some kind of fringe element of the economy, financial and debt sectors and service industry are the majority of our GDP, that&amp;#39;s like building a house on wet sand. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z4fhw/", "subreddit_type": "public", "name": "t1_d6z4fhw", "created": 1472355506.0, "author_flair_text": null, "created_utc": 1472326706.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 6, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6z4cjn", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t1_d6z10om", "score": 1, "approved_by": null, "downs": 0, "body": "Americans today are wealthier than they were in 1980 -- and what percentage of our GDP is agriculture today? 2%? Where we better off, materially, back in 1800, when it was 75%?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Americans today are wealthier than they were in 1980 -- and what percentage of our GDP is agriculture today? 2%? Where we better off, materially, back in 1800, when it was 75%?&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z4cjn/", "subreddit_type": "public", "name": "t1_d6z4cjn", "created": 1472355370.0, "author_flair_text": null, "created_utc": 1472326570.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 5, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6z10om", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NemesisNMS", "can_mod_post": false, "ups": 2, "parent_id": "t1_d6z0jjz", "score": 2, "approved_by": null, "downs": 0, "body": "when you say always and everywhere, what happened to the 60,000 factories that have closed down in the USA since the 1980's, a large percentage of which were closed down due to outsourcing? the fact that Manufacturing went from 50% of our GDP to 10%? automation doesn't account for all of that, many of those jobs that used to be in the US aren't performed by robots. Millions of Americans lost their jobs and went from having the income to support their family, to having nothing and in many cases their families were ruined permanently. It's not ranting, it's explaining. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;when you say always and everywhere, what happened to the 60,000 factories that have closed down in the USA since the 1980&amp;#39;s, a large percentage of which were closed down due to outsourcing? the fact that Manufacturing went from 50% of our GDP to 10%? automation doesn&amp;#39;t account for all of that, many of those jobs that used to be in the US aren&amp;#39;t performed by robots. Millions of Americans lost their jobs and went from having the income to support their family, to having nothing and in many cases their families were ruined permanently. It&amp;#39;s not ranting, it&amp;#39;s explaining. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z10om/", "subreddit_type": "public", "name": "t1_d6z10om", "created": 1472350071.0, "author_flair_text": null, "created_utc": 1472321271.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 4, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6z0jjz", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t1_d6yugtu", "score": 1, "approved_by": null, "downs": 0, "body": "Rich people putting their money in the hands of smart people (i.e., capitalism) has always and everywhere raised living standards. Ranting against greedy multinationals and CFOs doesn't. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rich people putting their money in the hands of smart people (i.e., capitalism) has always and everywhere raised living standards. Ranting against greedy multinationals and CFOs doesn&amp;#39;t. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z0jjz/", "subreddit_type": "public", "name": "t1_d6z0jjz", "created": 1472349308.0, "author_flair_text": null, "created_utc": 1472320508.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yugtu", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NemesisNMS", "can_mod_post": false, "ups": 1, "parent_id": "t1_d6ytz7e", "score": 1, "approved_by": null, "downs": 0, "body": "and the guys building/maintaining the robots and working at the robot control panel could be American, no reason not to if the free trade deals were dissolved. the system as it stands incentivizes shipping jobs overseas or to Mexico because there are barely any penalties to do so and the company can make a shit load of money doing it. Take Carrier in Indiana for example, their parent company posted a $9 billion profit last year, and they moved their factory to Mexico \"to stay competitive\", which is hard to understand considering they are making damn good money as it is.\n\n The point being, capitalism in it's purest form is a hungry, voracious predator. a magnificent apex beast that dominates the food chain, but it still requires food (human consumption) to survive, and when people aren't hired and aren't spending money, the beast goes hungry. Closing free trade agreements and/or instituting trade tariffs will give the average US worker a chance to compete with the \"global market\" again. If they are working a job that's going to get automated, the factory where the robots are operating can still be created in the USA, and the materials that go into making the factory can be bought from US suppliers. IS that more expensive than building the factory and materials in Vietnam? well I'd say it is, but judging by how much money multi-nationals typically make nowadays, they're doing better than they ever have, I'm not going to shed any tears for the poor CFO's who have to report to their board room that they only saw a 10% profit margin instead of a 35% one. My point is, China is manipulating the fuck out of our trade deal, we have a huge deficit in trade in part because China puts big tariffs on foreign goods that we don't, so they sell to us with no strings attached and we sell to them with a bunch of loopholes, which is why the USA doesn't manufacture shit anymore, something like 10% of our economy is in Manufacturing when it used to be 50% in our grandparent's day. We've closed like 60,000 factories since the 1980's. Automation doesn't account for all of that, and it didn't have to go down that way, it's not like the USA having all of its manuf. jobs outsourced is as set-in-stone as automation removing those jobs in the future. I know I'm kind of ranting on this, but I do want to draw a distinction between automation naturally removing tons of jobs - which I want to be clear I fully understand and I'm totally fine with that, that's what progress looks like - and greedy multi-nationals who could give a fuck less about a US worker feeding his family if it means they could fire him and hire a bunch of Laotians to do the same thing for slave wages. I understand market forces and globalization, my point is, that's not something we should let dictate the status of millions of US jobs without doing SOMETHING to help the US worker. only 6% of jobs are unionized now I think I saw, so most of those workers have zero options and get screwed over big time. ", "edited": 1472310646.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;and the guys building/maintaining the robots and working at the robot control panel could be American, no reason not to if the free trade deals were dissolved. the system as it stands incentivizes shipping jobs overseas or to Mexico because there are barely any penalties to do so and the company can make a shit load of money doing it. Take Carrier in Indiana for example, their parent company posted a $9 billion profit last year, and they moved their factory to Mexico &amp;quot;to stay competitive&amp;quot;, which is hard to understand considering they are making damn good money as it is.&lt;/p&gt;\n\n&lt;p&gt;The point being, capitalism in it&amp;#39;s purest form is a hungry, voracious predator. a magnificent apex beast that dominates the food chain, but it still requires food (human consumption) to survive, and when people aren&amp;#39;t hired and aren&amp;#39;t spending money, the beast goes hungry. Closing free trade agreements and/or instituting trade tariffs will give the average US worker a chance to compete with the &amp;quot;global market&amp;quot; again. If they are working a job that&amp;#39;s going to get automated, the factory where the robots are operating can still be created in the USA, and the materials that go into making the factory can be bought from US suppliers. IS that more expensive than building the factory and materials in Vietnam? well I&amp;#39;d say it is, but judging by how much money multi-nationals typically make nowadays, they&amp;#39;re doing better than they ever have, I&amp;#39;m not going to shed any tears for the poor CFO&amp;#39;s who have to report to their board room that they only saw a 10% profit margin instead of a 35% one. My point is, China is manipulating the fuck out of our trade deal, we have a huge deficit in trade in part because China puts big tariffs on foreign goods that we don&amp;#39;t, so they sell to us with no strings attached and we sell to them with a bunch of loopholes, which is why the USA doesn&amp;#39;t manufacture shit anymore, something like 10% of our economy is in Manufacturing when it used to be 50% in our grandparent&amp;#39;s day. We&amp;#39;ve closed like 60,000 factories since the 1980&amp;#39;s. Automation doesn&amp;#39;t account for all of that, and it didn&amp;#39;t have to go down that way, it&amp;#39;s not like the USA having all of its manuf. jobs outsourced is as set-in-stone as automation removing those jobs in the future. I know I&amp;#39;m kind of ranting on this, but I do want to draw a distinction between automation naturally removing tons of jobs - which I want to be clear I fully understand and I&amp;#39;m totally fine with that, that&amp;#39;s what progress looks like - and greedy multi-nationals who could give a fuck less about a US worker feeding his family if it means they could fire him and hire a bunch of Laotians to do the same thing for slave wages. I understand market forces and globalization, my point is, that&amp;#39;s not something we should let dictate the status of millions of US jobs without doing SOMETHING to help the US worker. only 6% of jobs are unionized now I think I saw, so most of those workers have zero options and get screwed over big time. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yugtu/", "subreddit_type": "public", "name": "t1_d6yugtu", "created": 1472339241.0, "author_flair_text": null, "created_utc": 1472310441.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6ytz7e", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 2, "parent_id": "t1_d6yi91f", "score": 2, "approved_by": null, "downs": 0, "body": "Cutting free trade agreements won't preserve jobs. \n\nDon't disagree with any of the other stuff, but jobs will just be automated if they are't outsourced.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cutting free trade agreements won&amp;#39;t preserve jobs. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t disagree with any of the other stuff, but jobs will just be automated if they are&amp;#39;t outsourced.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6ytz7e/", "subreddit_type": "public", "name": "t1_d6ytz7e", "created": 1472338358.0, "author_flair_text": null, "created_utc": 1472309558.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d6yscjm", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Kommander000", "can_mod_post": false, "ups": 1, "parent_id": "t1_d6yi91f", "score": 1, "approved_by": null, "downs": 0, "body": "I'm archiving this. ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m archiving this. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yscjm/", "subreddit_type": "public", "name": "t1_d6yscjm", "created": 1472335176.0, "author_flair_text": "yes russian exercise guru", "created_utc": 1472306376.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yi91f", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NemesisNMS", "can_mod_post": false, "ups": -2, "parent_id": "t3_4zsspr", "score": -2, "approved_by": null, "downs": 0, "body": "here's the deal, the richest 60 people own more money than the bottom 50% of the world. incomes in the USA have stagnated and actually dropped for the bottom 80% for going on 40 years straight. The middle class has shrunken to its lowest level since the Great Depression. Income and wealth inequality is at its greatest point since the Great Depression. It's worse now than it was in France during the French Revolution, then the richest 3% owned 30% of all the wealth, now it's more like the top 0.1% own 40% of all the wealth.\n\nI am not a marxist/communist, but I am a left leaning libertarian. Left in the classical sense, not the modern SJW communist marxist bullshit sense. I want the system to work for everyone in such a way that everyone still owns their own private property, yet opportunity exists for people who want to succeed, right now it's hard to succeed even with hard work because the 1%, large corporations and the government all conspire to keep a monopoly on power, big companies love the government because they have the lawyers and accountants to help them navigate all the regulation and bullshit that their potential rivals and competition cant.  I want a system that works so well people don't even think about instituting some kind of marxist takeover. That's the reason there are so many people who are willing to make state power much stronger, because they have nothing to lose, they are making the equivalent of $3/hour 20 years ago and see nothing wrong with trying to make the system work for them for a change. You emulate the Swiss model, have government regulated health insurance but keep it owned by private companies, but unlike Obamacare, actually enforce the regulation so companies are FORCED, not \"given the option to\", to COMPETE with each other. Privatize failing public schools and have them compete with other schools for government issued vouchers to parents to decide which school their child goes to. Close tax loopholes for huge corporations, remove regulations on small businesses and give more incentives to small business, remove most if not all of the subsidies that the government gives to already-billion dollar industries. Stop free trade agreements, they aren't libertarian policies, they are corrupt globalist/corporatist policies instituted in the NAME of freedom, it's freedom for a large corporation to cut American jobs and outsource the labor to countries that are so poor it's a better deal than slavery. A lot of anarcho-capitalists and right wingers make the mistake of believing everything that helps corporations get ahead is a free market principle that helps everybody and helps the country prosper. That is not the case, taxes are avoided by the same companies, and the wages that they do pay are going to people in a foreign land and the money is going into that foreign country. So what does that end up doing? People who buy from that company are literally sending their money out of the country, and what money the company doesn't spend in the US is just put in a bank account, not being spent in the USA. Right wingers need to understand that shit is going really bad, and it's not because of SJW marxists, it's because the Government is owned and in bed with Multi-National corporations, and their end game is to bleed the USA dry and burn the bridge after they've finished. We can institute policies to fix the situation without implementing any socialist communist bullshit like the SJWs want to do, but doing nothing is giving the SJW's more leverage as shit gets worse and worse, more and more people will see them as a solution since we aren't putting up one of our own.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;here&amp;#39;s the deal, the richest 60 people own more money than the bottom 50% of the world. incomes in the USA have stagnated and actually dropped for the bottom 80% for going on 40 years straight. The middle class has shrunken to its lowest level since the Great Depression. Income and wealth inequality is at its greatest point since the Great Depression. It&amp;#39;s worse now than it was in France during the French Revolution, then the richest 3% owned 30% of all the wealth, now it&amp;#39;s more like the top 0.1% own 40% of all the wealth.&lt;/p&gt;\n\n&lt;p&gt;I am not a marxist/communist, but I am a left leaning libertarian. Left in the classical sense, not the modern SJW communist marxist bullshit sense. I want the system to work for everyone in such a way that everyone still owns their own private property, yet opportunity exists for people who want to succeed, right now it&amp;#39;s hard to succeed even with hard work because the 1%, large corporations and the government all conspire to keep a monopoly on power, big companies love the government because they have the lawyers and accountants to help them navigate all the regulation and bullshit that their potential rivals and competition cant.  I want a system that works so well people don&amp;#39;t even think about instituting some kind of marxist takeover. That&amp;#39;s the reason there are so many people who are willing to make state power much stronger, because they have nothing to lose, they are making the equivalent of $3/hour 20 years ago and see nothing wrong with trying to make the system work for them for a change. You emulate the Swiss model, have government regulated health insurance but keep it owned by private companies, but unlike Obamacare, actually enforce the regulation so companies are FORCED, not &amp;quot;given the option to&amp;quot;, to COMPETE with each other. Privatize failing public schools and have them compete with other schools for government issued vouchers to parents to decide which school their child goes to. Close tax loopholes for huge corporations, remove regulations on small businesses and give more incentives to small business, remove most if not all of the subsidies that the government gives to already-billion dollar industries. Stop free trade agreements, they aren&amp;#39;t libertarian policies, they are corrupt globalist/corporatist policies instituted in the NAME of freedom, it&amp;#39;s freedom for a large corporation to cut American jobs and outsource the labor to countries that are so poor it&amp;#39;s a better deal than slavery. A lot of anarcho-capitalists and right wingers make the mistake of believing everything that helps corporations get ahead is a free market principle that helps everybody and helps the country prosper. That is not the case, taxes are avoided by the same companies, and the wages that they do pay are going to people in a foreign land and the money is going into that foreign country. So what does that end up doing? People who buy from that company are literally sending their money out of the country, and what money the company doesn&amp;#39;t spend in the US is just put in a bank account, not being spent in the USA. Right wingers need to understand that shit is going really bad, and it&amp;#39;s not because of SJW marxists, it&amp;#39;s because the Government is owned and in bed with Multi-National corporations, and their end game is to bleed the USA dry and burn the bridge after they&amp;#39;ve finished. We can institute policies to fix the situation without implementing any socialist communist bullshit like the SJWs want to do, but doing nothing is giving the SJW&amp;#39;s more leverage as shit gets worse and worse, more and more people will see them as a solution since we aren&amp;#39;t putting up one of our own.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yi91f/", "subreddit_type": "public", "name": "t1_d6yi91f", "created": 1472303595.0, "author_flair_text": null, "created_utc": 1472274795.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 1, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d6yjeh7", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 2, "parent_id": "t1_d6yjdfj", "score": 2, "approved_by": null, "downs": 0, "body": "Aight aight i yield", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aight aight i yield&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yjeh7/", "subreddit_type": "public", "name": "t1_d6yjeh7", "created": 1472306440.0, "author_flair_text": "CUM = YUM", "created_utc": 1472277640.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 8, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yjdfj", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 3, "parent_id": "t1_d6yjb5u", "score": 3, "approved_by": null, "downs": 0, "body": "Ok. Maybe not every person asking me to join \"White Aryan Prisonbuttsex Nation\" is a shill, maybe some are, maybe none are. It's just like my opinion man.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok. Maybe not every person asking me to join &amp;quot;White Aryan Prisonbuttsex Nation&amp;quot; is a shill, maybe some are, maybe none are. It&amp;#39;s just like my opinion man.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yjdfj/", "subreddit_type": "public", "name": "t1_d6yjdfj", "created": 1472306363.0, "author_flair_text": null, "created_utc": 1472277563.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 7, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yjb5u", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t1_d6yj8j2", "score": 1, "approved_by": null, "downs": 0, "body": "&gt;It wouldn't be surprising if a lot of the people trying to push the anti-globalist, anti-SJW movement towards old school white supremacism are on someone's payroll\n\nIs what I was referring to", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It wouldn&amp;#39;t be surprising if a lot of the people trying to push the anti-globalist, anti-SJW movement towards old school white supremacism are on someone&amp;#39;s payroll&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is what I was referring to&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yjb5u/", "subreddit_type": "public", "name": "t1_d6yjb5u", "created": 1472306196.0, "author_flair_text": "CUM = YUM", "created_utc": 1472277396.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 6, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yj8j2", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 2, "parent_id": "t1_d6yj5rn", "score": 2, "approved_by": null, "downs": 0, "body": "I'm not saying this guy is at all. It's just worth considering how certain groups \"shift\" into new opinions while a new narrative in the media is also being put forth. And then take into consideration there are probably more feds and informants in these \"hate\" groups than real members.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not saying this guy is at all. It&amp;#39;s just worth considering how certain groups &amp;quot;shift&amp;quot; into new opinions while a new narrative in the media is also being put forth. And then take into consideration there are probably more feds and informants in these &amp;quot;hate&amp;quot; groups than real members.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yj8j2/", "subreddit_type": "public", "name": "t1_d6yj8j2", "created": 1472306004.0, "author_flair_text": null, "created_utc": 1472277204.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 5, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yj5rn", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t1_d6yiwni", "score": 1, "approved_by": null, "downs": 0, "body": "Let's not pretend that everyone with an unsavory opinion is an agent provacateur.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let&amp;#39;s not pretend that everyone with an unsavory opinion is an agent provacateur.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yj5rn/", "subreddit_type": "public", "name": "t1_d6yj5rn", "created": 1472305805.0, "author_flair_text": "CUM = YUM", "created_utc": 1472277005.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 4, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d6zf23n", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 2, "parent_id": "t1_d6z9v5f", "score": 2, "approved_by": null, "downs": 0, "body": "Holy fuck dude take it down a notch. I would bet we are on the same page for 99% of the same issues.\n\nI'm not saying you shouldn't criticize anybody ffs. I'm talking about the race war rhetoric. I'm saying if you're in a white supremacist organization, or if you've done time in prison where you got into that org, you're probably a shitbag and it would probably be good for our movement to distance themselves from such mongoloids.\n\n&gt;Because all I'm doing is literally speaking what I see with my own two eyes. \n\nAnd when I say it seems like most of the BLM clowns are rich white college kids, I'm doing the exact same thing. So why is one observation valid and the other isn't?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy fuck dude take it down a notch. I would bet we are on the same page for 99% of the same issues.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying you shouldn&amp;#39;t criticize anybody ffs. I&amp;#39;m talking about the race war rhetoric. I&amp;#39;m saying if you&amp;#39;re in a white supremacist organization, or if you&amp;#39;ve done time in prison where you got into that org, you&amp;#39;re probably a shitbag and it would probably be good for our movement to distance themselves from such mongoloids.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Because all I&amp;#39;m doing is literally speaking what I see with my own two eyes. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And when I say it seems like most of the BLM clowns are rich white college kids, I&amp;#39;m doing the exact same thing. So why is one observation valid and the other isn&amp;#39;t?&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6zf23n/", "subreddit_type": "public", "name": "t1_d6zf23n", "created": 1472373631.0, "author_flair_text": null, "created_utc": 1472344831.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 9, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6z9v5f", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NemesisNMS", "can_mod_post": false, "ups": 2, "parent_id": "t1_d6z8wt2", "score": 2, "approved_by": null, "downs": 0, "body": "you're saying I'm full of shit because I'm making the claim that #BLM has mostly black people marching with them chanting for dead police and chasing down white people, and whenever a Trump event is hosted in a city with a hispanic population it's mostly hispanic people waving mexican flags and chasing down white people. You're arguing with me to somehow prove the point that white SJW millennials from the north east - where I don't live - are the only group we can criticize, because to do otherwise is to \"delegitimize the anti-PC movement\" because people will call you a racist for bringing it up. and that's counter productive. am I understanding that correctly? Because all I'm doing is literally speaking what I see with my own two eyes. I'm far from giving a shit if people get upset that I'm speaking out about what I'm witnessing. There's already enough bullshit getting thrown around in an attempt to distort, hide, cover-up and mitigate reality. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you&amp;#39;re saying I&amp;#39;m full of shit because I&amp;#39;m making the claim that #BLM has mostly black people marching with them chanting for dead police and chasing down white people, and whenever a Trump event is hosted in a city with a hispanic population it&amp;#39;s mostly hispanic people waving mexican flags and chasing down white people. You&amp;#39;re arguing with me to somehow prove the point that white SJW millennials from the north east - where I don&amp;#39;t live - are the only group we can criticize, because to do otherwise is to &amp;quot;delegitimize the anti-PC movement&amp;quot; because people will call you a racist for bringing it up. and that&amp;#39;s counter productive. am I understanding that correctly? Because all I&amp;#39;m doing is literally speaking what I see with my own two eyes. I&amp;#39;m far from giving a shit if people get upset that I&amp;#39;m speaking out about what I&amp;#39;m witnessing. There&amp;#39;s already enough bullshit getting thrown around in an attempt to distort, hide, cover-up and mitigate reality. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z9v5f/", "subreddit_type": "public", "name": "t1_d6z9v5f", "created": 1472364595.0, "author_flair_text": null, "created_utc": 1472335795.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 8, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6z8wt2", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t1_d6z4q17", "score": 1, "approved_by": null, "downs": 0, "body": "&gt;every individual person marching with BLM and all the individuals marching and waving mexican flags have had contact with a proxy of Soros\n\nI obviously didn't even imply that. They are being manipulated. Also, your comment is sort of full of shit in the first place - around here in the north east there seem to be more rich white liberal college kids in BLM protests than blacks.\n\nThe point of my comment is that viewing this entire goat rodeo from the point of view of \"race\" is exactly what they want you to do. It delegitimizes the anti-globalist/anti-PC movement due to the conditioning of the average schlub, and is ultimately counter productive because ghetto blacks are just as much victims of failed left wing policies as the middle class whites that can't find decent jobs anymore.\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;every individual person marching with BLM and all the individuals marching and waving mexican flags have had contact with a proxy of Soros&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I obviously didn&amp;#39;t even imply that. They are being manipulated. Also, your comment is sort of full of shit in the first place - around here in the north east there seem to be more rich white liberal college kids in BLM protests than blacks.&lt;/p&gt;\n\n&lt;p&gt;The point of my comment is that viewing this entire goat rodeo from the point of view of &amp;quot;race&amp;quot; is exactly what they want you to do. It delegitimizes the anti-globalist/anti-PC movement due to the conditioning of the average schlub, and is ultimately counter productive because ghetto blacks are just as much victims of failed left wing policies as the middle class whites that can&amp;#39;t find decent jobs anymore.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z8wt2/", "subreddit_type": "public", "name": "t1_d6z8wt2", "created": 1472362943.0, "author_flair_text": null, "created_utc": 1472334143.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 7, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6z4q17", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NemesisNMS", "can_mod_post": false, "ups": 0, "parent_id": "t1_d6z3b1f", "score": 0, "approved_by": null, "downs": 0, "body": "so every individual person marching with BLM and all the individuals marching and waving mexican flags have had contact with a proxy of Soros and have their bank accounts a little heavier having done some paid work. Listen buddy, you gotta start thinking a little more rationally. I have no doubt that Soros is involved with movements like BLM but to believe that the vast majority of people are in on it is silly. They are being useful idiots, but they honestly believe what they are saying, and have made themselves a force to be reckoned with, hopefully by direct police intervention. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;so every individual person marching with BLM and all the individuals marching and waving mexican flags have had contact with a proxy of Soros and have their bank accounts a little heavier having done some paid work. Listen buddy, you gotta start thinking a little more rationally. I have no doubt that Soros is involved with movements like BLM but to believe that the vast majority of people are in on it is silly. They are being useful idiots, but they honestly believe what they are saying, and have made themselves a force to be reckoned with, hopefully by direct police intervention. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z4q17/", "subreddit_type": "public", "name": "t1_d6z4q17", "created": 1472355981.0, "author_flair_text": null, "created_utc": 1472327181.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 6, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6z3b1f", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 0, "parent_id": "t1_d6yvxhp", "score": 0, "approved_by": null, "downs": 0, "body": "&gt; and the hordes of black people marching in the streets calling for dead policemen, burning shit down and beating up white people at random, and the hordes of mexicans etc etc\n\nThese people are demonstrably bought and paid for by George Soros and others. Promoted by time warner's CNN. If you don't see how the upper class WASP SJWs are driving all of this shit, I don't know what to tell you.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;and the hordes of black people marching in the streets calling for dead policemen, burning shit down and beating up white people at random, and the hordes of mexicans etc etc&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;These people are demonstrably bought and paid for by George Soros and others. Promoted by time warner&amp;#39;s CNN. If you don&amp;#39;t see how the upper class WASP SJWs are driving all of this shit, I don&amp;#39;t know what to tell you.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6z3b1f/", "subreddit_type": "public", "name": "t1_d6z3b1f", "created": 1472353674.0, "author_flair_text": null, "created_utc": 1472324874.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 5, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yvxhp", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NemesisNMS", "can_mod_post": false, "ups": 0, "parent_id": "t1_d6yiwni", "score": 0, "approved_by": null, "downs": 0, "body": "&gt; The people driving us off a cliff right now are upper-middle class white Anglo-Saxon Protestant liberals.\n\noh, and the hordes of black people marching in the streets calling for dead policemen, burning shit down and beating up white people at random, and the hordes of mexicans marching in the streets of USA waving the flag of Mexico and beating up white people at random", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The people driving us off a cliff right now are upper-middle class white Anglo-Saxon Protestant liberals.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;oh, and the hordes of black people marching in the streets calling for dead policemen, burning shit down and beating up white people at random, and the hordes of mexicans marching in the streets of USA waving the flag of Mexico and beating up white people at random&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yvxhp/", "subreddit_type": "public", "name": "t1_d6yvxhp", "created": 1472341742.0, "author_flair_text": null, "created_utc": 1472312942.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 4, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yiwni", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 4, "parent_id": "t1_d6yikaj", "score": 4, "approved_by": null, "downs": 0, "body": "The white supremacist movement is great if you're A) looking for connections in the meth game, or B) want to meet an undercover federal agent. Or if you're just an ignorant moron.\n\nIt wouldn't be surprising if a lot of the people trying to push the anti-globalist, anti-SJW movement towards old school white supremacism are on someone's payroll, their organizations have already been heavily infiltrated by the gov. Anyone who knows what is going on knows this isn't about race. The people driving us off a cliff right now are upper-middle class white Anglo-Saxon Protestant liberals. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The white supremacist movement is great if you&amp;#39;re A) looking for connections in the meth game, or B) want to meet an undercover federal agent. Or if you&amp;#39;re just an ignorant moron.&lt;/p&gt;\n\n&lt;p&gt;It wouldn&amp;#39;t be surprising if a lot of the people trying to push the anti-globalist, anti-SJW movement towards old school white supremacism are on someone&amp;#39;s payroll, their organizations have already been heavily infiltrated by the gov. Anyone who knows what is going on knows this isn&amp;#39;t about race. The people driving us off a cliff right now are upper-middle class white Anglo-Saxon Protestant liberals. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yiwni/", "subreddit_type": "public", "name": "t1_d6yiwni", "created": 1472305151.0, "author_flair_text": null, "created_utc": 1472276351.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yikaj", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Fascist_Forever", "can_mod_post": false, "ups": -2, "parent_id": "t1_d6yi4pq", "score": -2, "approved_by": null, "downs": 0, "body": "Not really, knowing some people with similar ideas and attitudes isn't a bad start", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not really, knowing some people with similar ideas and attitudes isn&amp;#39;t a bad start&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yikaj/", "subreddit_type": "public", "name": "t1_d6yikaj", "created": 1472304312.0, "author_flair_text": "Don't force feed, inspire hunger", "created_utc": 1472275512.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 1, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yi4pq", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "xKillerDreag", "can_mod_post": false, "ups": 6, "parent_id": "t1_d6yhvg0", "score": 6, "approved_by": null, "downs": 0, "body": "you mean completely spergy right", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you mean completely spergy right&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yi4pq/", "subreddit_type": "public", "name": "t1_d6yi4pq", "created": 1472303319.0, "author_flair_text": null, "created_utc": 1472274519.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4zsspr", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d6yiixj", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Fascist_Forever", "can_mod_post": false, "ups": -4, "parent_id": "t1_d6yi9b9", "score": -4, "approved_by": null, "downs": 0, "body": "How?", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How?&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yiixj/", "subreddit_type": "public", "name": "t1_d6yiixj", "created": 1472304228.0, "author_flair_text": "Don't force feed, inspire hunger", "created_utc": 1472275428.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 1, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yi9b9", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "HormelCoffee", "can_mod_post": false, "ups": 3, "parent_id": "t1_d6yhvg0", "score": 3, "approved_by": null, "downs": 0, "body": "you're a massive fucking retard", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you&amp;#39;re a massive fucking retard&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yi9b9/", "subreddit_type": "public", "name": "t1_d6yi9b9", "created": 1472303612.0, "author_flair_text": null, "created_utc": 1472274812.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 1, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d6yhvg0", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Fascist_Forever", "can_mod_post": false, "ups": -3, "parent_id": "t3_4zsspr", "score": -3, "approved_by": null, "downs": 0, "body": "Just read the long post Sam made about how things are going in general (pic). Is anyone seriously doing anything in preparation for a continued ideological/physically fight against the left and their pets? By all means we should aim to win this peacefully and culturally first but when the time comes how many of you are actually prepared to go outside and protest, advocate and fight for white culture? even physically everyone in this subreddit should be doing at least one thing every day to fight against this shit.\n\nThe turbo kikes and militant dykes aren't going to slow down until all of the western mans past is destroyed and they're happily prepared to use their muslim and black sappers for their slow insurgency, There's multiple things I recommend you guys do 1. Buy a gun, obviously, I'm not even an American and I'm still tryna get one 2. Lift, also pretty obvious 3. stack up on food, water and gear and shit 4. It might sound a bit spergy but you should look into joining your local daily stormer \"book club\" ( http://bbs.dailystormer.com/c/book-club), you'll need people to depend upon if shit goes south and you should be campaing and protesting if you want any real change in society, before violence is necessary 5. and last but perhaps most importantly, buy the book", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just read the long post Sam made about how things are going in general (pic). Is anyone seriously doing anything in preparation for a continued ideological/physically fight against the left and their pets? By all means we should aim to win this peacefully and culturally first but when the time comes how many of you are actually prepared to go outside and protest, advocate and fight for white culture? even physically everyone in this subreddit should be doing at least one thing every day to fight against this shit.&lt;/p&gt;\n\n&lt;p&gt;The turbo kikes and militant dykes aren&amp;#39;t going to slow down until all of the western mans past is destroyed and they&amp;#39;re happily prepared to use their muslim and black sappers for their slow insurgency, There&amp;#39;s multiple things I recommend you guys do 1. Buy a gun, obviously, I&amp;#39;m not even an American and I&amp;#39;m still tryna get one 2. Lift, also pretty obvious 3. stack up on food, water and gear and shit 4. It might sound a bit spergy but you should look into joining your local daily stormer &amp;quot;book club&amp;quot; ( &lt;a href=\"http://bbs.dailystormer.com/c/book-club\"&gt;http://bbs.dailystormer.com/c/book-club&lt;/a&gt;), you&amp;#39;ll need people to depend upon if shit goes south and you should be campaing and protesting if you want any real change in society, before violence is necessary 5. and last but perhaps most importantly, buy the book&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/4zsspr/what_are_you_gonna_do_when_shtf/d6yhvg0/", "subreddit_type": "public", "name": "t1_d6yhvg0", "created": 1472302735.0, "author_flair_text": "Don't force feed, inspire hunger", "created_utc": 1472273935.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]