[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;i get on random tangents in my head and i got to memes and wanted to fucking kill myself so i went to writing about it and why they suck ass, let me know if im fucking stupid or onto something, maybe im just uninformed about it all&lt;/p&gt;\n\n&lt;p&gt;Death grips served the servants (jenny death when), which is a great example as to the internet culture being self destructive because of itself, based on the foundation that makes the internet culture the internet culture. &lt;/p&gt;\n\n&lt;p&gt;The top comments are people destroying the artistic integrity of them as an art piece, and more of just a cool fun well known &amp;quot;internet meme&amp;quot; that makes the many happy. The esoteric portion of those who genuinely enjoy them are thusly clumped together with the &amp;quot;memers&amp;quot; and aren&amp;#39;t rewarded for their independent efforts on enjoying them &amp;quot;unironically&amp;quot; and your credibility for being a human is lost. You are now part of the majority even if you aren&amp;#39;t, they decide for you. They will never understand the esoteric portion of art and the quality of what is behind it, as most will just see it as crazy, not normal, just another meme to add to their collection. Even if it&amp;#39;s death grips, a left field group which shown that originality is not dead and artistic efforts are rewarded through application and layers of thought, eventually the mass will take hold and destroy the integrity and quality that, in this case Death Grips, art, and only to morph it into a form of information that the rest of the majority can digest easily. Adding a meme to the meme bin, so the rest of everyone can get along and be smart. Don&amp;#39;t fucking think, stop. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a self destructive culture that feeds on new ideas, and then puts it in a context that makes those ideas lose their original meaning, thus defeating the entire point of the idea in the first place. By saying meme in a comment, and having it being the top voted comment completely DESTROYS any form of art medium, because you just took this thought, no matter if it was original or whatever, and amassed it with the rest. At some point everything is a meme, and memes themselves have because a meme simply through post modern ideas and those layers as well as having most people be aware of what makes a meme a meme. &lt;/p&gt;\n\n&lt;p&gt;The internet is killing itself through the regurgitation of any art medium, and then morphing it into an accepted form that most can connect to, eventually getting to a point of self-implosion. &lt;/p&gt;\n\n&lt;p&gt;Technology is advancing to the point where it will kill and defeat the subjective free thought of humanity, turning into submissive child-like adults.\nFuturism is alive on the internet and is definitely here today, simply through the use of phones and internet memes, helping the subconscious be released into a fully controlled and accepted environment. &lt;/p&gt;\n\n&lt;p&gt;Memes are the creation of fallacies in the depth of art, and if everything that makes Art Art become just a meme and a joke, then our mental existence and value behind anything is nothing, forcing all forms of thought and reasonings and anything become nothing but shit; just a joke that everyone agrees on. &lt;/p&gt;\n\n&lt;p&gt;Memes are to make fun of art, or take art and then destroy the purpose and authenticity behind it so that it can become a meme, for everyone to &amp;quot;get&amp;quot; it, and to not have to make you think. But then it becomes an art itself since there is a form of thinking behind it and a set amount of rules behind it as well. But then that will become a meme simply through the rules of what a meme is, thus becoming a cycle in it of itself due to the nature that we are looking at memes at. What does that leave us with? &lt;/p&gt;\n\n&lt;p&gt;Unhuman, vile filth that destroys the purpose of finding ways to enjoy life. It kills life, memes are going to be the death of us, killing all forms of enjoyment through the rules of memes. Don&amp;#39;t bring them up to me, it&amp;#39;s disgusting. Fuck. &lt;/p&gt;\n\n&lt;p&gt;Example? See twitch chat for 5 seconds. That&amp;#39;s what&amp;#39;s happening. Those are real people all typing that. Fucking hell.&lt;/p&gt;\n\n&lt;p&gt;its not even worth it tho so fuck it&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "i get on random tangents in my head and i got to memes and wanted to fucking kill myself so i went to writing about it and why they suck ass, let me know if im fucking stupid or onto something, maybe im just uninformed about it all\n\nDeath grips served the servants (jenny death when), which is a great example as to the internet culture being self destructive because of itself, based on the foundation that makes the internet culture the internet culture. \n\nThe top comments are people destroying the artistic integrity of them as an art piece, and more of just a cool fun well known \"internet meme\" that makes the many happy. The esoteric portion of those who genuinely enjoy them are thusly clumped together with the \"memers\" and aren't rewarded for their independent efforts on enjoying them \"unironically\" and your credibility for being a human is lost. You are now part of the majority even if you aren't, they decide for you. They will never understand the esoteric portion of art and the quality of what is behind it, as most will just see it as crazy, not normal, just another meme to add to their collection. Even if it's death grips, a left field group which shown that originality is not dead and artistic efforts are rewarded through application and layers of thought, eventually the mass will take hold and destroy the integrity and quality that, in this case Death Grips, art, and only to morph it into a form of information that the rest of the majority can digest easily. Adding a meme to the meme bin, so the rest of everyone can get along and be smart. Don't fucking think, stop. \n\nIt's a self destructive culture that feeds on new ideas, and then puts it in a context that makes those ideas lose their original meaning, thus defeating the entire point of the idea in the first place. By saying meme in a comment, and having it being the top voted comment completely DESTROYS any form of art medium, because you just took this thought, no matter if it was original or whatever, and amassed it with the rest. At some point everything is a meme, and memes themselves have because a meme simply through post modern ideas and those layers as well as having most people be aware of what makes a meme a meme. \n\nThe internet is killing itself through the regurgitation of any art medium, and then morphing it into an accepted form that most can connect to, eventually getting to a point of self-implosion. \n\nTechnology is advancing to the point where it will kill and defeat the subjective free thought of humanity, turning into submissive child-like adults.\nFuturism is alive on the internet and is definitely here today, simply through the use of phones and internet memes, helping the subconscious be released into a fully controlled and accepted environment. \n\nMemes are the creation of fallacies in the depth of art, and if everything that makes Art Art become just a meme and a joke, then our mental existence and value behind anything is nothing, forcing all forms of thought and reasonings and anything become nothing but shit; just a joke that everyone agrees on. \n\nMemes are to make fun of art, or take art and then destroy the purpose and authenticity behind it so that it can become a meme, for everyone to \"get\" it, and to not have to make you think. But then it becomes an art itself since there is a form of thinking behind it and a set amount of rules behind it as well. But then that will become a meme simply through the rules of what a meme is, thus becoming a cycle in it of itself due to the nature that we are looking at memes at. What does that leave us with? \n\nUnhuman, vile filth that destroys the purpose of finding ways to enjoy life. It kills life, memes are going to be the death of us, killing all forms of enjoyment through the rules of memes. Don't bring them up to me, it's disgusting. Fuck. \n\nExample? See twitch chat for 5 seconds. That's what's happening. Those are real people all typing that. Fucking hell.\n\n\nits not even worth it tho so fuck it\n\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "55qz4j", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "tell me if im insane please, fuck memes", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 0, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_55qz4j", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/55qz4j/tell_me_if_im_insane_please_fuck_memes/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1475571014.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/55qz4j/tell_me_if_im_insane_please_fuck_memes/", "author_flair_text": null, "quarantine": false, "author": "GaryMFINGOak", "created_utc": 1475542214.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 1.0, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [], "after": null, "before": null}}]