[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A lot of you ask me, you look as like a role model, you say to yourselves, &amp;quot;How does sam get the hot girls and the cars and he&amp;#39;s got a position in life that I&amp;#39;m envious of? What was this guy&amp;#39;s deal in high school?&amp;quot; You&amp;#39;re looking at me saying to yourselves, &amp;quot;This guy&amp;#39;s a nerd. How can he possible be as cool as he is, he&amp;#39;s obviously a nerd.&amp;quot; The story that I relate to people is the story of how I survived high school, my formative years.&lt;/p&gt;\n\n&lt;p&gt;You know that old classic nightmare, the one everyone&amp;#39;s had at least once? You know the drill by now; You wake up, and WOW, you&amp;#39;re in class but somethings wrong. Holy cow! It&amp;#39;s your pants! You&amp;#39;re not wearing any! You&amp;#39;re only in your underbriefs. Either that, or your most embarassing pair of spandex pants. Maybe even all the pretty girls you like are there with front row seats, laughing up a gigglestorm at your shorts. Everyone hates you. Why you? Why me? Why are they doing this? Why oh why did my mom forget to lay out my trousers this morning. Stupid mom. And then it stops. Then you wake up. Everything is a-okay, good, all clear, right on. You&amp;#39;re in your nice warm bed, and your clothes, and yes, even your trousers are arranged nicely and warmed up by your dear loving mother. You smell a delicious breakfast banquet wafting into your room from the kitchen. You&amp;#39;ll leave the house fully dressed no doubt, and make it through the day with all of your classmate friends, buds, and pals too. After class maybe you&amp;#39;ll walk home with some friends of yours by the side of the river, and they&amp;#39;ll all compliment your style of trousers and undergarments, and cool japanese gadget attachments all over your overcoat. As the sun starts to set and you all part ways, heading home and waving goodbye and looking forward to another formative day in high school, as you walk home there&amp;#39;s no longer a trace of that bad dream you had earlier.&lt;/p&gt;\n\n&lt;p&gt;Well for me this is no silly dream. This was no &amp;quot;night terror&amp;quot; that I could simply have just &amp;quot;waited out&amp;quot; and woken up from into warm blanket and a morning greeting. This was no load of bologna community college-style self help &amp;quot;I&amp;#39;m going to wake up mid-dream and take hold of the situation&amp;quot; dream diary type thing. This was my real, everyday life. I was there in class being held upside down by my classmates, totally pantsed, lobster red, whipped into a real sweat from embarassment, as all my fellow classmates and my teacher pinched and prodded my feelings into a tizzy, and dunked my head in a bucket of the brown stuff, chocolate milk.&lt;/p&gt;\n\n&lt;p&gt;High school was more than a nightmare for me. I&amp;#39;m talking personally right now. It was something more like H-E-double hockey sticks. I was burned and seared by cool kids from the moment I stepped in the halls. Hot jocks sprayed extra-sour super blue razz Gogurt directly into my face as soon as that first bell tolled. Something was dreadfully wrong, but I was too busy getting stripped down to my skipperous pantaloons and dunked headfirst into every single toilet in a 5 mile radius to even stop and think. Welcome to my world, and boy is it a world of hurt.&lt;/p&gt;\n\n&lt;p&gt;Good old Hilltop High, where the ruling class jocks and &amp;quot;Sensi&amp;quot;, which is short for sensually hot girls, lord over the social toilet. You got nerds, you got your no-life cybernauts, you got your ugly wimps, you got your crud-for-brains, you got supernerds, you got zyber-lamos, you got super-duper bad-at-sports weaklings, you got weak hearted-wimplings, you got bug collector kids, you got left-over paper bag sack lunch dweebs, you have stupid kids, you have oatmeal raisin losers, you got failed goths, you got super zany troll experts, facebook commentators (&amp;quot;Zuckernerds&amp;quot;), facebook likers, kids who talk about how they don&amp;#39;t have TV at home, kids who talk about how they listen to NPR at home, raised by anime, Goku freaks, lunchroom wanderers, toilet swimmers, toilet divers, kids with rashes, tween bumblerboys, trash heap garbage kids, prom clowns, prom jesters, lunchroom floor dweebs, snot nosed idiots, scoundrel humble-beggars, pump-happy iron pounders, rump-slumping bumblebabies, badly-dressed geektards, gothic style proto Invader Zim trolls, classroom masturbators, classroom chameleons, California Raisins fans, raised-by-tumblr kids, pantsless fools, and the list goes on and on. And guess what? I literally fit into every category.&lt;/p&gt;\n\n&lt;p&gt;You can imagine what was going on, they were bonking me in the head pretty much from bell to bell. I got the bell to bell treatment. In the eyes of the social upper class at Hilltop High, I am the most undesirable and lame person to ever step foot in these halls. Even all the teachers, instructors, advisers, lunch ladies, janitors, disciplinary counselors, and coaches can&amp;#39;t hide their outright hatred of me. That&amp;#39;s how bad it was. There are numerous examples of this, but just to set the stage here one time, I was in homeroom and the teacher Mr. Jacket was announcing our grades for our classes, and when it came to be my turn, Mr. Jacket had me stand in the front of the classroom and proceeded to tell me he was shocked I had actually passed a class! He was actually proud of me for once, and maybe things were finally turning around for ol sam, academically speaking that is. A spark of joy appeared on my face, and that was his signal. He punched me directly in the solar plexus and shrieked at the top of his lungs that I had failed, obviously, and took my grade sheet, crumpled it up, and made me eat it. This is a true story. Oh brother! With all the wind knocked out of me and a big paper ball in my mouth, all I could do was loudly and pathetically groan in front of my dearest classmates, who, by the way, were all busy uploading photos of my embarassing public failure to every social media site possible and laughing mercilessly. Traumatic, right?\nI had no idea what I had done to make them all hate me so much, but they clearly did. I guess it&amp;#39;s pretty clear from that story that I didn&amp;#39;t have the best of grades either. I don&amp;#39;t really want to talk about it, but I&amp;#39;d say it&amp;#39;s a little bit more than that. I mean I didn&amp;#39;t even know how to frickin read until I was 15! I was that stupid. The trauma associated with seeing words on pages or anything else created a mental block that made reading super hard. I only eventually learned the skill of reading from comparing the lyrics I had heard out loud in the songs to the words in the liner notes of all my Marilyn Manson albums, and from the word puzzles and fun games on the back of cereal boxes. And also my dad&amp;#39;s yellow pages that he left all over the house. Gotta love dad and his yellow pages. Good thing ol dad collected those yellow pages. In school, though everyone noticed how weird and melodramatic and also incorrect my grammar was, I got pounded even more. I recall a particularly dark moment when I was in english 101 class, which I failed and had to redo, and the teacher Mrs. Tants said it was my turn to read aloud from the text book. It was really lame and boring basic english stuff that I didn&amp;#39;t even understand anyway. You know, textbook stuff. So&amp;#39;s I thought I might spice things up a little bit and that would be cool, and my classmates would think it was awesome and cool if I added my own &amp;quot;spin&amp;quot; to some of the writing. So I added words like &amp;quot;Gilgamesh&amp;quot; and &amp;quot;black steel rimmed helm&amp;quot; &amp;quot;Lucifer X&amp;quot; and &amp;quot;two-handed crimson broadsword&amp;quot;. To my surprise, everyone burst out laughing at me! I got seriously pantsed that day by everyone in the classroom including the security guards. I have no idea what I did wrong. I thought, &amp;quot;maybe it was all their faults. They just didn&amp;#39;t realize how cool the words were that I was using. Yeah that&amp;#39;s it! Right over their heads!&amp;quot; But I was starting to realize that maybe I was missing something, other than my pants for once. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A lot of you ask me, you look as like a role model, you say to yourselves, \"How does sam get the hot girls and the cars and he's got a position in life that I'm envious of? What was this guy's deal in high school?\" You're looking at me saying to yourselves, \"This guy's a nerd. How can he possible be as cool as he is, he's obviously a nerd.\" The story that I relate to people is the story of how I survived high school, my formative years.\n\nYou know that old classic nightmare, the one everyone's had at least once? You know the drill by now; You wake up, and WOW, you're in class but somethings wrong. Holy cow! It's your pants! You're not wearing any! You're only in your underbriefs. Either that, or your most embarassing pair of spandex pants. Maybe even all the pretty girls you like are there with front row seats, laughing up a gigglestorm at your shorts. Everyone hates you. Why you? Why me? Why are they doing this? Why oh why did my mom forget to lay out my trousers this morning. Stupid mom. And then it stops. Then you wake up. Everything is a-okay, good, all clear, right on. You're in your nice warm bed, and your clothes, and yes, even your trousers are arranged nicely and warmed up by your dear loving mother. You smell a delicious breakfast banquet wafting into your room from the kitchen. You'll leave the house fully dressed no doubt, and make it through the day with all of your classmate friends, buds, and pals too. After class maybe you'll walk home with some friends of yours by the side of the river, and they'll all compliment your style of trousers and undergarments, and cool japanese gadget attachments all over your overcoat. As the sun starts to set and you all part ways, heading home and waving goodbye and looking forward to another formative day in high school, as you walk home there's no longer a trace of that bad dream you had earlier.\n\nWell for me this is no silly dream. This was no \"night terror\" that I could simply have just \"waited out\" and woken up from into warm blanket and a morning greeting. This was no load of bologna community college-style self help \"I'm going to wake up mid-dream and take hold of the situation\" dream diary type thing. This was my real, everyday life. I was there in class being held upside down by my classmates, totally pantsed, lobster red, whipped into a real sweat from embarassment, as all my fellow classmates and my teacher pinched and prodded my feelings into a tizzy, and dunked my head in a bucket of the brown stuff, chocolate milk.\n\nHigh school was more than a nightmare for me. I'm talking personally right now. It was something more like H-E-double hockey sticks. I was burned and seared by cool kids from the moment I stepped in the halls. Hot jocks sprayed extra-sour super blue razz Gogurt directly into my face as soon as that first bell tolled. Something was dreadfully wrong, but I was too busy getting stripped down to my skipperous pantaloons and dunked headfirst into every single toilet in a 5 mile radius to even stop and think. Welcome to my world, and boy is it a world of hurt.\n\nGood old Hilltop High, where the ruling class jocks and \"Sensi\", which is short for sensually hot girls, lord over the social toilet. You got nerds, you got your no-life cybernauts, you got your ugly wimps, you got your crud-for-brains, you got supernerds, you got zyber-lamos, you got super-duper bad-at-sports weaklings, you got weak hearted-wimplings, you got bug collector kids, you got left-over paper bag sack lunch dweebs, you have stupid kids, you have oatmeal raisin losers, you got failed goths, you got super zany troll experts, facebook commentators (\"Zuckernerds\"), facebook likers, kids who talk about how they don't have TV at home, kids who talk about how they listen to NPR at home, raised by anime, Goku freaks, lunchroom wanderers, toilet swimmers, toilet divers, kids with rashes, tween bumblerboys, trash heap garbage kids, prom clowns, prom jesters, lunchroom floor dweebs, snot nosed idiots, scoundrel humble-beggars, pump-happy iron pounders, rump-slumping bumblebabies, badly-dressed geektards, gothic style proto Invader Zim trolls, classroom masturbators, classroom chameleons, California Raisins fans, raised-by-tumblr kids, pantsless fools, and the list goes on and on. And guess what? I literally fit into every category.\n\nYou can imagine what was going on, they were bonking me in the head pretty much from bell to bell. I got the bell to bell treatment. In the eyes of the social upper class at Hilltop High, I am the most undesirable and lame person to ever step foot in these halls. Even all the teachers, instructors, advisers, lunch ladies, janitors, disciplinary counselors, and coaches can't hide their outright hatred of me. That's how bad it was. There are numerous examples of this, but just to set the stage here one time, I was in homeroom and the teacher Mr. Jacket was announcing our grades for our classes, and when it came to be my turn, Mr. Jacket had me stand in the front of the classroom and proceeded to tell me he was shocked I had actually passed a class! He was actually proud of me for once, and maybe things were finally turning around for ol sam, academically speaking that is. A spark of joy appeared on my face, and that was his signal. He punched me directly in the solar plexus and shrieked at the top of his lungs that I had failed, obviously, and took my grade sheet, crumpled it up, and made me eat it. This is a true story. Oh brother! With all the wind knocked out of me and a big paper ball in my mouth, all I could do was loudly and pathetically groan in front of my dearest classmates, who, by the way, were all busy uploading photos of my embarassing public failure to every social media site possible and laughing mercilessly. Traumatic, right?\nI had no idea what I had done to make them all hate me so much, but they clearly did. I guess it's pretty clear from that story that I didn't have the best of grades either. I don't really want to talk about it, but I'd say it's a little bit more than that. I mean I didn't even know how to frickin read until I was 15! I was that stupid. The trauma associated with seeing words on pages or anything else created a mental block that made reading super hard. I only eventually learned the skill of reading from comparing the lyrics I had heard out loud in the songs to the words in the liner notes of all my Marilyn Manson albums, and from the word puzzles and fun games on the back of cereal boxes. And also my dad's yellow pages that he left all over the house. Gotta love dad and his yellow pages. Good thing ol dad collected those yellow pages. In school, though everyone noticed how weird and melodramatic and also incorrect my grammar was, I got pounded even more. I recall a particularly dark moment when I was in english 101 class, which I failed and had to redo, and the teacher Mrs. Tants said it was my turn to read aloud from the text book. It was really lame and boring basic english stuff that I didn't even understand anyway. You know, textbook stuff. So's I thought I might spice things up a little bit and that would be cool, and my classmates would think it was awesome and cool if I added my own \"spin\" to some of the writing. So I added words like \"Gilgamesh\" and \"black steel rimmed helm\" \"Lucifer X\" and \"two-handed crimson broadsword\". To my surprise, everyone burst out laughing at me! I got seriously pantsed that day by everyone in the classroom including the security guards. I have no idea what I did wrong. I thought, \"maybe it was all their faults. They just didn't realize how cool the words were that I was using. Yeah that's it! Right over their heads!\" But I was starting to realize that maybe I was missing something, other than my pants for once. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "50p8ti", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "How I Survived High School pt. 1 (transcribed from terrible audio)", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 29, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 15, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_50p8ti", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1472789130.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/", "author_flair_text": "nonjelqable flatland", "quarantine": false, "author": "MortimerMcMire", "created_utc": 1472760330.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.95, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 29}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d76ic7h", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gothgirl420666", "can_mod_post": false, "ups": 1, "parent_id": "t1_d75ucl6", "score": 1, "approved_by": null, "downs": 0, "body": "god why is this so relatable? i really sucked as a human in high school", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;god why is this so relatable? i really sucked as a human in high school&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d76ic7h/", "subreddit_type": "public", "name": "t1_d76ic7h", "created": 1472830828.0, "author_flair_text": null, "created_utc": 1472802028.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d75ucl6", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MortimerMcMire", "can_mod_post": false, "ups": 11, "parent_id": "t3_50p8ti", "score": 11, "approved_by": null, "downs": 0, "body": "Speaking of my pants, I guess I should mention my looks and the way I dress. Well suffice it to say, I looked like a total freak! I looked like 80 different social outcasts, each with their own unique clown uniform vying for control over my daily clothes and style. Since I was so socially unconscious and unaware, I wore army green combat boots with huge extended tongue flaps and four inch modded maxed out metal spike attachments randomly affixed around them, combined with full heavy cloak style camouflage fatigues and a huge custom chrome armor gauntlet on one day, and a holographic gangster Tiny Toons t-shirt, blue tarp cut into a rudimentary form of pants on another day. My dad was an employee for the city as a garbage man, so whenever he got off work he let me dig through his haul for the day to see if there was anything that tickled my fancy or floated my boat, usually clothes, so I built an extensive collection that way. No matter how hard I tried, though my outfits never impressed the way I imagined as I put together my getups, try as you may that garbage smell is hard to get out of my custom Yama Yugi Yugioh printed crop-top drop-crotch bundled pantsuit. It just wasn't the same when it was covered in unwashable lasagna stains. My mother was a housewife with little to do except watch a whole shitload of TV, organize and arrange my dad's yellow pages archives, and clean the house, so she gave me lots of cool fashion tips and helped me mend together all of my dad's junk and also trash he got for me.\n\nSo my weekends in high school were typically broken down like this: Friday I come rushing home after school and my dad would take his industrial garbage washing hose and spray me down in the front yard to get all the Gogurt and mayonnaise and all the other heavy creams and sauces my classmates and teachers doused me with in school hours. Of course I would lie and tell dad that I was a messy eater, whoops, or that today was food fight day, dad, I didn't get bullied, it was just food fight day at school. And he would just shake his head and spray away. And then I would go inside and pretend to do my homework. The process of pretending to do my homework or late work or makeup work ended up taking much more time and effort than actually just doing it in the first place. I would go into my room and I would put up my Scooby Doo \"Do not disturb\" poster on my door so my mom wouldn't bother me, and I would put on study music, which was actually part of a playlist of low quality mp3 files downloaded off of Limewire from searching \"classical music songs\". I would do this to cover up the sound of what I was really doing, which was strictly regimented daily jelqing to increase the size of my member.\n\nJelqing is an ancient language word for \"milk growth\", and is a secret stretching strengthening tactic I discovered through Deep web bodygod tips and tricks and muscle schlock shock jock boards. It's a very painful and loud process, especially at the super small size that I was starting at. In order to begin the jelqing process, I had to lay face up on the floor and turn off all the lights. Then I would undress. Then comes the stretching. Just like stretching anything else, except on a near microscopic level. I remember in the early days of jelqing I would have to bite down on a big pink eraser so as to hold back the screams and manage the pain of it. I got used to it after a while though, and now I was an advanced jelq artist by my senior year. I always made sure to be extra careful however because I had read a thread on a website when I first started jelqing that the super jelqer named Hypnoman jelqed himself past the critical zone and edged off the brink and it caused severe lacerations and varying other degrees of damages. He posted later on about the jelqing arts and how it ruined his life and how he was now entirely without a P-zone, and had a totally non jelqable flatland at that point.\n\nAfter the milking process was complete, I would come out of my room and tell my mom how I think I was getting better at homework and school and that all my teachers were saying they saw a major improvement in me. Big lie. Mom would congratulate me and give me a lot of sweet candy and treats, which was a problem because at this point I was starting to pack on the weight, and I ate the candy as intense afterheat subsided in the jelqing regions. We would then sit together, me and my mom, in front of the big screen TV and have TV time by watching the big screen TV with my mom. Sometimes during TV time my dad would come in and drop majorly large loads of garbage and trash for my mom and I to sort through while we watched TV on the big screen. Then we would all gather around the table in the kitchen for dinner and ate the usual round of clams with heavy sauce, my favorite meal: clams with heavy sauce. My mom would lead us in saying grace and when our heads were lowered I would always secretly ask God (G-O-D) if they would increase the size of my private zone with my jelqing regime to 18 inches and also if they could also make me an all powerful sexual master who had sex with any girl I wanted and increase the amount of party hats I had in my bank account on Runescape so I could be a legendary gamer fiend and beat up anyone I wanted.\n\nSaturday was my only solace. Sunday I had to go see my private tutor, who I hated, so I basically counted Sunday as a school day too. I learned to make the most of every Saturday. I would set my alarm Friday night to 5 am, wake up, and secretly leave the house after a smaller jelqing/edging period. This was the only time of day of any day of the week that I felt vaguely good. In the early morning light and fog I felt hidden and safe. I felt like Count Vampire or a secret agent that no one could see, and I could safely do my work. You see, I only had one thing going for me, but it was my only hope. On my 16th birthday my dad got me a soiled and hardly operational leather exterior Geo Metro starter car, which he picked up from the junk yard. For the first couple of months, I drove it to school, but shortly after the school's street racing and drifting club figured out it was my car. They broke into it while I was in home room and dumped in it and removed all functional vital parts for it to work. That's how I had to push it all the way home as they drove around in circles and whipped me from out the windows. After that day I kept it in my dad's shed and on Saturday mornings a special time would come and I would work on it from scratch rebuilding it. Any and all parts I could salvage from the heaps of car parts my dad would bring home I would look up on a secret Korean language website deep web DIY custom street racing car forum that I ran through a translator and modded on my car and eventually formed a trash heap amalgamation that vaguely resembled a 14 year old deviantart upload manga style drawing of a human-car hybrid. It still didn't run of course but some day it will and it will seriously blow away all of my friends at school and also all the bullies or anyone who was mean to me and they will all like me and I will do a big burnout in the baseball field and zoom off and look real cool because the turf in the field will have erupted into flames and the coach who was always mean to me will get burned really badly. And I will hit a home run and my car will be super fast. Then the whole school will try to street race me with their lesser cars and I will cause them all to spin out from bewilderment and smoke screen confusion and all the roads will be mine.\n\n\"Racer Boy\" is what they'll call me. They won't ever call me \"Dog breath\" or \"Hotheaded weiner\" ever again. \"Racer Boy\" will get all the girls and \"Racer Boy\" will show no mercy to those who treated him like a half-slug half-idiot in his past life. \"Racer Boy\". Spending weeknights speeding along the coast, wheel in hand, girl in arm, big cigar on my lip, pedal to the metal, doing an 80 foot launch plus 27 full rotation front flip off the cliffside. As I polished the front end of the car to shine up the bright orange skirtless Goku decal I was totally lost in my own world. This was when I was truly happy. Whims of fancy and fantasy tickled my imagination and wisps of hopefully joy abound as I was lost in Goku's eyes (that's what I named the car). I winked at the car and let out a lot of hot gas really loudly. That was usually it for my saturday morning garage work and it lasted a long time. As soon as the sun would rise, no one could know about my work in the garage, so I threw a tarp over the car and blew a single kiss to it as I closed the door. There behind that door lay my one golden ticket to get out of this place.\n\n", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Speaking of my pants, I guess I should mention my looks and the way I dress. Well suffice it to say, I looked like a total freak! I looked like 80 different social outcasts, each with their own unique clown uniform vying for control over my daily clothes and style. Since I was so socially unconscious and unaware, I wore army green combat boots with huge extended tongue flaps and four inch modded maxed out metal spike attachments randomly affixed around them, combined with full heavy cloak style camouflage fatigues and a huge custom chrome armor gauntlet on one day, and a holographic gangster Tiny Toons t-shirt, blue tarp cut into a rudimentary form of pants on another day. My dad was an employee for the city as a garbage man, so whenever he got off work he let me dig through his haul for the day to see if there was anything that tickled my fancy or floated my boat, usually clothes, so I built an extensive collection that way. No matter how hard I tried, though my outfits never impressed the way I imagined as I put together my getups, try as you may that garbage smell is hard to get out of my custom Yama Yugi Yugioh printed crop-top drop-crotch bundled pantsuit. It just wasn&amp;#39;t the same when it was covered in unwashable lasagna stains. My mother was a housewife with little to do except watch a whole shitload of TV, organize and arrange my dad&amp;#39;s yellow pages archives, and clean the house, so she gave me lots of cool fashion tips and helped me mend together all of my dad&amp;#39;s junk and also trash he got for me.&lt;/p&gt;\n\n&lt;p&gt;So my weekends in high school were typically broken down like this: Friday I come rushing home after school and my dad would take his industrial garbage washing hose and spray me down in the front yard to get all the Gogurt and mayonnaise and all the other heavy creams and sauces my classmates and teachers doused me with in school hours. Of course I would lie and tell dad that I was a messy eater, whoops, or that today was food fight day, dad, I didn&amp;#39;t get bullied, it was just food fight day at school. And he would just shake his head and spray away. And then I would go inside and pretend to do my homework. The process of pretending to do my homework or late work or makeup work ended up taking much more time and effort than actually just doing it in the first place. I would go into my room and I would put up my Scooby Doo &amp;quot;Do not disturb&amp;quot; poster on my door so my mom wouldn&amp;#39;t bother me, and I would put on study music, which was actually part of a playlist of low quality mp3 files downloaded off of Limewire from searching &amp;quot;classical music songs&amp;quot;. I would do this to cover up the sound of what I was really doing, which was strictly regimented daily jelqing to increase the size of my member.&lt;/p&gt;\n\n&lt;p&gt;Jelqing is an ancient language word for &amp;quot;milk growth&amp;quot;, and is a secret stretching strengthening tactic I discovered through Deep web bodygod tips and tricks and muscle schlock shock jock boards. It&amp;#39;s a very painful and loud process, especially at the super small size that I was starting at. In order to begin the jelqing process, I had to lay face up on the floor and turn off all the lights. Then I would undress. Then comes the stretching. Just like stretching anything else, except on a near microscopic level. I remember in the early days of jelqing I would have to bite down on a big pink eraser so as to hold back the screams and manage the pain of it. I got used to it after a while though, and now I was an advanced jelq artist by my senior year. I always made sure to be extra careful however because I had read a thread on a website when I first started jelqing that the super jelqer named Hypnoman jelqed himself past the critical zone and edged off the brink and it caused severe lacerations and varying other degrees of damages. He posted later on about the jelqing arts and how it ruined his life and how he was now entirely without a P-zone, and had a totally non jelqable flatland at that point.&lt;/p&gt;\n\n&lt;p&gt;After the milking process was complete, I would come out of my room and tell my mom how I think I was getting better at homework and school and that all my teachers were saying they saw a major improvement in me. Big lie. Mom would congratulate me and give me a lot of sweet candy and treats, which was a problem because at this point I was starting to pack on the weight, and I ate the candy as intense afterheat subsided in the jelqing regions. We would then sit together, me and my mom, in front of the big screen TV and have TV time by watching the big screen TV with my mom. Sometimes during TV time my dad would come in and drop majorly large loads of garbage and trash for my mom and I to sort through while we watched TV on the big screen. Then we would all gather around the table in the kitchen for dinner and ate the usual round of clams with heavy sauce, my favorite meal: clams with heavy sauce. My mom would lead us in saying grace and when our heads were lowered I would always secretly ask God (G-O-D) if they would increase the size of my private zone with my jelqing regime to 18 inches and also if they could also make me an all powerful sexual master who had sex with any girl I wanted and increase the amount of party hats I had in my bank account on Runescape so I could be a legendary gamer fiend and beat up anyone I wanted.&lt;/p&gt;\n\n&lt;p&gt;Saturday was my only solace. Sunday I had to go see my private tutor, who I hated, so I basically counted Sunday as a school day too. I learned to make the most of every Saturday. I would set my alarm Friday night to 5 am, wake up, and secretly leave the house after a smaller jelqing/edging period. This was the only time of day of any day of the week that I felt vaguely good. In the early morning light and fog I felt hidden and safe. I felt like Count Vampire or a secret agent that no one could see, and I could safely do my work. You see, I only had one thing going for me, but it was my only hope. On my 16th birthday my dad got me a soiled and hardly operational leather exterior Geo Metro starter car, which he picked up from the junk yard. For the first couple of months, I drove it to school, but shortly after the school&amp;#39;s street racing and drifting club figured out it was my car. They broke into it while I was in home room and dumped in it and removed all functional vital parts for it to work. That&amp;#39;s how I had to push it all the way home as they drove around in circles and whipped me from out the windows. After that day I kept it in my dad&amp;#39;s shed and on Saturday mornings a special time would come and I would work on it from scratch rebuilding it. Any and all parts I could salvage from the heaps of car parts my dad would bring home I would look up on a secret Korean language website deep web DIY custom street racing car forum that I ran through a translator and modded on my car and eventually formed a trash heap amalgamation that vaguely resembled a 14 year old deviantart upload manga style drawing of a human-car hybrid. It still didn&amp;#39;t run of course but some day it will and it will seriously blow away all of my friends at school and also all the bullies or anyone who was mean to me and they will all like me and I will do a big burnout in the baseball field and zoom off and look real cool because the turf in the field will have erupted into flames and the coach who was always mean to me will get burned really badly. And I will hit a home run and my car will be super fast. Then the whole school will try to street race me with their lesser cars and I will cause them all to spin out from bewilderment and smoke screen confusion and all the roads will be mine.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Racer Boy&amp;quot; is what they&amp;#39;ll call me. They won&amp;#39;t ever call me &amp;quot;Dog breath&amp;quot; or &amp;quot;Hotheaded weiner&amp;quot; ever again. &amp;quot;Racer Boy&amp;quot; will get all the girls and &amp;quot;Racer Boy&amp;quot; will show no mercy to those who treated him like a half-slug half-idiot in his past life. &amp;quot;Racer Boy&amp;quot;. Spending weeknights speeding along the coast, wheel in hand, girl in arm, big cigar on my lip, pedal to the metal, doing an 80 foot launch plus 27 full rotation front flip off the cliffside. As I polished the front end of the car to shine up the bright orange skirtless Goku decal I was totally lost in my own world. This was when I was truly happy. Whims of fancy and fantasy tickled my imagination and wisps of hopefully joy abound as I was lost in Goku&amp;#39;s eyes (that&amp;#39;s what I named the car). I winked at the car and let out a lot of hot gas really loudly. That was usually it for my saturday morning garage work and it lasted a long time. As soon as the sun would rise, no one could know about my work in the garage, so I threw a tarp over the car and blew a single kiss to it as I closed the door. There behind that door lay my one golden ticket to get out of this place.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d75ucl6/", "subreddit_type": "public", "name": "t1_d75ucl6", "created": 1472789150.0, "author_flair_text": "nonjelqable flatland", "created_utc": 1472760350.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d7lq4w3", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MortimerMcMire", "can_mod_post": false, "ups": 2, "parent_id": "t1_d7lkfjb", "score": 2, "approved_by": null, "downs": 0, "body": "Good work sorry about the harsh words, you did good", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good work sorry about the harsh words, you did good&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d7lq4w3/", "subreddit_type": "public", "name": "t1_d7lq4w3", "created": 1473839085.0, "author_flair_text": "nonjelqable flatland", "created_utc": 1473810285.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 6, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d7lkfjb", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Zedyy", "can_mod_post": false, "ups": 2, "parent_id": "t1_d7lgs92", "score": 2, "approved_by": null, "downs": 0, "body": "I had shit to do man ok? but I didnt forget you. I dont have much of it left.\n\nAs for proof I actually did something heres the text I typed along watching the video before any formatting. http://www.pastebin.com/u/Jasperrrrrr", "edited": 1473802401.0, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had shit to do man ok? but I didnt forget you. I dont have much of it left.&lt;/p&gt;\n\n&lt;p&gt;As for proof I actually did something heres the text I typed along watching the video before any formatting. &lt;a href=\"http://www.pastebin.com/u/Jasperrrrrr\"&gt;http://www.pastebin.com/u/Jasperrrrrr&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d7lkfjb/", "subreddit_type": "public", "name": "t1_d7lkfjb", "created": 1473830854.0, "author_flair_text": "I'm Live", "created_utc": 1473802054.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 5, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d7lgs92", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MortimerMcMire", "can_mod_post": false, "ups": 1, "parent_id": "t1_d760h1p", "score": 1, "approved_by": null, "downs": 0, "body": "well where is it faggot", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;well where is it faggot&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d7lgs92/", "subreddit_type": "public", "name": "t1_d7lgs92", "created": 1473826323.0, "author_flair_text": "nonjelqable flatland", "created_utc": 1473797523.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 4, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d760h1p", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Zedyy", "can_mod_post": false, "ups": 1, "parent_id": "t1_d75zm6r", "score": 1, "approved_by": null, "downs": 0, "body": "Alright, expect that shit sometime tomorrow. ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Alright, expect that shit sometime tomorrow. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d760h1p/", "subreddit_type": "public", "name": "t1_d760h1p", "created": 1472797777.0, "author_flair_text": "I'm Live", "created_utc": 1472768977.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d75zm6r", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MortimerMcMire", "can_mod_post": false, "ups": 2, "parent_id": "t1_d75y8p4", "score": 2, "approved_by": null, "downs": 0, "body": "https://youtu.be/qUEbUAY0hZM?t=3m18s", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://youtu.be/qUEbUAY0hZM?t=3m18s\"&gt;https://youtu.be/qUEbUAY0hZM?t=3m18s&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d75zm6r/", "subreddit_type": "public", "name": "t1_d75zm6r", "created": 1472796496.0, "author_flair_text": "nonjelqable flatland", "created_utc": 1472767696.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d75y8p4", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Zedyy", "can_mod_post": false, "ups": 2, "parent_id": "t1_d75ud4j", "score": 2, "approved_by": null, "downs": 0, "body": "what time did you end at? I can do the next part.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;what time did you end at? I can do the next part.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d75y8p4/", "subreddit_type": "public", "name": "t1_d75y8p4", "created": 1472794500.0, "author_flair_text": "I'm Live", "created_utc": 1472765700.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d75ud4j", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MortimerMcMire", "can_mod_post": false, "ups": 4, "parent_id": "t3_50p8ti", "score": 4, "approved_by": null, "downs": 0, "body": "sam please post the rest I can't do this anymore my head hurts", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;sam please post the rest I can&amp;#39;t do this anymore my head hurts&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d75ud4j/", "subreddit_type": "public", "name": "t1_d75ud4j", "created": 1472789171.0, "author_flair_text": "nonjelqable flatland", "created_utc": 1472760371.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d76a6a2", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Dream-Dad", "can_mod_post": false, "ups": 2, "parent_id": "t1_d75wtrz", "score": 2, "approved_by": null, "downs": 0, "body": "The speed and poor audio make the entire narrative seem way quicker and wilder than it really is. Your brain is going into overdrive the whole time trying to keep up and you interpret everything a half a second late, each \"joke\" hits you so quickly that you are halfway through realizing what it even was before a new one is hitting you. This also means each reading is \"replayable\", you are bound to miss so many details that on subsequent listens you'll still be getting new information, which is pretty amazing for a totally linear narrative. \n\nThe script narrations are my favorite material out of all of MDE, I cant get enough of them.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The speed and poor audio make the entire narrative seem way quicker and wilder than it really is. Your brain is going into overdrive the whole time trying to keep up and you interpret everything a half a second late, each &amp;quot;joke&amp;quot; hits you so quickly that you are halfway through realizing what it even was before a new one is hitting you. This also means each reading is &amp;quot;replayable&amp;quot;, you are bound to miss so many details that on subsequent listens you&amp;#39;ll still be getting new information, which is pretty amazing for a totally linear narrative. &lt;/p&gt;\n\n&lt;p&gt;The script narrations are my favorite material out of all of MDE, I cant get enough of them.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d76a6a2/", "subreddit_type": "public", "name": "t1_d76a6a2", "created": 1472812681.0, "author_flair_text": "take the knot", "created_utc": 1472783881.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d76oren", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "LinuxPoser", "can_mod_post": false, "ups": 1, "parent_id": "t1_d75wtrz", "score": 1, "approved_by": null, "downs": 0, "body": "I actually hear the whole thing in Sam's voice in my head.\n\nSame inflections and everything.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually hear the whole thing in Sam&amp;#39;s voice in my head.&lt;/p&gt;\n\n&lt;p&gt;Same inflections and everything.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d76oren/", "subreddit_type": "public", "name": "t1_d76oren", "created": 1472850110.0, "author_flair_text": null, "created_utc": 1472821310.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d75wtrz", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 2, "parent_id": "t3_50p8ti", "score": 2, "approved_by": null, "downs": 0, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "collapsed": true, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d75wtrz/", "subreddit_type": "public", "name": "t1_d75wtrz", "created": 1472792441.0, "author_flair_text": null, "created_utc": 1472763641.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d76do0w", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Zedyy", "can_mod_post": false, "ups": 2, "parent_id": "t1_d76bo4l", "score": 2, "approved_by": null, "downs": 0, "body": "You should check out My Illuminati Story and Billy The Clown.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should check out My Illuminati Story and Billy The Clown.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d76do0w/", "subreddit_type": "public", "name": "t1_d76do0w", "created": 1472818721.0, "author_flair_text": "I'm Live", "created_utc": 1472789921.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d76bo4l", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "trash_dad", "can_mod_post": false, "ups": 2, "parent_id": "t3_50p8ti", "score": 2, "approved_by": null, "downs": 0, "body": "My favorite MDE has always been Sam's long rants, this and the rutgers speech are fantastic. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My favorite MDE has always been Sam&amp;#39;s long rants, this and the rutgers speech are fantastic. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d76bo4l/", "subreddit_type": "public", "name": "t1_d76bo4l", "created": 1472815057.0, "author_flair_text": null, "created_utc": 1472786257.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d75x0o8", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "PunchingArianaGrande", "can_mod_post": false, "ups": 1, "parent_id": "t3_50p8ti", "score": 1, "approved_by": null, "downs": 0, "body": "Time to watch this again\n\nGood work OP, thanks", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Time to watch this again&lt;/p&gt;\n\n&lt;p&gt;Good work OP, thanks&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d75x0o8/", "subreddit_type": "public", "name": "t1_d75x0o8", "created": 1472792704.0, "author_flair_text": "Aspiring filmmaker. Aspiring artist. Aspiring food geek. Aspirin", "created_utc": 1472763904.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50p8ti", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d768h1f", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "SubatomicChampion", "can_mod_post": false, "ups": 1, "parent_id": "t3_50p8ti", "score": 1, "approved_by": null, "downs": 0, "body": "Nice work, good look when the double audio kicks in though lololol", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice work, good look when the double audio kicks in though lololol&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50p8ti/how_i_survived_high_school_pt_1_transcribed_from/d768h1f/", "subreddit_type": "public", "name": "t1_d768h1f", "created": 1472810020.0, "author_flair_text": "Stone Cold Diesel Beast", "created_utc": 1472781220.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]