[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I became aware of Sam&amp;#39;s comedy back when I was at Carnegie Mellon around 2006 or so. I was an immediate fan and, although I never knew Sam personally (though I have a distinct memory of walking by him, as he is super tall and sticks out and was wearing a ridiculous Desert Storm tee), I would check out his website (filled with insane fake car graphic style art) and the quicktime videos of his comedy bits he would upload. I continued following him from the early youtube videos (Dracula Rap, Gra-go-tion, World&amp;#39;s Most Comfortable Man), through the vertical videos and now to this most recent developments on Adult Swim. It has been bizarre seeing something I at one time considered one of the most unique and boundary pushing comedy entities become so consumed by overt hatefulness and corrosive cynicism. &lt;/p&gt;\n\n&lt;p&gt;There was never any one incident that made me change my mind, but rather the accumulation of attitudes and behaviors that just became inseparable from the actual content itself (not to mention later coming across Sam&amp;#39;s old posts with his half-cocked thoughts on immigration, women and white identity politics). At this point, its hard to see the cancellation as anything but inevitable. Sam relied on his fanbase being an independent creator, and courting a fanbase mostly through social media that also has a propensity to lash out and who attempt to squash any hint of sincerity is a recipe for blowing up in your face. Being reactionary online by design gets more hits, and if you rely on this fanbase to support your work and pay your rent, being more reactionary guarantees more hits and more amplification; until it doesnt. An audience that will turn on you if you dont tow the party line simply just isnt going to be tolerated in a professional setting, and hinting at beliefs in racial and gender-based hierarchy is just not going to fly at any place of business. You cant work with someone else if they inherently see you as an &amp;quot;other&amp;quot; that exists on a scale in relationship to them. &lt;/p&gt;\n\n&lt;p&gt;Somewhere along the line, Sam&amp;#39;s (understandble) frustrations crystalized into an inward looking mentality of extremism. The pizzagate obsession only drove this point home further. Sam doesnt care about pedophilia or missing children, he just wanted to play an alternate reality game in an attempt to get moral high ground over &amp;quot;liberals&amp;quot; and as a way of dissmissing the actual sexual assault allegations of pussygate. If Sam gave a shit about missing children, maybe he would actually donate or volunteer or actually help with the campaign surrounding a legitimately missing or kidnapped kid. But that would require actual sincerity or caring about someone other than yourself. And when it all inevitably did boil over into a gunman walking in, Sam and the Free Speech Jihadists can wipe their hands clean of any responsibility or self-reflection because &amp;quot;its just words&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Hearing him and Tim go back and forth on Tim&amp;#39;s podcast really put the nail in the coffin on all this. His criticisms of Gelman were that his comedy was &amp;quot;weird&amp;quot; and &amp;quot;uncomfortable&amp;quot;. Isnt that what MDE is in part about? Isnt that what any good boundary pushing or experimental comedy should be? I always liked when MDE made me uncomfortable and evaluate my position on things, but if you&amp;#39;re just waging a war of ideology that nukes your options for career support in the future, youre not even an artist anymore, youre just a demagogue and a radical. Once youve lost any room for interpretation or nuance, youre not even working in the long tradition of irony or comedy any more; its pure cynicism that sees any sort of compromising as an attack on your authenticity. The show kind of had to blow up for this reason, as any sort of diminishment of Sam&amp;#39;s outsider/anarchic personality would be seen as a diminishment to his entire image of self after tying himself to the preservation and fortifying of a white/masculine identity and the demands of your audience. In fact, the cancellation only serves to REINFORCE that outsider/anarchic mentality, and maybe is the only logical outcome to this world view in the end.&lt;/p&gt;\n\n&lt;p&gt;Ultimately, this is all kinda just too bad/so sad, as it seems like the only place for MDE to go is further inward towards self-destruction, or at the very least an insane narrowing of creative options for them to try out or new support to find. The professional victimhood Sam has adopted in not seeing his role in things (at least not publicly in any discernable way) is just a total bummer. Left/right whatever politics can find a way to work with each other (and the exec that said they wanted to give a more right wing view a chance shows they were open to it and knew what it was going in), but extremists can only ultimately work with themselves. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I became aware of Sam's comedy back when I was at Carnegie Mellon around 2006 or so. I was an immediate fan and, although I never knew Sam personally (though I have a distinct memory of walking by him, as he is super tall and sticks out and was wearing a ridiculous Desert Storm tee), I would check out his website (filled with insane fake car graphic style art) and the quicktime videos of his comedy bits he would upload. I continued following him from the early youtube videos (Dracula Rap, Gra-go-tion, World's Most Comfortable Man), through the vertical videos and now to this most recent developments on Adult Swim. It has been bizarre seeing something I at one time considered one of the most unique and boundary pushing comedy entities become so consumed by overt hatefulness and corrosive cynicism. \n\nThere was never any one incident that made me change my mind, but rather the accumulation of attitudes and behaviors that just became inseparable from the actual content itself (not to mention later coming across Sam's old posts with his half-cocked thoughts on immigration, women and white identity politics). At this point, its hard to see the cancellation as anything but inevitable. Sam relied on his fanbase being an independent creator, and courting a fanbase mostly through social media that also has a propensity to lash out and who attempt to squash any hint of sincerity is a recipe for blowing up in your face. Being reactionary online by design gets more hits, and if you rely on this fanbase to support your work and pay your rent, being more reactionary guarantees more hits and more amplification; until it doesnt. An audience that will turn on you if you dont tow the party line simply just isnt going to be tolerated in a professional setting, and hinting at beliefs in racial and gender-based hierarchy is just not going to fly at any place of business. You cant work with someone else if they inherently see you as an \"other\" that exists on a scale in relationship to them. \n\nSomewhere along the line, Sam's (understandble) frustrations crystalized into an inward looking mentality of extremism. The pizzagate obsession only drove this point home further. Sam doesnt care about pedophilia or missing children, he just wanted to play an alternate reality game in an attempt to get moral high ground over \"liberals\" and as a way of dissmissing the actual sexual assault allegations of pussygate. If Sam gave a shit about missing children, maybe he would actually donate or volunteer or actually help with the campaign surrounding a legitimately missing or kidnapped kid. But that would require actual sincerity or caring about someone other than yourself. And when it all inevitably did boil over into a gunman walking in, Sam and the Free Speech Jihadists can wipe their hands clean of any responsibility or self-reflection because \"its just words\". \n\nHearing him and Tim go back and forth on Tim's podcast really put the nail in the coffin on all this. His criticisms of Gelman were that his comedy was \"weird\" and \"uncomfortable\". Isnt that what MDE is in part about? Isnt that what any good boundary pushing or experimental comedy should be? I always liked when MDE made me uncomfortable and evaluate my position on things, but if you're just waging a war of ideology that nukes your options for career support in the future, youre not even an artist anymore, youre just a demagogue and a radical. Once youve lost any room for interpretation or nuance, youre not even working in the long tradition of irony or comedy any more; its pure cynicism that sees any sort of compromising as an attack on your authenticity. The show kind of had to blow up for this reason, as any sort of diminishment of Sam's outsider/anarchic personality would be seen as a diminishment to his entire image of self after tying himself to the preservation and fortifying of a white/masculine identity and the demands of your audience. In fact, the cancellation only serves to REINFORCE that outsider/anarchic mentality, and maybe is the only logical outcome to this world view in the end.\n\nUltimately, this is all kinda just too bad/so sad, as it seems like the only place for MDE to go is further inward towards self-destruction, or at the very least an insane narrowing of creative options for them to try out or new support to find. The professional victimhood Sam has adopted in not seeing his role in things (at least not publicly in any discernable way) is just a total bummer. Left/right whatever politics can find a way to work with each other (and the exec that said they wanted to give a more right wing view a chance shows they were open to it and knew what it was going in), but extremists can only ultimately work with themselves. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "5ha2gu", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "Thots after having been a 10+ year fan of MDE", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 9, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 21, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_5ha2gu", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1481265424.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/", "author_flair_text": null, "quarantine": false, "author": "MrDrPeepsi", "created_utc": 1481236624.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.57, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5ha2gu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "daynly9", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "SaintNicolaos", "can_mod_post": false, "ups": 16, "parent_id": "t3_5ha2gu", "score": 16, "approved_by": null, "downs": 0, "body": "You already had your mind made up about Sam a long time ago, don't act like you've just been waiting to decide how you felt about him. You probably disagreed with him on something and never got over it. \n\n&gt;Hearing him and Tim go back and forth on Tim's podcast really put the nail in the coffin on all this. His criticisms of Gelman were that his comedy was \"weird\" and \"uncomfortable\". Isnt that what MDE is in part about?\n\nThis is what nailed the coffin in? Well, you interpreted it completely wrong. Gelman is \"weird\" and \"uncomfortable\" to watch because he is bad at acting and writing comedy so the final piece did not come out right. Sam brings out those qualities on purpose, but Gelman brings out a different weirdness that comes from him not being that funny or good at what he does. \n\nStop writing walls of text because people aren't going to withstand your generic opinions for that long.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You already had your mind made up about Sam a long time ago, don&amp;#39;t act like you&amp;#39;ve just been waiting to decide how you felt about him. You probably disagreed with him on something and never got over it. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Hearing him and Tim go back and forth on Tim&amp;#39;s podcast really put the nail in the coffin on all this. His criticisms of Gelman were that his comedy was &amp;quot;weird&amp;quot; and &amp;quot;uncomfortable&amp;quot;. Isnt that what MDE is in part about?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is what nailed the coffin in? Well, you interpreted it completely wrong. Gelman is &amp;quot;weird&amp;quot; and &amp;quot;uncomfortable&amp;quot; to watch because he is bad at acting and writing comedy so the final piece did not come out right. Sam brings out those qualities on purpose, but Gelman brings out a different weirdness that comes from him not being that funny or good at what he does. &lt;/p&gt;\n\n&lt;p&gt;Stop writing walls of text because people aren&amp;#39;t going to withstand your generic opinions for that long.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/daynly9/", "subreddit_type": "public", "name": "t1_daynly9", "created": 1481269660.0, "author_flair_text": "Penchant for anti-humor, racism and homophobia", "created_utc": 1481240860.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5ha2gu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5ha2gu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5ha2gu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "daz5fxt", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "thefagnigger", "can_mod_post": false, "ups": 4, "parent_id": "t1_daz00az", "score": 4, "approved_by": null, "downs": 0, "body": "look im not gonna get into this with you because you're a steely dan fan and steely dan is my religion, consider yourself lucky, bub.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;look im not gonna get into this with you because you&amp;#39;re a steely dan fan and steely dan is my religion, consider yourself lucky, bub.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/daz5fxt/", "subreddit_type": "public", "name": "t1_daz5fxt", "created": 1481297466.0, "author_flair_text": "old", "created_utc": 1481268666.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "daz00az", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "babylonsisters", "can_mod_post": false, "ups": 5, "parent_id": "t1_daynrug", "score": 5, "approved_by": null, "downs": 0, "body": "Okay, but what did you refute about what he said?", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, but what did you refute about what he said?&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/daz00az/", "subreddit_type": "public", "name": "t1_daz00az", "created": 1481286815.0, "author_flair_text": "Tace", "created_utc": 1481258015.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "daynrug", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "thefagnigger", "can_mod_post": false, "ups": 12, "parent_id": "t3_5ha2gu", "score": 12, "approved_by": null, "downs": 0, "body": "Two things, faggot:\n\n1. Trump won, get over it. Say a prayer to Satan to help you come to terms with this if you need to.\n\n2. You're a huge faggot.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Two things, faggot:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Trump won, get over it. Say a prayer to Satan to help you come to terms with this if you need to.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;You&amp;#39;re a huge faggot.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/daynrug/", "subreddit_type": "public", "name": "t1_daynrug", "created": 1481269887.0, "author_flair_text": "old", "created_utc": 1481241087.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5ha2gu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dayoapp", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Graugluck", "can_mod_post": false, "ups": 9, "parent_id": "t3_5ha2gu", "score": 9, "approved_by": null, "downs": 0, "body": "Sam put up $5,000 to this thing called wesearchr for anyone who could find incriminating evidence with regards to pizzagate. He's done more for it than you have.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sam put up $5,000 to this thing called wesearchr for anyone who could find incriminating evidence with regards to pizzagate. He&amp;#39;s done more for it than you have.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/dayoapp/", "subreddit_type": "public", "name": "t1_dayoapp", "created": 1481270613.0, "author_flair_text": "peaceful nuclear explosion", "created_utc": 1481241813.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5ha2gu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "daz1v0g", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 8, "parent_id": "t3_5ha2gu", "score": 8, "approved_by": null, "downs": 0, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "collapsed": true, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/daz1v0g/", "subreddit_type": "public", "name": "t1_daz1v0g", "created": 1481289792.0, "author_flair_text": null, "created_utc": 1481260992.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5ha2gu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "daysf4d", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Stress90", "can_mod_post": false, "ups": 6, "parent_id": "t3_5ha2gu", "score": 6, "approved_by": null, "downs": 0, "body": "lmao did you seriously just use the term \"free speech jihadist\"\n\nkys faggot", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lmao did you seriously just use the term &amp;quot;free speech jihadist&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;kys faggot&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/daysf4d/", "subreddit_type": "public", "name": "t1_daysf4d", "created": 1481276309.0, "author_flair_text": null, "created_utc": 1481247509.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5ha2gu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "daymnx1", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 4, "parent_id": "t3_5ha2gu", "score": 4, "approved_by": null, "downs": 0, "body": "you're lying lol", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you&amp;#39;re lying lol&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/daymnx1/", "subreddit_type": "public", "name": "t1_daymnx1", "created": 1481268376.0, "author_flair_text": null, "created_utc": 1481239576.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5ha2gu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5ha2gu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dayy5n3", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "skpyvc", "can_mod_post": false, "ups": 4, "parent_id": "t1_daypqpn", "score": 4, "approved_by": null, "downs": 0, "body": "you like taking it in the **ass**, huh, *big guy*", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you like taking it in the &lt;strong&gt;ass&lt;/strong&gt;, huh, &lt;em&gt;big guy&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/dayy5n3/", "subreddit_type": "public", "name": "t1_dayy5n3", "created": 1481284056.0, "author_flair_text": "SUBVERT", "created_utc": 1481255256.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "daypqpn", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "big_guyforu", "can_mod_post": false, "ups": 5, "parent_id": "t3_5ha2gu", "score": 5, "approved_by": null, "downs": 0, "body": "You probably won't get any decent responses from the reactionary spergs, but I thought this was a pretty good, honest post and I fully agree with all of your points. I'm still a big fan though and will continue to support Sam in his endeavors though.\n\nHe shouldn't fan the flames and the fact that the reactionary /pol/eddit have hassled people was truly the nail in the coffin imo. As you said, it would have been smart to relax, and keep your head down while the show aired. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You probably won&amp;#39;t get any decent responses from the reactionary spergs, but I thought this was a pretty good, honest post and I fully agree with all of your points. I&amp;#39;m still a big fan though and will continue to support Sam in his endeavors though.&lt;/p&gt;\n\n&lt;p&gt;He shouldn&amp;#39;t fan the flames and the fact that the reactionary /pol/eddit have hassled people was truly the nail in the coffin imo. As you said, it would have been smart to relax, and keep your head down while the show aired. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/daypqpn/", "subreddit_type": "public", "name": "t1_daypqpn", "created": 1481272622.0, "author_flair_text": null, "created_utc": 1481243822.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 1, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5ha2gu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "daz8m6f", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t3_5ha2gu", "score": 1, "approved_by": null, "downs": 0, "body": "Cool. This is cool", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cool. This is cool&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/daz8m6f/", "subreddit_type": "public", "name": "t1_daz8m6f", "created": 1481306811.0, "author_flair_text": null, "created_utc": 1481278011.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5ha2gu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dazjyfz", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "TheTruthItsOutThere", "can_mod_post": false, "ups": 1, "parent_id": "t3_5ha2gu", "score": 1, "approved_by": null, "downs": 0, "body": "Wow a wall of text.\n\nWhat happened was MDE showed us who we are not allowed to mock or offend, who has power. That's what went down.\n\"Extremists can only ultimately work with themselves,\" indeed.\n\nAS proved that MDE has something to say.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow a wall of text.&lt;/p&gt;\n\n&lt;p&gt;What happened was MDE showed us who we are not allowed to mock or offend, who has power. That&amp;#39;s what went down.\n&amp;quot;Extremists can only ultimately work with themselves,&amp;quot; indeed.&lt;/p&gt;\n\n&lt;p&gt;AS proved that MDE has something to say.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/dazjyfz/", "subreddit_type": "public", "name": "t1_dazjyfz", "created": 1481329049.0, "author_flair_text": null, "created_utc": 1481300249.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"body": "Yeah, I'm totally going to read this wall of text by a fresh throwaway account claiming to be a \"10+ year fan\" 😅", "subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5ha2gu", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "daz9495", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "destructuring", "can_mod_post": false, "ups": -1, "parent_id": "t3_5ha2gu", "score": -1, "approved_by": null, "downs": 0, "author_cakeday": true, "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I&amp;#39;m totally going to read this wall of text by a fresh throwaway account claiming to be a &amp;quot;10+ year fan&amp;quot; 😅&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5ha2gu/thots_after_having_been_a_10_year_fan_of_mde/daz9495/", "subreddit_type": "public", "name": "t1_daz9495", "created": 1481308470.0, "author_flair_text": "crisis actor", "created_utc": 1481279670.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]