[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s funny, and I think it&amp;#39;s kind of important.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d say what Sam Hyde does is less like Andy Kaufman and more like Lenny Bruce but not because he&amp;#39;s trying to push boundaries just because people are pussies these days and he&amp;#39;s happening to push boundaries.&lt;/p&gt;\n\n&lt;p&gt;I read an article talking about how the MDE:WP skit &amp;quot;tap water&amp;quot; and the writer was saying how it was weird that the character angrily referred to &amp;quot;taking it in the ass&amp;quot; suggesting it was homophobic. I thought &amp;quot;I&amp;#39;ve got to see this&amp;quot; and the writer took it completely out of context. &amp;quot;Taking it in the ass&amp;quot; was in reference to the government fucking the citizens over by taking their money and not providing essential services, it was actually pretty clever and a non-preachy way of talking about a pretty important issue. Not to mention it was funny. The super imposed images of gay men kissing obviously was meant to be connected to the line &amp;quot;taking it in the ass&amp;quot; but it was less homophobic than that godawful  Tim and Eric skit with the married news team where they only joke is that the actors are both dudes and they&amp;#39;re being affectionate with one another.&lt;/p&gt;\n\n&lt;p&gt;The first time I saw MDE:WP I thought it was just another random for the sake of randomness skit show thing but after checking it out after all the hubub I&amp;#39;ve realized that it&amp;#39;s actually really funny and clever and kind of artistic. &lt;em&gt;The Man Who Would Never Be... What They Made Him to Be&lt;/em&gt; was campy and shitty and seems like some low budget highschool drama shit but it was funny and clever and artistic.&lt;/p&gt;\n\n&lt;p&gt;Watching Sam Hyde read off statements and stats from gay hate websites at a Williamsburg comedy show is very much like Andy Kauffman in that it&amp;#39;s anti-humor but also very much like Lenny Bruce it&amp;#39;s testing the boundaries of free speech. And yes I know that free speech is not freedom from consequence or whatever people say to justify ruining people&amp;#39;s livelihood for saying things they don&amp;#39;t like hearing, but I think that the reality is as a society we&amp;#39;re facing the real possibility that the people are going to demand the government actually put more restrictions on speech so freedom of speech to fellow citizens really is the new battleground and people like Sam Hyde are showing us where the battle lines are drawn.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not trying to make Sam Hyde sound like a folk hero, it&amp;#39;s actually the opposite. People are just so fucking weak right now that a guy who can&amp;#39;t even get up on stage without a pile of notes and but has the balls to say all this shit himself rather than speaking through cartoon characters like Trey Parker and Matt Stone do, seems like a folk hero.&lt;/p&gt;\n\n&lt;p&gt;In the past two days I&amp;#39;ve seen Sam Hyde make fun of college kids, the military, gamers, asians, black people, jews, anti-semites, pick-up artists, the government, tech entrepreneurs, the handicapped, the entertainment industry, art, comedy, celebrities, white people, hipsters and a bunch of shit I&amp;#39;ve forgotten already.&lt;/p&gt;\n\n&lt;p&gt;I also think some of his fans are retards including some of the people in this subreddit but I don&amp;#39;t know what the fuck that has to do with him. Russle Peters isn&amp;#39;t responsible for people who only laugh at his jokes because they think indian people have funny accents (he&amp;#39;s even said he can tell if people are racist assholes by when they laugh during his stand up). &lt;/p&gt;\n\n&lt;p&gt;Million Dollar Extreme : World Peace is funny and so is Sam Hyde. I think he&amp;#39;s a soft target and that&amp;#39;s why people are going after him and MDE rather than other comedians who have done stuff that could be seen as &amp;quot;punching down&amp;quot; (and I actually think the MDE boys and Sam Hyde are a lot less mean spirited than other comedians who don&amp;#39;t get flak because people assume they&amp;#39;re on &amp;quot;their side&amp;quot; or too well established to attack).&lt;/p&gt;\n\n&lt;p&gt;Sam Hyde and MDE:WP are the canary in the coal mine as cliched as that is. It&amp;#39;s just funny and nothing they or Sam is doing is super groundbreaking or edgy other than maybe some of the cinematography and editing, it&amp;#39;s just that people are pussies and picking on an easy target.&lt;/p&gt;\n\n&lt;p&gt;Also, fuck these bands that are disavowing the show after the fact, you weak fucking losers that&amp;#39;s the least rock and roll thing I&amp;#39;ve ever heard.&lt;/p&gt;\n\n&lt;p&gt;TL;DR&lt;/p&gt;\n\n&lt;p&gt;I am a huge faggot please fuck my face.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It's funny, and I think it's kind of important.\n\nI'd say what Sam Hyde does is less like Andy Kaufman and more like Lenny Bruce but not because he's trying to push boundaries just because people are pussies these days and he's happening to push boundaries.\n\nI read an article talking about how the MDE:WP skit \"tap water\" and the writer was saying how it was weird that the character angrily referred to \"taking it in the ass\" suggesting it was homophobic. I thought \"I've got to see this\" and the writer took it completely out of context. \"Taking it in the ass\" was in reference to the government fucking the citizens over by taking their money and not providing essential services, it was actually pretty clever and a non-preachy way of talking about a pretty important issue. Not to mention it was funny. The super imposed images of gay men kissing obviously was meant to be connected to the line \"taking it in the ass\" but it was less homophobic than that godawful  Tim and Eric skit with the married news team where they only joke is that the actors are both dudes and they're being affectionate with one another.\n\nThe first time I saw MDE:WP I thought it was just another random for the sake of randomness skit show thing but after checking it out after all the hubub I've realized that it's actually really funny and clever and kind of artistic. *The Man Who Would Never Be... What They Made Him to Be* was campy and shitty and seems like some low budget highschool drama shit but it was funny and clever and artistic.\n\nWatching Sam Hyde read off statements and stats from gay hate websites at a Williamsburg comedy show is very much like Andy Kauffman in that it's anti-humor but also very much like Lenny Bruce it's testing the boundaries of free speech. And yes I know that free speech is not freedom from consequence or whatever people say to justify ruining people's livelihood for saying things they don't like hearing, but I think that the reality is as a society we're facing the real possibility that the people are going to demand the government actually put more restrictions on speech so freedom of speech to fellow citizens really is the new battleground and people like Sam Hyde are showing us where the battle lines are drawn.\n\nI'm not trying to make Sam Hyde sound like a folk hero, it's actually the opposite. People are just so fucking weak right now that a guy who can't even get up on stage without a pile of notes and but has the balls to say all this shit himself rather than speaking through cartoon characters like Trey Parker and Matt Stone do, seems like a folk hero.\n\nIn the past two days I've seen Sam Hyde make fun of college kids, the military, gamers, asians, black people, jews, anti-semites, pick-up artists, the government, tech entrepreneurs, the handicapped, the entertainment industry, art, comedy, celebrities, white people, hipsters and a bunch of shit I've forgotten already.\n\nI also think some of his fans are retards including some of the people in this subreddit but I don't know what the fuck that has to do with him. Russle Peters isn't responsible for people who only laugh at his jokes because they think indian people have funny accents (he's even said he can tell if people are racist assholes by when they laugh during his stand up). \n\nMillion Dollar Extreme : World Peace is funny and so is Sam Hyde. I think he's a soft target and that's why people are going after him and MDE rather than other comedians who have done stuff that could be seen as \"punching down\" (and I actually think the MDE boys and Sam Hyde are a lot less mean spirited than other comedians who don't get flak because people assume they're on \"their side\" or too well established to attack).\n\nSam Hyde and MDE:WP are the canary in the coal mine as cliched as that is. It's just funny and nothing they or Sam is doing is super groundbreaking or edgy other than maybe some of the cinematography and editing, it's just that people are pussies and picking on an easy target.\n\nAlso, fuck these bands that are disavowing the show after the fact, you weak fucking losers that's the least rock and roll thing I've ever heard.\n\nTL;DR\n\nI am a huge faggot please fuck my face.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "5i8ud6", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "Since hearing about MDE getting cancelled I've watched all the MDE:WP episodes and a bunch of Sam Hyde's videos and stand up. I've been a huge fan for about two days, here's what I think...", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 12, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 7, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": 1481694076.0, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_5i8ud6", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/5i8ud6/since_hearing_about_mde_getting_cancelled_ive/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1481722040.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/5i8ud6/since_hearing_about_mde_getting_cancelled_ive/", "author_flair_text": null, "quarantine": false, "author": "tramp_abroad", "created_utc": 1481693240.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.87, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5i8ud6", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "db6xn2j", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ATP_ninja", "can_mod_post": false, "ups": 5, "parent_id": "t3_5i8ud6", "score": 5, "approved_by": null, "downs": 0, "body": "This is some quality nut-hugging my dude. Save up those nuts for the winter. ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is some quality nut-hugging my dude. Save up those nuts for the winter. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5i8ud6/since_hearing_about_mde_getting_cancelled_ive/db6xn2j/", "subreddit_type": "public", "name": "t1_db6xn2j", "created": 1481766435.0, "author_flair_text": "Turbulent Poindexter", "created_utc": 1481737635.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5i8ud6", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "db6tqzc", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "iwearhotpants", "can_mod_post": false, "ups": 4, "parent_id": "t3_5i8ud6", "score": 4, "approved_by": null, "downs": 0, "body": "dude you can just suck Sam's dick you don't need to beg for it publicly ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;dude you can just suck Sam&amp;#39;s dick you don&amp;#39;t need to beg for it publicly &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5i8ud6/since_hearing_about_mde_getting_cancelled_ive/db6tqzc/", "subreddit_type": "public", "name": "t1_db6tqzc", "created": 1481761816.0, "author_flair_text": null, "created_utc": 1481733016.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5i8ud6", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "db7vdbn", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Kevin_in_LA", "can_mod_post": false, "ups": 2, "parent_id": "t3_5i8ud6", "score": 2, "approved_by": null, "downs": 0, "body": "You're right, dude; it is great and important. They are \"folk heroes.\" Let's say Volk Heroes. \n\nThey're better than Kaufman or Parker/Stone. As far as I know Kaufman was great at staying in character and being surreal but I don't recall him doing anything with that scathing undertone of political frustration and calls to action.\n\nEven South Park just makes fun of things and no longer really has any answers...they've been especially off the ball for the last few seasons, meandering.\n\nTim and Eric used to be my favorites because they were absurd, and I thought they wouldn't have to get political...now Tim's really disappointing me; he's political all the time. I still love 'em, but it ain't the same. MDE is really electric. They took where Tim and Eric went and threw it even further into space.\n\nCut your cable and just use the internet. Support these guys with your wallet and don't be a faggot. They're just getting started.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right, dude; it is great and important. They are &amp;quot;folk heroes.&amp;quot; Let&amp;#39;s say Volk Heroes. &lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;re better than Kaufman or Parker/Stone. As far as I know Kaufman was great at staying in character and being surreal but I don&amp;#39;t recall him doing anything with that scathing undertone of political frustration and calls to action.&lt;/p&gt;\n\n&lt;p&gt;Even South Park just makes fun of things and no longer really has any answers...they&amp;#39;ve been especially off the ball for the last few seasons, meandering.&lt;/p&gt;\n\n&lt;p&gt;Tim and Eric used to be my favorites because they were absurd, and I thought they wouldn&amp;#39;t have to get political...now Tim&amp;#39;s really disappointing me; he&amp;#39;s political all the time. I still love &amp;#39;em, but it ain&amp;#39;t the same. MDE is really electric. They took where Tim and Eric went and threw it even further into space.&lt;/p&gt;\n\n&lt;p&gt;Cut your cable and just use the internet. Support these guys with your wallet and don&amp;#39;t be a faggot. They&amp;#39;re just getting started.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5i8ud6/since_hearing_about_mde_getting_cancelled_ive/db7vdbn/", "subreddit_type": "public", "name": "t1_db7vdbn", "created": 1481810420.0, "author_flair_text": null, "created_utc": 1481781620.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5i8ud6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5i8ud6", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "db7v7h4", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Kevin_in_LA", "can_mod_post": false, "ups": 1, "parent_id": "t1_db6s05z", "score": 1, "approved_by": null, "downs": 0, "body": "http://archive.is/aeNpc\n\nIt's too bad, really. I just got into WP right before it got cancelled. I bought the first season on Amazon and have watched it online a few times. \n\nIt seemed new to me, and even cool, like cutting edge. The music added to that. I thought it was a new scene I could get into because I usually listen to Between The Buried And Me or Orbs...\n\n..but now that those bands have all disavowed the show even when they thought it was funny is really lame on their part and like the OP said, so not Rock&amp;Roll.", "edited": 1481782876.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://archive.is/aeNpc\"&gt;http://archive.is/aeNpc&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s too bad, really. I just got into WP right before it got cancelled. I bought the first season on Amazon and have watched it online a few times. &lt;/p&gt;\n\n&lt;p&gt;It seemed new to me, and even cool, like cutting edge. The music added to that. I thought it was a new scene I could get into because I usually listen to Between The Buried And Me or Orbs...&lt;/p&gt;\n\n&lt;p&gt;..but now that those bands have all disavowed the show even when they thought it was funny is really lame on their part and like the OP said, so not Rock&amp;amp;Roll.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5i8ud6/since_hearing_about_mde_getting_cancelled_ive/db7v7h4/", "subreddit_type": "public", "name": "t1_db7v7h4", "created": 1481810104.0, "author_flair_text": null, "created_utc": 1481781304.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "db6s05z", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Belac69", "can_mod_post": false, "ups": 1, "parent_id": "t3_5i8ud6", "score": 1, "approved_by": null, "downs": 0, "body": "What bands? ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What bands? &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5i8ud6/since_hearing_about_mde_getting_cancelled_ive/db6s05z/", "subreddit_type": "public", "name": "t1_db6s05z", "created": 1481759682.0, "author_flair_text": null, "created_utc": 1481730882.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5i8ud6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5i8ud6", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dgvdv25", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "tramp_abroad", "can_mod_post": false, "ups": 1, "parent_id": "t1_dggjk0j", "score": 1, "approved_by": null, "downs": 0, "body": "Fucking imbecile!? How dare you?!\n\nAh yes the old \"his blinking is double winking\" trick. It actually is testing the boundaries of free speech whether it's intentional or not. Or at least what's socially acceptable speech if you're one of those \"free speech is only your ability to criticize the government\" dip shits. And I really don't give a shit if it's all true or not, my point is he's not as in line with all the nut jobs as you think he is.\n\nAnyway you seem like a super chill dude with lots going on replying to a 4 month old comment and all. I'll give you another 4 months to reply to this one as I only signed into this account to try to find some link I saved.\n\nEat shit. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fucking imbecile!? How dare you?!&lt;/p&gt;\n\n&lt;p&gt;Ah yes the old &amp;quot;his blinking is double winking&amp;quot; trick. It actually is testing the boundaries of free speech whether it&amp;#39;s intentional or not. Or at least what&amp;#39;s socially acceptable speech if you&amp;#39;re one of those &amp;quot;free speech is only your ability to criticize the government&amp;quot; dip shits. And I really don&amp;#39;t give a shit if it&amp;#39;s all true or not, my point is he&amp;#39;s not as in line with all the nut jobs as you think he is.&lt;/p&gt;\n\n&lt;p&gt;Anyway you seem like a super chill dude with lots going on replying to a 4 month old comment and all. I&amp;#39;ll give you another 4 months to reply to this one as I only signed into this account to try to find some link I saved.&lt;/p&gt;\n\n&lt;p&gt;Eat shit. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5i8ud6/since_hearing_about_mde_getting_cancelled_ive/dgvdv25/", "subreddit_type": "public", "name": "t1_dgvdv25", "created": 1493424804.0, "author_flair_text": null, "created_utc": 1493396004.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dggjk0j", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "wevsdgaf", "can_mod_post": false, "ups": 1, "parent_id": "t3_5i8ud6", "score": 1, "approved_by": null, "downs": 0, "body": "It's not testing the boundaries of free-speech you fucking imbecile. This isn't him just saying whatever to push boundaries, he stands by the product. Watch this standup he did at a private venue: https://www.youtube.com/watch?v=aM8pVQQYqCg. Watch what he says at the end of this standup: https://youtu.be/IyE78eyFRa8?t=8m8s. It's all totally face-value and earnest. All he has to do is append a \"lol jk\" to anything he says and he has both sides of the debate scrambling to gargle his chode. Watch any discussion board where some smug ponce shows up to talk about how they're really appreciating the \"irony\" and gets laughed out by Sam and his fans. This shit is hilarious.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not testing the boundaries of free-speech you fucking imbecile. This isn&amp;#39;t him just saying whatever to push boundaries, he stands by the product. Watch this standup he did at a private venue: &lt;a href=\"https://www.youtube.com/watch?v=aM8pVQQYqCg\"&gt;https://www.youtube.com/watch?v=aM8pVQQYqCg&lt;/a&gt;. Watch what he says at the end of this standup: &lt;a href=\"https://youtu.be/IyE78eyFRa8?t=8m8s\"&gt;https://youtu.be/IyE78eyFRa8?t=8m8s&lt;/a&gt;. It&amp;#39;s all totally face-value and earnest. All he has to do is append a &amp;quot;lol jk&amp;quot; to anything he says and he has both sides of the debate scrambling to gargle his chode. Watch any discussion board where some smug ponce shows up to talk about how they&amp;#39;re really appreciating the &amp;quot;irony&amp;quot; and gets laughed out by Sam and his fans. This shit is hilarious.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5i8ud6/since_hearing_about_mde_getting_cancelled_ive/dggjk0j/", "subreddit_type": "public", "name": "t1_dggjk0j", "created": 1492615815.0, "author_flair_text": "genetic jihad predisposition", "created_utc": 1492587015.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]