[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Every 7 year old kid wants something good for Christmas, and this particular year I wanted an Xbox 360 ATV Off-Road Xtreme Bundle Kit 500 GB. My dad was well aware of this and told me he&amp;#39;d buy it, but he told me there was a catch. &lt;/p&gt;\n\n&lt;p&gt;If he was to buy my young heart&amp;#39;s only desire, the Xbox, we would have to use it to &amp;quot;bond&amp;quot;, he told me. Usually we&amp;#39;d just play catch in the yard but apparently he&amp;#39;s been looking into gaming for a while and thought I could teach him.&lt;/p&gt;\n\n&lt;p&gt;A little background on my father is necessary before I continue this frightful story. My father is a rotund man with a harsh, tan, Greek face. At the time he was just turning 40, but he&amp;#39;d never really celebrated a Christmas before, and no one ever thought to buy him any gifts. I know, it&amp;#39;s sad, but as the provider for his household his entire life there wasn&amp;#39;t much I could give him except whatever form of compassion he would take from me. He wasn&amp;#39;t a hugger, didn&amp;#39;t like to be hugged, but he knew I loved him.&lt;/p&gt;\n\n&lt;p&gt;The coming Christmas would be my first official &amp;quot;Christmas&amp;quot; as well, we just never really had the money for the whole tree, feast, presents set up. I was usually lucky if I got some batteries for my old game boy color, but then they&amp;#39;d just run out within the week and I&amp;#39;d be left to pretend to play it until next Christmas.&lt;/p&gt;\n\n&lt;p&gt;This year was a little bit different because my mother and father separated, and I moved out of a house and into a cheap apartment with my father. So my father was able to save enough money for the whole &amp;quot;shebang&amp;quot; he said - he really liked that word. &lt;/p&gt;\n\n&lt;p&gt;By the time Christmas Day was inching near I was giddy with excitement, and my father started to become more jovial than normal as well. My father is very hard to talk to, very stone faced, very reserved. I&amp;#39;d never seen him act so gleeful before that Christmas week, and it was almost as if he was regressing in some strange way. His tan harsh face was stretched in a constant smile, and when he relaxed his face it looked like a broken in catcher&amp;#39;s mitt.&lt;/p&gt;\n\n&lt;p&gt;He kept calling me weird juvenile names (albeit in a completely joking manner) like doofus, butt head, fart licker, cheese sniffer, paint eater, water head, four eyes, train tracks, faggot, sock sucker, and other ones I can&amp;#39;t recall. And as Christmas approached the names only got more juvenile: doodybutt, poopyhead, dumperdink, weenylicker, fartface. The night before Christmas his whole demeanor seemed to shift.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Go sleepy doodybreath&amp;quot; was the only thing he said to me the entire Christmas Eve day. Anytime I tried to make conversation he would just shake his head, look at the ground, stick is lower lip out like he was sad, and say &amp;quot;go sleepy. I went to bed early that night.&lt;/p&gt;\n\n&lt;p&gt;When I awoke it was Christmas Day, and boy was I ready to go off-roading in the Brazilian mountains, triple backflipping with my very own virtual ATV. But when I got to my Christmas tree I noticed the packaging strewn all over the floor, everywhere, like some rabid animal had gotten to it. As I approached the main living room I could hear the faint hissing of our 32&amp;quot; classic tube TV, with music coming from it as well.&lt;/p&gt;\n\n&lt;p&gt;I then saw what looked to be a giant toddler sitting on the living room floor, wearing a race car onesy, hypnotized by the TV and twiddling his toes underneath the onesy in a frenzy as he performed triple-backflips in the jungle mountains of Brazil. &lt;/p&gt;\n\n&lt;p&gt;Without taking his eyes off the screen he said &amp;quot;hey papa can you make me hot-cokey?&amp;quot;. His thumbs continued to fiddle with the controller, and I saw him do a quadruple spinning backflip on screen, scoring massive points. &lt;/p&gt;\n\n&lt;p&gt;I slowly walked over to whoever it was, stood between him and the TV and looked down at him. &lt;/p&gt;\n\n&lt;p&gt;It was my father, the tan Greek man, wearing the race car onesie, with his chest hair poking out of the top just above the zipper. I could see his golden cross necklace poking out a little bit and shining a shimmering light. His face was completely the same but completely different, if that makes any sense - his aura had changed. His eyes were brighter than I&amp;#39;d ever seen them before, he had always looked so depressed before, so dead in the face - not anymore. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Papa you&amp;#39;re in the way!&amp;quot; He yelled at me.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s when I got a sinking feeling in my chest, the same one I felt that time I got stung by a bee playing soccer and went into anaphylactic shock, where a sense of overcast doom moves in like some wicked weather system - something was seriously wrong. &lt;/p&gt;\n\n&lt;p&gt;I made a beeline for the only door to the apartment but I was quickly grabbed by my father. He gave me a big bear hug and turned me away from the door.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I love you so much papa&amp;quot; he said as he swung me around, squeezing the life out of me. &amp;quot;Now make me some hot-cokey!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He let me go and I stood completely motionless in disbelief at my situation. The child-like quality in my father&amp;#39;s face then left for a moment.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hot-cokey.&amp;quot; He said sternly, and resumed playing his game. &lt;/p&gt;\n\n&lt;p&gt;I mustered up the strength to say something.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Dad&amp;quot; I said with a shaking, teary voice &amp;quot;you&amp;#39;re scaring me.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He didn&amp;#39;t turn around.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Dad, there&amp;#39;s something wrong with you and you&amp;#39;re scaring me.&amp;quot; I said.&lt;/p&gt;\n\n&lt;p&gt;Then he turned around slowly, his head was shaking. He looked at me with pain in his face, tears streaming from his eyes and sweat from his forehead.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Please l-leave.&amp;quot; He said, straining his voice. I stood there watching him, unable to follow as I was in shock.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Son! Please leave!&amp;quot; He yelped, voice cracking.&lt;/p&gt;\n\n&lt;p&gt;With that final command I left, went to my mom&amp;#39;s house, and I haven&amp;#39;t seen him since. We&amp;#39;ve tried to contact him in multiple ways. When we send emails we get weird rambling replies back. I even sent a letter to him once and he sent me his golden cross necklace, the letter he wrote starts off normal but trails off.&lt;/p&gt;\n\n&lt;p&gt;Here is the only leguble part of his letter:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Son I can&amp;#39;t possibly begin to explain and if I could you would never understand, please take my necklace as a reminder of how I was before cause there&amp;#39;s doody in my but mr and it&amp;#39;s all squashed up and I don&amp;#39;t have anyone to change my diapees please come back home papa.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Every 7 year old kid wants something good for Christmas, and this particular year I wanted an Xbox 360 ATV Off-Road Xtreme Bundle Kit 500 GB. My dad was well aware of this and told me he'd buy it, but he told me there was a catch. \n\nIf he was to buy my young heart's only desire, the Xbox, we would have to use it to \"bond\", he told me. Usually we'd just play catch in the yard but apparently he's been looking into gaming for a while and thought I could teach him.\n\nA little background on my father is necessary before I continue this frightful story. My father is a rotund man with a harsh, tan, Greek face. At the time he was just turning 40, but he'd never really celebrated a Christmas before, and no one ever thought to buy him any gifts. I know, it's sad, but as the provider for his household his entire life there wasn't much I could give him except whatever form of compassion he would take from me. He wasn't a hugger, didn't like to be hugged, but he knew I loved him.\n\nThe coming Christmas would be my first official \"Christmas\" as well, we just never really had the money for the whole tree, feast, presents set up. I was usually lucky if I got some batteries for my old game boy color, but then they'd just run out within the week and I'd be left to pretend to play it until next Christmas.\n\nThis year was a little bit different because my mother and father separated, and I moved out of a house and into a cheap apartment with my father. So my father was able to save enough money for the whole \"shebang\" he said - he really liked that word. \n\nBy the time Christmas Day was inching near I was giddy with excitement, and my father started to become more jovial than normal as well. My father is very hard to talk to, very stone faced, very reserved. I'd never seen him act so gleeful before that Christmas week, and it was almost as if he was regressing in some strange way. His tan harsh face was stretched in a constant smile, and when he relaxed his face it looked like a broken in catcher's mitt.\n\nHe kept calling me weird juvenile names (albeit in a completely joking manner) like doofus, butt head, fart licker, cheese sniffer, paint eater, water head, four eyes, train tracks, faggot, sock sucker, and other ones I can't recall. And as Christmas approached the names only got more juvenile: doodybutt, poopyhead, dumperdink, weenylicker, fartface. The night before Christmas his whole demeanor seemed to shift.\n\n\"Go sleepy doodybreath\" was the only thing he said to me the entire Christmas Eve day. Anytime I tried to make conversation he would just shake his head, look at the ground, stick is lower lip out like he was sad, and say \"go sleepy. I went to bed early that night.\n\nWhen I awoke it was Christmas Day, and boy was I ready to go off-roading in the Brazilian mountains, triple backflipping with my very own virtual ATV. But when I got to my Christmas tree I noticed the packaging strewn all over the floor, everywhere, like some rabid animal had gotten to it. As I approached the main living room I could hear the faint hissing of our 32\" classic tube TV, with music coming from it as well.\n\nI then saw what looked to be a giant toddler sitting on the living room floor, wearing a race car onesy, hypnotized by the TV and twiddling his toes underneath the onesy in a frenzy as he performed triple-backflips in the jungle mountains of Brazil. \n\nWithout taking his eyes off the screen he said \"hey papa can you make me hot-cokey?\". His thumbs continued to fiddle with the controller, and I saw him do a quadruple spinning backflip on screen, scoring massive points. \n\nI slowly walked over to whoever it was, stood between him and the TV and looked down at him. \n\nIt was my father, the tan Greek man, wearing the race car onesie, with his chest hair poking out of the top just above the zipper. I could see his golden cross necklace poking out a little bit and shining a shimmering light. His face was completely the same but completely different, if that makes any sense - his aura had changed. His eyes were brighter than I'd ever seen them before, he had always looked so depressed before, so dead in the face - not anymore. \n\n\"Papa you're in the way!\" He yelled at me.\n\nThat's when I got a sinking feeling in my chest, the same one I felt that time I got stung by a bee playing soccer and went into anaphylactic shock, where a sense of overcast doom moves in like some wicked weather system - something was seriously wrong. \n\nI made a beeline for the only door to the apartment but I was quickly grabbed by my father. He gave me a big bear hug and turned me away from the door.\n\n\"I love you so much papa\" he said as he swung me around, squeezing the life out of me. \"Now make me some hot-cokey!\"\n\nHe let me go and I stood completely motionless in disbelief at my situation. The child-like quality in my father's face then left for a moment.\n\n\"Hot-cokey.\" He said sternly, and resumed playing his game. \n\nI mustered up the strength to say something.\n\n\"Dad\" I said with a shaking, teary voice \"you're scaring me.\"\n\nHe didn't turn around.\n\n\"Dad, there's something wrong with you and you're scaring me.\" I said.\n\nThen he turned around slowly, his head was shaking. He looked at me with pain in his face, tears streaming from his eyes and sweat from his forehead.\n\n\"Please l-leave.\" He said, straining his voice. I stood there watching him, unable to follow as I was in shock.\n\n\"Son! Please leave!\" He yelped, voice cracking.\n\nWith that final command I left, went to my mom's house, and I haven't seen him since. We've tried to contact him in multiple ways. When we send emails we get weird rambling replies back. I even sent a letter to him once and he sent me his golden cross necklace, the letter he wrote starts off normal but trails off.\n\nHere is the only leguble part of his letter:\n\n\"Son I can't possibly begin to explain and if I could you would never understand, please take my necklace as a reminder of how I was before cause there's doody in my but mr and it's all squashed up and I don't have anyone to change my diapees please come back home papa.\"\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "5pb3c7", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "How My Father Stole Christmas - A Brief Horror Story", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 36, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 9, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_5pb3c7", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/5pb3c7/how_my_father_stole_christmas_a_brief_horror_story/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1485041208.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/5pb3c7/how_my_father_stole_christmas_a_brief_horror_story/", "author_flair_text": "READ UNABOMBER'S MANIFESTO", "quarantine": false, "author": "Psychedelican", "created_utc": 1485012408.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.91, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 36}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5pb3c7", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dcq1xog", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "goobaman224", "can_mod_post": false, "ups": 18, "parent_id": "t3_5pb3c7", "score": 18, "approved_by": null, "downs": 0, "body": "this is good and JUST in time for the holidays; post this to nosleep for big time upvotes", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this is good and JUST in time for the holidays; post this to nosleep for big time upvotes&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5pb3c7/how_my_father_stole_christmas_a_brief_horror_story/dcq1xog/", "subreddit_type": "public", "name": "t1_dcq1xog", "created": 1485055624.0, "author_flair_text": "(((Kung Fu Panda)))", "created_utc": 1485026824.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5pb3c7", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dcqa61e", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "texas_mickey", "can_mod_post": false, "ups": 4, "parent_id": "t3_5pb3c7", "score": 4, "approved_by": null, "downs": 0, "body": "This is too fucked up to not be true.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is too fucked up to not be true.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5pb3c7/how_my_father_stole_christmas_a_brief_horror_story/dcqa61e/", "subreddit_type": "public", "name": "t1_dcqa61e", "created": 1485066686.0, "author_flair_text": "𝔇𝔢𝔰𝔱𝔦𝔫𝔞𝔱𝔦𝔬𝔫: 𝔅𝔩𝔬𝔬𝔡!", "created_utc": 1485037886.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5pb3c7", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dcq5o58", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "prizzle92", "can_mod_post": false, "ups": 3, "parent_id": "t3_5pb3c7", "score": 3, "approved_by": null, "downs": 0, "body": "youre gonna go far kid", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;youre gonna go far kid&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5pb3c7/how_my_father_stole_christmas_a_brief_horror_story/dcq5o58/", "subreddit_type": "public", "name": "t1_dcq5o58", "created": 1485060594.0, "author_flair_text": "mamas little who-ah (banned, guns = bad, not kosher etc.)", "created_utc": 1485031794.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5pb3c7", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dcq6i5h", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 3, "parent_id": "t3_5pb3c7", "score": 3, "approved_by": null, "downs": 0, "body": "dude thats nuts", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;dude thats nuts&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5pb3c7/how_my_father_stole_christmas_a_brief_horror_story/dcq6i5h/", "subreddit_type": "public", "name": "t1_dcq6i5h", "created": 1485061707.0, "author_flair_text": null, "created_utc": 1485032907.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5pb3c7", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dcqbxbw", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Kommander000", "can_mod_post": false, "ups": 1, "parent_id": "t3_5pb3c7", "score": 1, "approved_by": null, "downs": 0, "body": "w0w", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;w0w&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5pb3c7/how_my_father_stole_christmas_a_brief_horror_story/dcqbxbw/", "subreddit_type": "public", "name": "t1_dcqbxbw", "created": 1485069043.0, "author_flair_text": "yes russian exercise guru", "created_utc": 1485040243.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5pb3c7", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dcqcu55", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "bigboisexyboi", "can_mod_post": false, "ups": 1, "parent_id": "t3_5pb3c7", "score": 1, "approved_by": null, "downs": 0, "body": "this is good man... TOO good... ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this is good man... TOO good... &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5pb3c7/how_my_father_stole_christmas_a_brief_horror_story/dcqcu55/", "subreddit_type": "public", "name": "t1_dcqcu55", "created": 1485070309.0, "author_flair_text": "smoke cigarettes until you like cigarettes", "created_utc": 1485041509.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5pb3c7", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dcqh3sn", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "darkjon", "can_mod_post": false, "ups": 1, "parent_id": "t3_5pb3c7", "score": 1, "approved_by": null, "downs": 0, "body": "*Mr burns voice* excellent...", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Mr burns voice&lt;/em&gt; excellent...&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5pb3c7/how_my_father_stole_christmas_a_brief_horror_story/dcqh3sn/", "subreddit_type": "public", "name": "t1_dcqh3sn", "created": 1485076277.0, "author_flair_text": "never had lice", "created_utc": 1485047477.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5pb3c7", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dcr071c", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "indivisibleremainder", "can_mod_post": false, "ups": 1, "parent_id": "t3_5pb3c7", "score": 1, "approved_by": null, "downs": 0, "body": "good work", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;good work&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5pb3c7/how_my_father_stole_christmas_a_brief_horror_story/dcr071c/", "subreddit_type": "public", "name": "t1_dcr071c", "created": 1485112079.0, "author_flair_text": "John Bowl", "created_utc": 1485083279.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5pb3c7", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dcqzc8c", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "pobway", "can_mod_post": false, "ups": 0, "parent_id": "t3_5pb3c7", "score": 0, "approved_by": null, "downs": 0, "body": "didnt read", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;didnt read&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5pb3c7/how_my_father_stole_christmas_a_brief_horror_story/dcqzc8c/", "subreddit_type": "public", "name": "t1_dcqzc8c", "created": 1485109352.0, "author_flair_text": null, "created_utc": 1485080552.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]