[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Whats tapas? I dont know, but its shit.\nHearty laughs across the room, the audience on their feet erupting an enormous roar of applause. &lt;/p&gt;\n\n&lt;p&gt;Apart from one member, one very unique individual, with a stern look on his face. His facial hair, patchy and light very hard to notice still I did; I believe thats all he could grow if I had to guess. He had a look which I noticed from the stage, a look which I felt was analyzing his surroundings, waiting for a situation to occur prehaps. A threat to arise? For him to spring into action.&lt;/p&gt;\n\n&lt;p&gt;Crowd still cheering I could not stop looking at this man, boy, I think young man. I observed more, large lips a fat nos and murky brown hair. Not a chubby face but certainly not slime. A clean complexion to, with a slight glimmer to his skin, he moisturised I could tell from here. So he takes care of himself does he, but why the facial hair? So unkempt, messy and lazy. The hair on the head was neat, but the facial hair scrubby. &lt;/p&gt;\n\n&lt;p&gt;Audience began to silence, and I had a feeling of dread. I still had not looked away from this young man. He had a mystery about him, it felt dark and certainly scary. He is scanning the audience, I am seeing him from the side, and only his face as several well dressed hipsters around a table blocked the full view of the young mans table. I couldnt see what he was sitting by, or what he was wearing. &lt;/p&gt;\n\n&lt;p&gt;I walk off the stage now, and aim for the toilets to get a better view. What drew my attention to this young man is that not once during my performance did he look towards the stage, ignored me. He just kept glaring at all the people in the bar, stares at one for a few seconds and moves to the other. He&amp;#39;s seen things I thought, something has happened to him in the past and this is what he does. Hes seen something and gets lost in his own mind. I figured it out. There. I enter the toilet&lt;/p&gt;\n\n&lt;p&gt;Next act is on the stage now, acoustic guitar, going to play a song with some love lyrics. Not bad, I saw him last week he was pretty good, nice tone in his voice. I dig his Levi&amp;#39;s too, are they 501&amp;#39;s? Pretty cool guy, wonder if he likes Chon. Probably does, god their riffs are so good, shame about the rest of the song, its like an ultimate hit when those ultra fast riffs let rip and then it kinda has a lackluster feel for the rest of the so-\nYoung mans up on the move, wheres he going, I sit at a table opposite him. Dude must work out as he has his gym bag with him. Hes on the way to the bar, lets see what he orders. Hey I could go up to him I guess, make conversation. Nah, probably not. From what hes wearing I can tell hes probably boring, green army jacket, not really fitting in with the vibes of the bar. Heh. Cant blame him though least hes trying. Denim jeans tho, blue and green should never be seen. My mom told me that its pretty simple to follow. &lt;/p&gt;\n\n&lt;p&gt;Hes sitting back down hes ordered just a water. Interesting. Is he crying? Yeah he&amp;#39;s crying now. &lt;/p&gt;\n\n&lt;p&gt;Getting really fucking angry. At these fucking people, what is that fucking faggot staring at me for. Dressed like an aids patient with autism. Keep fucking looking at me you stupid mongoloid fuck. You are making me so fucking angry. All these people, not one of them has a single clue what its like. Ive been up and down every day of my life, I understand the world and how people are, the true nature of them. I know everyone is selfish, I will NEVER find someone like me. Thats it. I know it. All hope has gone, that ship has set sail, heading round the world wont be back till 100 years from now. GOODBYE. My existence is pointless, such wasted talent, I AM SUCH WASTED TALENT. If only.... oh if only they FUCKING KNEW what I know FELT WHAT I FELT. Witnessed what I witnessed. Life is different for us all, they had cushy lives, oh you broke up with your college sweetheart and started self harming on your feet... GEE YOU REALLY HAVE HAD IT TOUGH, I FEEL SO SORRY FOR YOU. These abhorent cunt excuse for human beings make me sick. I NEED TO, I DESERVE TO, THIS IS MY PURPOSE. I NEED TO, I DESERVE TO, THIS IS MY PURPOSE. I NEED TO, I DESERVE TO...&lt;/p&gt;\n\n&lt;p&gt;THIS IS MY PURPOSE!&lt;/p&gt;\n\n&lt;p&gt;Wow what the fuck is that guy doing, why did he shout that. Absolute douche, god I hope someone ask him to get out. Whats he doing? Is that a fucking gun in his bag? &lt;/p&gt;\n\n&lt;p&gt;The young man pulls out the AK47 he purchased illegally and proudly displays it to the unsuspecting audience, the homosexual whom has narrated the majority of this event sees the weapon being pointed directly at his face, he panics... as is expected of someone with as low testosterone levels as himself. He shrieks in a tone only best described as that of a seagull&amp;#39;s shriek. The young man chambers the rifle and fires 2 or 3 rounds into the homosexuals head. The crowd already looking at the young man due to his initial eruption, begin to also panic, but find comfort in that the shooter is white and therefore the worry of a refugee&amp;#39;s face on the media is at ease. And the scrape of chairs and glass shattering as people scuffle and race to the exit offers a certain comfort to the young mans ears. He smiles, slightly, comfort in the madness. He fires short bursts into the crowd, they are neat and compact in a line sort of fashion as there is only one exit. Firing 3 round bursts the young man kills and/or critically injures at least 12 people before he has to reload. 12 people all in around 6 seconds, he was elated with the success.&lt;/p&gt;\n\n&lt;p&gt;Opening the inside of his green army style jacket, reveals a HP Browning, 2 high explosive grenades, a sawn off shotgun and magazines for the HP Browning all neatly duct taped onto the lining of both sides of the jacket. He takes a single grenade out and puts it into his right pocket, &amp;#39;save this for later he thought&amp;#39;. Afterwards he takes out the pistol already loaded and chambered, then begins to fire in the still largely populated mess of people fighting for the exit. He fires 13 bullets into the crowd, one person per bullet minus the last bullet, &amp;#39;13 is unlucky i guess&amp;#39; he thought. The young man believes he got fatal shots per shot. The young man was right. People began to fall over the downed and deceased, it was messy. Those who fell arose and were covered and screaming, with blood and pieces of human attached to their clothing and hair and face. Fitting the young man thought, you come into the world screaming in the blood of another, and now I make you leave this life covered in blood and screaming. &lt;/p&gt;\n\n&lt;p&gt;He pulls out the grenade from the right pocket now, as their is a congestion near the exit people begin to pile up. Pulls the pin and lets go, throws the grenade. Lands right in the middle, some of the sheep begin to realise what has been thrown, they scramble away but its too late. They took the brunt of the impact, but the young man still got pushed back some way behind. He looked in awe, the mess it created. Limbs, heads, they were nearly all dead. That was very messy, I did not expect that. It happened a little quick in his opiniom, he was happy but a bit dissapointed he didnt see it ALL. Emptying the pistol and inserting another magazine, he starts to pick off the remaining survivors. &amp;#39;No survivors&amp;#39; he said, and chuckled nervously. There were maximum 10 people left, most of them were on their way to deah, suffering before death is better than a fast death. A fast death is more than these invalids deserve. Some members of the acoustic band hid behind the stage, THEY THOUGHT THEY COULD HIDE. The young man did not notice the eery silence that was about the room during his episode, there were some screams but it was relatively quiet. As he strolled over with pistol in hand, to the stage, the band (3 of them) pleading with him to let him go. The ponytailed faggot wearing the skinnies and white shirt was the first to go, 2 bullets to the lung, &amp;#39;choke on your own blood&amp;#39; the young man muttered. The other two were shot once in the face and they spluttered a few words along with some blood with their dying breath, which he could not decipher nor could he care to.&lt;/p&gt;\n\n&lt;p&gt;All had been taken care of, a sense of calm arose over the young mans head. Calm in the madness. He looked at what he had done, no shame only pride. This was his goal, and he had done it. For the first time in a long time, he set out to do something, and did exactly that. He felt proud, and remembered everything he had done, and had done to him. The countless times he nearly got there, only nearly never quite close. A near miss, a contradiction of sorts, a near miss is not a miss at all. It was their time first, now it must be his turn. He always loved her, still did. Clever, but not clever enough to stop caring about it, her. Nice guys always finish last he thought. He reached into the left pocket, where he kept a flask full of whisky and a half empty pack of Malboro Red and a Zippo lighter with an US Army camo. He took it all out, put the flask in one hand, not before he sat down at a bullet battered blood bathed chair mind. He drank the whole lot, and gagged slightly. His body felt warm and tingled. He took a cigarette out of the packet, lit it and began to smoke it. He heard sirens now, getting closer, it was nearly time. He felt good, really good. Smoking this cigarette was bliss. Looking around at the bodies, occassional groans. Dying groanss. So much blood everywhere, wow I really did create a mess didnt I. Sirens close now, he takes the sawn off shotgun hanging from one piece of ductape now and dangling a little, ripping the last remaining tape doing so. It was already loaded with 2 shells. A woman walked by the front door and saw the carnage, I shouted CUNT at her and she ran crying I presume. Sirens were so close now. I laid back on the chair with the 2 front legs in the air, pressed the 2 barrels a little under my chin directly below my brain. I hear more sirens a block away. I say my final goodbyes to her, and pat the letter in my coat. I cry a little, I miss her still, I really did love her. &lt;/p&gt;\n\n&lt;p&gt;He pulls the trigger now and he flies back, both him and the chair. Lying flat with his legs elevated supported by the toppled chair, blood flows from the top of his head seeping through his hair. Blood cries from his eye down towards the ears. He still loves her, he wont learn. He cries blood for her, his heart stopped for her. His brains are on the floor, his life is now no more. He is gone, never existed. Pointless life, pointless acts. He cries blood for her, he is a fool. When will he ever learn. Never.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Whats tapas? I dont know, but its shit.\nHearty laughs across the room, the audience on their feet erupting an enormous roar of applause. \n\nApart from one member, one very unique individual, with a stern look on his face. His facial hair, patchy and light very hard to notice still I did; I believe thats all he could grow if I had to guess. He had a look which I noticed from the stage, a look which I felt was analyzing his surroundings, waiting for a situation to occur prehaps. A threat to arise? For him to spring into action.\n\nCrowd still cheering I could not stop looking at this man, boy, I think young man. I observed more, large lips a fat nos and murky brown hair. Not a chubby face but certainly not slime. A clean complexion to, with a slight glimmer to his skin, he moisturised I could tell from here. So he takes care of himself does he, but why the facial hair? So unkempt, messy and lazy. The hair on the head was neat, but the facial hair scrubby. \n\nAudience began to silence, and I had a feeling of dread. I still had not looked away from this young man. He had a mystery about him, it felt dark and certainly scary. He is scanning the audience, I am seeing him from the side, and only his face as several well dressed hipsters around a table blocked the full view of the young mans table. I couldnt see what he was sitting by, or what he was wearing. \n\nI walk off the stage now, and aim for the toilets to get a better view. What drew my attention to this young man is that not once during my performance did he look towards the stage, ignored me. He just kept glaring at all the people in the bar, stares at one for a few seconds and moves to the other. He's seen things I thought, something has happened to him in the past and this is what he does. Hes seen something and gets lost in his own mind. I figured it out. There. I enter the toilet\n \nNext act is on the stage now, acoustic guitar, going to play a song with some love lyrics. Not bad, I saw him last week he was pretty good, nice tone in his voice. I dig his Levi's too, are they 501's? Pretty cool guy, wonder if he likes Chon. Probably does, god their riffs are so good, shame about the rest of the song, its like an ultimate hit when those ultra fast riffs let rip and then it kinda has a lackluster feel for the rest of the so-\nYoung mans up on the move, wheres he going, I sit at a table opposite him. Dude must work out as he has his gym bag with him. Hes on the way to the bar, lets see what he orders. Hey I could go up to him I guess, make conversation. Nah, probably not. From what hes wearing I can tell hes probably boring, green army jacket, not really fitting in with the vibes of the bar. Heh. Cant blame him though least hes trying. Denim jeans tho, blue and green should never be seen. My mom told me that its pretty simple to follow. \n\nHes sitting back down hes ordered just a water. Interesting. Is he crying? Yeah he's crying now. \n\nGetting really fucking angry. At these fucking people, what is that fucking faggot staring at me for. Dressed like an aids patient with autism. Keep fucking looking at me you stupid mongoloid fuck. You are making me so fucking angry. All these people, not one of them has a single clue what its like. Ive been up and down every day of my life, I understand the world and how people are, the true nature of them. I know everyone is selfish, I will NEVER find someone like me. Thats it. I know it. All hope has gone, that ship has set sail, heading round the world wont be back till 100 years from now. GOODBYE. My existence is pointless, such wasted talent, I AM SUCH WASTED TALENT. If only.... oh if only they FUCKING KNEW what I know FELT WHAT I FELT. Witnessed what I witnessed. Life is different for us all, they had cushy lives, oh you broke up with your college sweetheart and started self harming on your feet... GEE YOU REALLY HAVE HAD IT TOUGH, I FEEL SO SORRY FOR YOU. These abhorent cunt excuse for human beings make me sick. I NEED TO, I DESERVE TO, THIS IS MY PURPOSE. I NEED TO, I DESERVE TO, THIS IS MY PURPOSE. I NEED TO, I DESERVE TO...\n\nTHIS IS MY PURPOSE!\n\nWow what the fuck is that guy doing, why did he shout that. Absolute douche, god I hope someone ask him to get out. Whats he doing? Is that a fucking gun in his bag? \n\nThe young man pulls out the AK47 he purchased illegally and proudly displays it to the unsuspecting audience, the homosexual whom has narrated the majority of this event sees the weapon being pointed directly at his face, he panics... as is expected of someone with as low testosterone levels as himself. He shrieks in a tone only best described as that of a seagull's shriek. The young man chambers the rifle and fires 2 or 3 rounds into the homosexuals head. The crowd already looking at the young man due to his initial eruption, begin to also panic, but find comfort in that the shooter is white and therefore the worry of a refugee's face on the media is at ease. And the scrape of chairs and glass shattering as people scuffle and race to the exit offers a certain comfort to the young mans ears. He smiles, slightly, comfort in the madness. He fires short bursts into the crowd, they are neat and compact in a line sort of fashion as there is only one exit. Firing 3 round bursts the young man kills and/or critically injures at least 12 people before he has to reload. 12 people all in around 6 seconds, he was elated with the success.\n\nOpening the inside of his green army style jacket, reveals a HP Browning, 2 high explosive grenades, a sawn off shotgun and magazines for the HP Browning all neatly duct taped onto the lining of both sides of the jacket. He takes a single grenade out and puts it into his right pocket, 'save this for later he thought'. Afterwards he takes out the pistol already loaded and chambered, then begins to fire in the still largely populated mess of people fighting for the exit. He fires 13 bullets into the crowd, one person per bullet minus the last bullet, '13 is unlucky i guess' he thought. The young man believes he got fatal shots per shot. The young man was right. People began to fall over the downed and deceased, it was messy. Those who fell arose and were covered and screaming, with blood and pieces of human attached to their clothing and hair and face. Fitting the young man thought, you come into the world screaming in the blood of another, and now I make you leave this life covered in blood and screaming. \n\nHe pulls out the grenade from the right pocket now, as their is a congestion near the exit people begin to pile up. Pulls the pin and lets go, throws the grenade. Lands right in the middle, some of the sheep begin to realise what has been thrown, they scramble away but its too late. They took the brunt of the impact, but the young man still got pushed back some way behind. He looked in awe, the mess it created. Limbs, heads, they were nearly all dead. That was very messy, I did not expect that. It happened a little quick in his opiniom, he was happy but a bit dissapointed he didnt see it ALL. Emptying the pistol and inserting another magazine, he starts to pick off the remaining survivors. 'No survivors' he said, and chuckled nervously. There were maximum 10 people left, most of them were on their way to deah, suffering before death is better than a fast death. A fast death is more than these invalids deserve. Some members of the acoustic band hid behind the stage, THEY THOUGHT THEY COULD HIDE. The young man did not notice the eery silence that was about the room during his episode, there were some screams but it was relatively quiet. As he strolled over with pistol in hand, to the stage, the band (3 of them) pleading with him to let him go. The ponytailed faggot wearing the skinnies and white shirt was the first to go, 2 bullets to the lung, 'choke on your own blood' the young man muttered. The other two were shot once in the face and they spluttered a few words along with some blood with their dying breath, which he could not decipher nor could he care to.\n\nAll had been taken care of, a sense of calm arose over the young mans head. Calm in the madness. He looked at what he had done, no shame only pride. This was his goal, and he had done it. For the first time in a long time, he set out to do something, and did exactly that. He felt proud, and remembered everything he had done, and had done to him. The countless times he nearly got there, only nearly never quite close. A near miss, a contradiction of sorts, a near miss is not a miss at all. It was their time first, now it must be his turn. He always loved her, still did. Clever, but not clever enough to stop caring about it, her. Nice guys always finish last he thought. He reached into the left pocket, where he kept a flask full of whisky and a half empty pack of Malboro Red and a Zippo lighter with an US Army camo. He took it all out, put the flask in one hand, not before he sat down at a bullet battered blood bathed chair mind. He drank the whole lot, and gagged slightly. His body felt warm and tingled. He took a cigarette out of the packet, lit it and began to smoke it. He heard sirens now, getting closer, it was nearly time. He felt good, really good. Smoking this cigarette was bliss. Looking around at the bodies, occassional groans. Dying groanss. So much blood everywhere, wow I really did create a mess didnt I. Sirens close now, he takes the sawn off shotgun hanging from one piece of ductape now and dangling a little, ripping the last remaining tape doing so. It was already loaded with 2 shells. A woman walked by the front door and saw the carnage, I shouted CUNT at her and she ran crying I presume. Sirens were so close now. I laid back on the chair with the 2 front legs in the air, pressed the 2 barrels a little under my chin directly below my brain. I hear more sirens a block away. I say my final goodbyes to her, and pat the letter in my coat. I cry a little, I miss her still, I really did love her. \n\nHe pulls the trigger now and he flies back, both him and the chair. Lying flat with his legs elevated supported by the toppled chair, blood flows from the top of his head seeping through his hair. Blood cries from his eye down towards the ears. He still loves her, he wont learn. He cries blood for her, his heart stopped for her. His brains are on the floor, his life is now no more. He is gone, never existed. Pointless life, pointless acts. He cries blood for her, he is a fool. When will he ever learn. Never.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "5v11w8", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "Read this big important thing", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 1, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_5v11w8", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/5v11w8/read_this_big_important_thing/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1487574248.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/5v11w8/read_this_big_important_thing/", "author_flair_text": null, "quarantine": false, "author": "bombriggedcabin", "created_utc": 1487545448.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.6, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5v11w8", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "ddye3pm", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "bombriggedcabin", "can_mod_post": false, "ups": 2, "parent_id": "t3_5v11w8", "score": 2, "approved_by": null, "downs": 0, "body": "I got sent this its big if true", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I got sent this its big if true&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5v11w8/read_this_big_important_thing/ddye3pm/", "subreddit_type": "public", "name": "t1_ddye3pm", "created": 1487574264.0, "author_flair_text": null, "created_utc": 1487545464.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]