[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What we&amp;#39;ve experienced this election year is similar to what many people experienced a few years ago during Gamergate. While the scope of both events are not even comparable, the motives of establishment players and the reporting tactics used by both media outlets are eerily similar, as if Gamergate was a only microchasm of things to come.&lt;/p&gt;\n\n&lt;p&gt;During Gamergate, it was a tactic of the gaming media to synchronize the release of articles that all emphasize controlled, pre-planned subjects.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Gaming is dead and white men killed it&lt;/p&gt;\n\n&lt;p&gt;Feminism is being attacked by disgusting white males&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Gamer&amp;quot; now has no meaning, let&amp;#39;s take it back in the name of all that is good&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It isn&amp;#39;t verbatim and I&amp;#39;m not trying to make a super solid research paper entry here, but these are all talking points I recall being released at the same time. It helped them change the general narrative to &amp;quot;the gaming media and establishment players are being attacked by savages&amp;quot;, rather than focus on what was really happening, which was corruption. It might seem funny to call it corruption considering what industry it&amp;#39;s in, but that&amp;#39;s what it is.&lt;/p&gt;\n\n&lt;p&gt;I would say that the corrupt, shadowy nature of the indie games industry continues on today. I can&amp;#39;t bring up Gamergate with someone without them just assuming I&amp;#39;m a feminism hating men&amp;#39;s rights activist when this had nothing to do with that in the first place, so I guess their tactics worked and even resonated.&lt;/p&gt;\n\n&lt;p&gt;While so many people saw through it, it was a small group of people on imageboards and subreddits compared to all of the daily users of PCGamer, RockPaperScissors, Neogaf, etc. In hindsight there was really no competition, they smoked us with the numbers game and they changed and controlled the narrative.&lt;/p&gt;\n\n&lt;p&gt;These daily users are what I refer to as the most militant of the left, and I would compare their tactics to the Red Guard. They feel so absolutely right and morally superior they think that their ideals should be imposed into every medium of art, every aspect of society, and be forced onto every person. They are not proponents of free or critical thought (I doubt they can do much of it themselves), nor are they receptive to the idea of democracy or majority vote when (only) their ideals are voted against. &lt;/p&gt;\n\n&lt;p&gt;This is the kind of behavior that seems to have gotten more and more popular with people in the past few years, that so-called political pendulum being pushed as hard as possible from the center to the left by people like Zoe Quinn and groups like Blacks Live Matter in some kind of Hail Mary to have their agenda stick once and for all. They made documentaries, got to talk at the UN, they beat up certain political candidate supporters, they shot at police. It all started to snowball. At some point, they lost their grip and the pendulum started to swing back hard, but just barely hard enough.&lt;/p&gt;\n\n&lt;p&gt;If Hillary Clinton won, these types of people would be vindicated and even feel justified in their actions, and the militant minority of radical liberals would have a very real voice. Black Lives Matter, all these subreddits that point at and laugh/yell at Trump supporters for supporting a candidate, all these media outlets (big and small) that put the worst meanings possible behind Trump&amp;#39;s phrasing, all do their part to perpetuate the hate and division that targeted anyone who even remotely had a dissenting opinion from theirs. It was truly a last ditch attempt to grab back hold of that pendulum and they almost succeeded.&lt;/p&gt;\n\n&lt;p&gt;I have been demonized many times in discussions, my arguments often ignored immediately if I say one little wrong thing that the person I&amp;#39;m talking to finds &amp;quot;offensive&amp;quot;, then they release the self righteous floodgates by calling me just another stupid obnoxious Trumpet when in reality he had no idea who I voted for or why, but only uses it as an excuse to try and silence me.&lt;/p&gt;\n\n&lt;p&gt;While Trump may have won the election, he won it because of normal working class Americans coming out in droves. A true silent majority was waiting to vote for him. He won the vote that is quite literally the opposite of what I explained the radical left to be, but it makes me extremely uncomfortable when looking at the popular vote and looking at how easily the rust belt could have given it to Clinton.&lt;/p&gt;\n\n&lt;p&gt;The feminization of society has been stopped, but for how long? They almost smoked us at the numbers game again.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "What we've experienced this election year is similar to what many people experienced a few years ago during Gamergate. While the scope of both events are not even comparable, the motives of establishment players and the reporting tactics used by both media outlets are eerily similar, as if Gamergate was a only microchasm of things to come.\n\nDuring Gamergate, it was a tactic of the gaming media to synchronize the release of articles that all emphasize controlled, pre-planned subjects.\n\n&gt;Gaming is dead and white men killed it\n\n&gt;Feminism is being attacked by disgusting white males\n\n&gt;\"Gamer\" now has no meaning, let's take it back in the name of all that is good\n\nIt isn't verbatim and I'm not trying to make a super solid research paper entry here, but these are all talking points I recall being released at the same time. It helped them change the general narrative to \"the gaming media and establishment players are being attacked by savages\", rather than focus on what was really happening, which was corruption. It might seem funny to call it corruption considering what industry it's in, but that's what it is.\n\nI would say that the corrupt, shadowy nature of the indie games industry continues on today. I can't bring up Gamergate with someone without them just assuming I'm a feminism hating men's rights activist when this had nothing to do with that in the first place, so I guess their tactics worked and even resonated.\n\nWhile so many people saw through it, it was a small group of people on imageboards and subreddits compared to all of the daily users of PCGamer, RockPaperScissors, Neogaf, etc. In hindsight there was really no competition, they smoked us with the numbers game and they changed and controlled the narrative.\n\nThese daily users are what I refer to as the most militant of the left, and I would compare their tactics to the Red Guard. They feel so absolutely right and morally superior they think that their ideals should be imposed into every medium of art, every aspect of society, and be forced onto every person. They are not proponents of free or critical thought (I doubt they can do much of it themselves), nor are they receptive to the idea of democracy or majority vote when (only) their ideals are voted against. \n\nThis is the kind of behavior that seems to have gotten more and more popular with people in the past few years, that so-called political pendulum being pushed as hard as possible from the center to the left by people like Zoe Quinn and groups like Blacks Live Matter in some kind of Hail Mary to have their agenda stick once and for all. They made documentaries, got to talk at the UN, they beat up certain political candidate supporters, they shot at police. It all started to snowball. At some point, they lost their grip and the pendulum started to swing back hard, but just barely hard enough.\n\nIf Hillary Clinton won, these types of people would be vindicated and even feel justified in their actions, and the militant minority of radical liberals would have a very real voice. Black Lives Matter, all these subreddits that point at and laugh/yell at Trump supporters for supporting a candidate, all these media outlets (big and small) that put the worst meanings possible behind Trump's phrasing, all do their part to perpetuate the hate and division that targeted anyone who even remotely had a dissenting opinion from theirs. It was truly a last ditch attempt to grab back hold of that pendulum and they almost succeeded.\n\nI have been demonized many times in discussions, my arguments often ignored immediately if I say one little wrong thing that the person I'm talking to finds \"offensive\", then they release the self righteous floodgates by calling me just another stupid obnoxious Trumpet when in reality he had no idea who I voted for or why, but only uses it as an excuse to try and silence me.\n\nWhile Trump may have won the election, he won it because of normal working class Americans coming out in droves. A true silent majority was waiting to vote for him. He won the vote that is quite literally the opposite of what I explained the radical left to be, but it makes me extremely uncomfortable when looking at the popular vote and looking at how easily the rust belt could have given it to Clinton.\n\nThe feminization of society has been stopped, but for how long? They almost smoked us at the numbers game again.\n\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "5c3vm3", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "The self victimization of the left, the radical minority of intersectionalists that push an extreme political agenda, and the political pendulum.", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 1, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": 1478727508.0, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_5c3vm3", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/5c3vm3/the_self_victimization_of_the_left_the_radical/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1478755976.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/5c3vm3/the_self_victimization_of_the_left_the_radical/", "author_flair_text": null, "quarantine": false, "author": "gay_hank", "created_utc": 1478727176.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.71, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5c3vm3", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d9tkime", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 4, "parent_id": "t3_5c3vm3", "score": 4, "approved_by": null, "downs": 0, "body": "My advice to you would be not to argue with people that don't understand the concept of respecting other peoples' believes and opinions. These people have adopted an ideology which basically is a reincarnation of communism and they look at their opponents in exactly the same way as the old communists did. Your arguments don't matter to them at all, you're not a human being and your existence is nothing but a threat to these peoples' utopia. Their main goals are unrealistic equality at the cost of freedom, suppression of the opposition and a bigger government. Sure, many followers are just aimlessly repeating what they've been told to be the truth, without having a single clue of what they really want, but that was pretty much the case with communism as well.  \n\nIt's not the first time western society has been divided like it is today. In times like this it's important to stick with your own tribe, and being ready to strike at the opponent at the right time whenever they show signs weakness. Don't trust your neighbors, shake with your right hand while holding a rock in your left. Organize yourselves, not just online but in real life. And don't be afraid - Unless you've got something to die for you're not alive.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My advice to you would be not to argue with people that don&amp;#39;t understand the concept of respecting other peoples&amp;#39; believes and opinions. These people have adopted an ideology which basically is a reincarnation of communism and they look at their opponents in exactly the same way as the old communists did. Your arguments don&amp;#39;t matter to them at all, you&amp;#39;re not a human being and your existence is nothing but a threat to these peoples&amp;#39; utopia. Their main goals are unrealistic equality at the cost of freedom, suppression of the opposition and a bigger government. Sure, many followers are just aimlessly repeating what they&amp;#39;ve been told to be the truth, without having a single clue of what they really want, but that was pretty much the case with communism as well.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not the first time western society has been divided like it is today. In times like this it&amp;#39;s important to stick with your own tribe, and being ready to strike at the opponent at the right time whenever they show signs weakness. Don&amp;#39;t trust your neighbors, shake with your right hand while holding a rock in your left. Organize yourselves, not just online but in real life. And don&amp;#39;t be afraid - Unless you&amp;#39;ve got something to die for you&amp;#39;re not alive.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/5c3vm3/the_self_victimization_of_the_left_the_radical/d9tkime/", "subreddit_type": "public", "name": "t1_d9tkime", "created": 1478763185.0, "author_flair_text": null, "created_utc": 1478734385.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]