[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://imgur.com/AeBuHpf\"&gt;Proof!&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Sorry, i as i was writing i wanted to tell the whole story, and that ended up making it crazy long. I had met Nick during a trip to Rhode Island. When we met he was a really confident man&amp;#39;s man, but when it came to getting physical with another guy he got really shy, it was cute. To date, I&amp;#39;m the only guy he&amp;#39;s fooled around with more than just jerking off on the same couch. After the fun in RI, i graduated and i didn&amp;#39;t run into him for quite a while.&lt;/p&gt;\n\n&lt;p&gt;Visiting friends in Portland is what brought us back together. Typical bachelor party, nothing too exciting until i see Nick. If you didn&amp;#39;t read the first story yet, Nick is a big man. Easily 6&amp;#39;4&amp;#39;&amp;#39; and thick in all the right places. Very muscular but still a little bit of extra padding, which personally, i love. I love thick meaty men who can toss me around and Nick is perfect for that. He&amp;#39;s still playing for the football team, still hot as all hell, but unfortunately he&amp;#39;s got a short little girl hanging on him.&lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s a short tiny little thing, tan, possibly Hispanic, athletic, very small, and evidently enjoys large men the same way i do. I did get a little turned on thinking of what it was like for a small girl like her to get fucked by a massive brute like Nick. As I&amp;#39;m hovering at a distance I&amp;#39;m keeping an eye on Nick, at the very least he&amp;#39;s easy on the eyes, and we make eye contact which prompts a nod and a smile, not a big smile, just a friendly smile. A while later I notice him and his girlfriend looking at me and talking to each other. I get a little self conscious, and then straight up panicky when they walk up to me.&lt;/p&gt;\n\n&lt;p&gt;He starts off by saying hello and introducing his girlfriend, (I&amp;#39;ll call her Charls, she had a very &amp;quot;Charls&amp;quot; vibe), everything is very normal, and i&amp;#39;m just thinking to myself &amp;quot;don&amp;#39;t let her know that her boyfriend was balls deep inside me a year ago&amp;quot;. Conversation&amp;#39;s pretty normal, but then she brings up the times Nick and I fooled around. I look up at him and he looks at me sheepishly before saying &amp;quot;she&amp;#39;s really into it, so i told once we had been dating for a while that I&amp;#39;ve hooked up with a guy&amp;quot;. She starts probing me about how he was, what else I&amp;#39;ve done, and what i was interested in. I go into how Nick is exactly my type and how we had a lot of fun. She gives Nick a look and he asks me if i&amp;#39;d like to fool around again with Charls in the room. I agreed pretty quickly, perhaps a bit to eager to get Nick on top of me again.&lt;/p&gt;\n\n&lt;p&gt;We didn&amp;#39;t leave the party immediately, but when she&amp;#39;s ready to go she pulls me by my belt and we go. On the way to Nick&amp;#39;s room Nick and I catch up a bit. He says she&amp;#39;s great, and pretty crazy, and that she loved hearing about him and I. He&amp;#39;s pretty excited to do this again, he wanted to try with another guy but he could never talk himself into it, and neither could Charls, but since he&amp;#39;d already been with me it was easier on him.&lt;/p&gt;\n\n&lt;p&gt;We get to his apartment and Charls is all over him in the entry way, kissing him pretty intensely but then stops quickly and says &amp;quot;alright this is more for you guys.&amp;quot; We start kissing slowly at first, both of us glancing over at her repeatedly but she always motions for us to pay attention to each other. I lose my shirt and tell Nick &amp;quot;just fucking give it to me&amp;quot; and he takes my advice. He slams me against the wall hard, kissing me, grinding his whole body against me, lifting me up so that i can wrap my legs around his waist. The slam was decently hard, but it sounded much harder than it felt, and i can hear Charls say &amp;quot;holy shit&amp;quot; under her breath as she&amp;#39;s watching us. My exhibitionist streak goes off and i can&amp;#39;t help but smile at her reaction. He starts to struggle holding me up against the wall, so he tells me to wrap my arms around the back of his neck, and then proceeds to carry me through the apartment to his bed, Charls following behind.&lt;/p&gt;\n\n&lt;p&gt;He drops me on his bed so that i&amp;#39;m on my back, my legs still wrapped around him. Charls starts kissing him for a bit before letting him get back to me. He&amp;#39;s towering over me while i&amp;#39;m on my back, and he pulls off my pants first so that i&amp;#39;m naked now, and he peels his shirt off from the bottom up. He had to be doing it to show off because he made it a painfully slow strip tease. He&amp;#39;s still got jeans on, but that doesn&amp;#39;t stop him from leaning over me and grinding into me, his cock straining against the denim. Charls has perched on the corner of the bed still giving us plenty of room to spread out and do our thing, but she&amp;#39;s undone her pants and is giving herself a little attention.&lt;/p&gt;\n\n&lt;p&gt;I tap his side and signal for him to get on his back so that i can pull his pants off. Quickly i dive onto his cock, not wasting anytime getting him in my mouth. I go to town, moaning and slurping his cock to put on a show for Charls, and to see how worked up I can get him. I can tell i&amp;#39;m already getting him close, but i keep working him till he&amp;#39;s twitching and squirming to hold back his load. But i back off before anything happens, not about to end this thing early.&lt;/p&gt;\n\n&lt;p&gt;Giving him a moment to recover, i lay down next to him and he gets on his knees a the edge of the bed. This time around he&amp;#39;s much more physical while blowing me. This time he&amp;#39;s running his hands all over my body while he sucks, his hands pulling my hips into his mouth, then roaming up my stomach to play with my nipples, really working me over. I have to tap his head and he comes off smiling, remembering how last time he didn&amp;#39;t know the signal and got a mouthful of cum.&lt;/p&gt;\n\n&lt;p&gt;I roll to my stomach and put my ass up in the air for him. Charls has been muttering things like &amp;quot;holy fuck&amp;quot; and &amp;quot;god damn&amp;quot; as we&amp;#39;ve played around but now she&amp;#39;s watching speechless as he lubes himself up and puts some on my hole. I dives into me moderately fast and then i feel his chest press into me, his stomach molding to the the arch in the small of my back, and his full weight pinning me to the bed. I almost laugh but at the same time moan. He slides his hand under my arm, and under my chest till he&amp;#39;s holding till he&amp;#39;s holding on to where my neck meets my shoulder on the opposite side. He props himself on his other elbow, his forearm passing under my neck. I feel enveloped by his massive frame, like he&amp;#39;s pulling me into him. His pace starts off slow, deliberate, and powerful. He&amp;#39;s grinding his cock into me, slowly, kissing the back of my head and neck. Charls is furiously fingering her self on the edge of the bed.&lt;/p&gt;\n\n&lt;p&gt;Nick&amp;#39;s attention is shifting between her and I, but he never stops bucking. I try to work my ass for him, but there&amp;#39;s little i can do, he&amp;#39;s got a death grip on me, which isn&amp;#39;t a problem for me. Charls starts talking dirty, asking how i feel, telling Nick to give it to me, and saying &amp;#39;what&amp;#39;s next?&amp;#39;. Nick&amp;#39;s talking dirty too, asking if i can take more and if i&amp;#39;ve ever listened to Eagulls . I tell Nick to fuck me harder than he fucks Charls, Charls loves the idea, but Nick keeps telling me i can&amp;#39;t handle it, trying to indicate he could hurt me but keeping in character. But i kinda change tone to very serious and tell him &amp;quot;seriously, give it to me hard, i can take it&amp;quot;. He asks me in a serious tone now, not in a dirty talk kind of way if i can really handle it, and i reassure him that i&amp;#39;ve been fucked pretty rough before, and that i&amp;#39;ll let him know if he&amp;#39;s too much.&lt;/p&gt;\n\n&lt;p&gt;Gradually he picks up his pace, propping himself up on his hands to start fucking hard. I keep saying harder, over and over and Charls is making excited noises as she watches. Nick reaches a fever pitch, and he&amp;#39;s giving me a bit of discomfort but i&amp;#39;m not about to stop him now. Charls is almost shouting at Nick, telling him to fuck the shit out me. I can tell now that he&amp;#39;s never fucked her that hard. So i get a fist full of sheets and hang on for dear life. He&amp;#39;s fucking me so hard it&amp;#39;s grinding my cock against the bed and i come from it. It isn&amp;#39;t long after that he starts muttering &amp;quot;oh fuck&amp;quot; repeatedly. I clench for him, milking his cock for his load, and he obliges, pulling my body so tightly against his that he&amp;#39;s hurting me. My ass on fire, feeling like it&amp;#39;s ripped, but now he&amp;#39;s nearly comatose on top of me.&lt;/p&gt;\n\n&lt;p&gt;I reach up and scratch the back of his head and run my fingers through his hair. Charls&amp;#39;s floored, she climaxed sometime during the festivities and is watching us catch our breath. I ask if i can make out with Nick, and she answers with an enthusiastic nod. He rolls off me and we kiss, exhausted but i find the energy to caress every inch of his glorious body. wrapping my legs up in his. At some point Charls cozies up on the other side of him and he&amp;#39;s in the middle with an arm around each of us as Charls and i run our fingers over his chest.&lt;/p&gt;\n\n&lt;p&gt;It ended with a phone number swap, a promise to hang out again, and me limping back to my friends house.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[Proof!](http://imgur.com/AeBuHpf)\n\nSorry, i as i was writing i wanted to tell the whole story, and that ended up making it crazy long. I had met Nick during a trip to Rhode Island. When we met he was a really confident man's man, but when it came to getting physical with another guy he got really shy, it was cute. To date, I'm the only guy he's fooled around with more than just jerking off on the same couch. After the fun in RI, i graduated and i didn't run into him for quite a while.\n\nVisiting friends in Portland is what brought us back together. Typical bachelor party, nothing too exciting until i see Nick. If you didn't read the first story yet, Nick is a big man. Easily 6'4'' and thick in all the right places. Very muscular but still a little bit of extra padding, which personally, i love. I love thick meaty men who can toss me around and Nick is perfect for that. He's still playing for the football team, still hot as all hell, but unfortunately he's got a short little girl hanging on him.\n\nShe's a short tiny little thing, tan, possibly Hispanic, athletic, very small, and evidently enjoys large men the same way i do. I did get a little turned on thinking of what it was like for a small girl like her to get fucked by a massive brute like Nick. As I'm hovering at a distance I'm keeping an eye on Nick, at the very least he's easy on the eyes, and we make eye contact which prompts a nod and a smile, not a big smile, just a friendly smile. A while later I notice him and his girlfriend looking at me and talking to each other. I get a little self conscious, and then straight up panicky when they walk up to me.\n\nHe starts off by saying hello and introducing his girlfriend, (I'll call her Charls, she had a very \"Charls\" vibe), everything is very normal, and i'm just thinking to myself \"don't let her know that her boyfriend was balls deep inside me a year ago\". Conversation's pretty normal, but then she brings up the times Nick and I fooled around. I look up at him and he looks at me sheepishly before saying \"she's really into it, so i told once we had been dating for a while that I've hooked up with a guy\". She starts probing me about how he was, what else I've done, and what i was interested in. I go into how Nick is exactly my type and how we had a lot of fun. She gives Nick a look and he asks me if i'd like to fool around again with Charls in the room. I agreed pretty quickly, perhaps a bit to eager to get Nick on top of me again.\n\nWe didn't leave the party immediately, but when she's ready to go she pulls me by my belt and we go. On the way to Nick's room Nick and I catch up a bit. He says she's great, and pretty crazy, and that she loved hearing about him and I. He's pretty excited to do this again, he wanted to try with another guy but he could never talk himself into it, and neither could Charls, but since he'd already been with me it was easier on him.\n\nWe get to his apartment and Charls is all over him in the entry way, kissing him pretty intensely but then stops quickly and says \"alright this is more for you guys.\" We start kissing slowly at first, both of us glancing over at her repeatedly but she always motions for us to pay attention to each other. I lose my shirt and tell Nick \"just fucking give it to me\" and he takes my advice. He slams me against the wall hard, kissing me, grinding his whole body against me, lifting me up so that i can wrap my legs around his waist. The slam was decently hard, but it sounded much harder than it felt, and i can hear Charls say \"holy shit\" under her breath as she's watching us. My exhibitionist streak goes off and i can't help but smile at her reaction. He starts to struggle holding me up against the wall, so he tells me to wrap my arms around the back of his neck, and then proceeds to carry me through the apartment to his bed, Charls following behind.\n\nHe drops me on his bed so that i'm on my back, my legs still wrapped around him. Charls starts kissing him for a bit before letting him get back to me. He's towering over me while i'm on my back, and he pulls off my pants first so that i'm naked now, and he peels his shirt off from the bottom up. He had to be doing it to show off because he made it a painfully slow strip tease. He's still got jeans on, but that doesn't stop him from leaning over me and grinding into me, his cock straining against the denim. Charls has perched on the corner of the bed still giving us plenty of room to spread out and do our thing, but she's undone her pants and is giving herself a little attention.\n\nI tap his side and signal for him to get on his back so that i can pull his pants off. Quickly i dive onto his cock, not wasting anytime getting him in my mouth. I go to town, moaning and slurping his cock to put on a show for Charls, and to see how worked up I can get him. I can tell i'm already getting him close, but i keep working him till he's twitching and squirming to hold back his load. But i back off before anything happens, not about to end this thing early.\n\nGiving him a moment to recover, i lay down next to him and he gets on his knees a the edge of the bed. This time around he's much more physical while blowing me. This time he's running his hands all over my body while he sucks, his hands pulling my hips into his mouth, then roaming up my stomach to play with my nipples, really working me over. I have to tap his head and he comes off smiling, remembering how last time he didn't know the signal and got a mouthful of cum.\n\nI roll to my stomach and put my ass up in the air for him. Charls has been muttering things like \"holy fuck\" and \"god damn\" as we've played around but now she's watching speechless as he lubes himself up and puts some on my hole. I dives into me moderately fast and then i feel his chest press into me, his stomach molding to the the arch in the small of my back, and his full weight pinning me to the bed. I almost laugh but at the same time moan. He slides his hand under my arm, and under my chest till he's holding till he's holding on to where my neck meets my shoulder on the opposite side. He props himself on his other elbow, his forearm passing under my neck. I feel enveloped by his massive frame, like he's pulling me into him. His pace starts off slow, deliberate, and powerful. He's grinding his cock into me, slowly, kissing the back of my head and neck. Charls is furiously fingering her self on the edge of the bed.\n\nNick's attention is shifting between her and I, but he never stops bucking. I try to work my ass for him, but there's little i can do, he's got a death grip on me, which isn't a problem for me. Charls starts talking dirty, asking how i feel, telling Nick to give it to me, and saying 'what's next?'. Nick's talking dirty too, asking if i can take more and if i've ever listened to Eagulls . I tell Nick to fuck me harder than he fucks Charls, Charls loves the idea, but Nick keeps telling me i can't handle it, trying to indicate he could hurt me but keeping in character. But i kinda change tone to very serious and tell him \"seriously, give it to me hard, i can take it\". He asks me in a serious tone now, not in a dirty talk kind of way if i can really handle it, and i reassure him that i've been fucked pretty rough before, and that i'll let him know if he's too much.\n\nGradually he picks up his pace, propping himself up on his hands to start fucking hard. I keep saying harder, over and over and Charls is making excited noises as she watches. Nick reaches a fever pitch, and he's giving me a bit of discomfort but i'm not about to stop him now. Charls is almost shouting at Nick, telling him to fuck the shit out me. I can tell now that he's never fucked her that hard. So i get a fist full of sheets and hang on for dear life. He's fucking me so hard it's grinding my cock against the bed and i come from it. It isn't long after that he starts muttering \"oh fuck\" repeatedly. I clench for him, milking his cock for his load, and he obliges, pulling my body so tightly against his that he's hurting me. My ass on fire, feeling like it's ripped, but now he's nearly comatose on top of me.\n\nI reach up and scratch the back of his head and run my fingers through his hair. Charls's floored, she climaxed sometime during the festivities and is watching us catch our breath. I ask if i can make out with Nick, and she answers with an enthusiastic nod. He rolls off me and we kiss, exhausted but i find the energy to caress every inch of his glorious body. wrapping my legs up in his. At some point Charls cozies up on the other side of him and he's in the middle with an arm around each of us as Charls and i run our fingers over his chest.\n\nIt ended with a phone number swap, a promise to hang out again, and me limping back to my friends house.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "50yuxl", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "So I met Nick and Charls last night...", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/eltaPeqvW0mbDSzd2oZIicpjYAMbSPvnHcyvLw6pw_M.jpg?s=a320908c2c10b8a7c5a3e8a93cf7dbf7", "width": 960, "height": 1280}, "resolutions": [{"url": "https://i.redditmedia.com/eltaPeqvW0mbDSzd2oZIicpjYAMbSPvnHcyvLw6pw_M.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=c2df4ef18ece271f69985bd1cf59ad7d", "width": 108, "height": 144}, {"url": "https://i.redditmedia.com/eltaPeqvW0mbDSzd2oZIicpjYAMbSPvnHcyvLw6pw_M.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=61c6be7ca7966ed44584d4d1d45b97a7", "width": 216, "height": 288}, {"url": "https://i.redditmedia.com/eltaPeqvW0mbDSzd2oZIicpjYAMbSPvnHcyvLw6pw_M.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=871e17fc81e960fa0b73a379cc5a4df2", "width": 320, "height": 426}, {"url": "https://i.redditmedia.com/eltaPeqvW0mbDSzd2oZIicpjYAMbSPvnHcyvLw6pw_M.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=5587f09d1a7076392aae8a1c33ae9f02", "width": 640, "height": 853}, {"url": "https://i.redditmedia.com/eltaPeqvW0mbDSzd2oZIicpjYAMbSPvnHcyvLw6pw_M.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=90c6955a28aecb0ea92d101406fa1f2f", "width": 960, "height": 1280}], "variants": {}, "id": "m6dWL-rDdQHtE9bZ_LpZ1QEz2cmCURs5vDgzVpgY5Ek"}], "enabled": false}, "num_comments": 6, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "post_hint": "self", "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_50yuxl", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/50yuxl/so_i_met_nick_and_charls_last_night/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1472939095.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/50yuxl/so_i_met_nick_and_charls_last_night/", "author_flair_text": null, "quarantine": false, "author": "bentwookiee69", "created_utc": 1472910295.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.48, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50yuxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50yuxl", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d781lic", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "CornPhilips", "can_mod_post": false, "ups": 1, "parent_id": "t1_d77zg05", "score": 1, "approved_by": null, "downs": 0, "body": "I live to die another day", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I live to die another day&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50yuxl/so_i_met_nick_and_charls_last_night/d781lic/", "subreddit_type": "public", "name": "t1_d781lic", "created": 1472944820.0, "author_flair_text": "if a man be havin a forked tongue, he may be a snake", "created_utc": 1472916020.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d77zg05", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 12, "parent_id": "t3_50yuxl", "score": 12, "approved_by": null, "downs": 0, "body": "if u read this whole thing yous a homo now", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;if u read this whole thing yous a homo now&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50yuxl/so_i_met_nick_and_charls_last_night/d77zg05/", "subreddit_type": "public", "name": "t1_d77zg05", "created": 1472940803.0, "author_flair_text": null, "created_utc": 1472912003.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50yuxl", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d780gjp", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "kebordworyr", "can_mod_post": false, "ups": 7, "parent_id": "t3_50yuxl", "score": 7, "approved_by": null, "downs": 0, "body": "thought i was readin harry potter for a sec wow such a talented writer", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thought i was readin harry potter for a sec wow such a talented writer&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50yuxl/so_i_met_nick_and_charls_last_night/d780gjp/", "subreddit_type": "public", "name": "t1_d780gjp", "created": 1472942779.0, "author_flair_text": "round eye", "created_utc": 1472913979.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50yuxl", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d780m5e", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "mcmanchild", "can_mod_post": false, "ups": 8, "parent_id": "t3_50yuxl", "score": 8, "approved_by": null, "downs": 0, "body": "boooooo. we collectively hated it boo", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;boooooo. we collectively hated it boo&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50yuxl/so_i_met_nick_and_charls_last_night/d780m5e/", "subreddit_type": "public", "name": "t1_d780m5e", "created": 1472943061.0, "author_flair_text": null, "created_utc": 1472914261.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50yuxl", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d78qyvi", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Froggy__", "can_mod_post": false, "ups": 3, "parent_id": "t3_50yuxl", "score": 3, "approved_by": null, "downs": 0, "body": "What the fuck is wrong with you", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What the fuck is wrong with you&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50yuxl/so_i_met_nick_and_charls_last_night/d78qyvi/", "subreddit_type": "public", "name": "t1_d78qyvi", "created": 1472988329.0, "author_flair_text": "surprise surprise", "created_utc": 1472959529.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50yuxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_50yuxl", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d77zexd", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 3, "parent_id": "t1_d77yrgh", "score": 3, "approved_by": null, "downs": 0, "body": "dude there are still 2 episodes left, plus who knows what the future holds", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;dude there are still 2 episodes left, plus who knows what the future holds&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50yuxl/so_i_met_nick_and_charls_last_night/d77zexd/", "subreddit_type": "public", "name": "t1_d77zexd", "created": 1472940743.0, "author_flair_text": null, "created_utc": 1472911943.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d77yrgh", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 3, "parent_id": "t3_50yuxl", "score": 3, "approved_by": null, "downs": 0, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "collapsed": true, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/50yuxl/so_i_met_nick_and_charls_last_night/d77yrgh/", "subreddit_type": "public", "name": "t1_d77yrgh", "created": 1472939325.0, "author_flair_text": null, "created_utc": 1472910525.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]