[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had the idea of making a comic book about a drag queen superhero who fights hate crimes for years but because I had never done a comic book I let it get in the way of creating it. After you know who was elected I felt so defeated. I worked on the Hillary campaign. I knew what was at stake and what it would mean if Trump became president. For many the hate he awoken was something new. Growing up I lived with that kind of hate. I&amp;#39;ve worked hard to get away from it. It&amp;#39;s taken me twenty some years. So when he became president it was like my past came back into my world and it was all too much to take. It&amp;#39;s one thing to know your family is filled full of hate but to know millions voted for a man like Trump crippled me for months. I would go out into public wondering if the people I ran into voted for Trump. I noticed myself acting different. I can&amp;#39;t let them know I&amp;#39;m gay. Will they harass me or worse attack me?&lt;/p&gt;\n\n&lt;p&gt;When I was growing up in rural Michigan I didn&amp;#39;t have a lot of people to look up to, especially who were like me. So I looked to Wonder Woman and Superman. I grew up in a very religious family and being gay was an abomination. I grew up hating myself because of who I was. I was never kicked out but I was rejected and treated horribly by the people who were suppose to love and support me.&lt;/p&gt;\n\n&lt;p&gt;I know what that kind of hate does to a child and it breaks my heart to know that so many are facing this kind of hate today, especially now that you know who is in office. While things have gotten better for some that&amp;#39;s not the case for all. So many children who live in rural america have nowhere to turn. They don&amp;#39;t have community centers to go to. Many get kicked to the curb and face alarming suicide rates. Just recently a couple who started a gay pride near me had their house burned to the ground because they were gay.&lt;/p&gt;\n\n&lt;p&gt;Recently I&amp;#39;ve started to venture back out into the world and have started back on Dragzilla. The comic takes place in a fictional world where it&amp;#39;s illegal to be gay. A mix between modern times and the 70&amp;#39;s in NYC and San Fran. One night the main character (alter ego) is brutally attacked by Roid Rage (the main villain) after leaving the Triangle connection, a secret club for LGBTQ people. Left for dead he cries out for help and in his hour of a need a fairy drag-mother rescues him. Glimmer gives him a gift, the ability to transform into a drag queen superhero and become the hero that the queer community of Straightlandia desperately needs.&lt;/p&gt;\n\n&lt;p&gt;During the day Dragzilla is a shy, insecure gay man. At night he&amp;#39;s a confident, strong drag queen who fights hate crimes one high kick at a time. I wanted to have a stark contrast from alter ego to superhero. Andrew is based on me. How does he transform into Dragzilla when he&amp;#39;s got a beard you might ask. Glimmer gives him magical duct tape (Super Tuck) that he uses to transform whenever he needs to.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s really important that my comic book be as diverse as possible. Glimmer is the goddess like entity who becomes Dragzilla&amp;#39;s fairy drag-mother. If a movie is ever made I envision either Beyonce or Lucy Liu playing her. Why not dream big? One of the main characters is Miss Connection. She runs Dragzilla&amp;#39;s base of operations. Miss Connection is transgender as well. Electric is Dragzilla&amp;#39;s best friend, who is straight. She runs the Triangle Connection (a secret club that&amp;#39;s a sanctuary for LGBTQ) behind her beauty salon. The main villain is Roid Rage. He&amp;#39;s very homophobic and lives in the gym he owns. RR roams the streets of Straightlandia looking for gay people to hurt. He carries around a weight bar with a weight at the end of it, that he uses to attack others with. The Meatheads are two henchmen who follow Roid Rage wherever he goes. Often they cause more trouble than they&amp;#39;re worth to RR.\nSo now more than ever our world needs heroes like Dragzilla. She might be fictional but she represents so many in this world. You don&amp;#39;t need superpowers to be a hero. You just need the will, heart and fight. I hope that Dragzilla will inspire others to stand up in their own world. Art is great because not only is it therapeutic but it evokes emotion in others and can make a real difference.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t you wish we had a drag queen superhero? I know I do. I hope that the comic could make a difference to anyone who feels different whether they&amp;#39;re lgbt or not especially our youth. So many just need a light turned on. I hope Dragzilla becomes that light. I know it has been for me.&lt;/p&gt;\n\n&lt;p&gt;Here are some illustrations that I&amp;#39;ve been working on and I&amp;#39;m excited to share them with you. Let me know what you think. Ultimately Dragzilla is me, or the person I wish I was more like. I&amp;#39;m putting my heart and soul into Dragzilla and her story, and I hope that others love her as much as I do.&lt;/p&gt;\n\n&lt;p&gt;So many are still scared and feel powerless. I hope that Dragzilla will remind them that they too can take action. You don&amp;#39;t need superpowers to make a difference.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://imgur.com/9802G58\"&gt;http://imgur.com/9802G58&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've had the idea of making a comic book about a drag queen superhero who fights hate crimes for years but because I had never done a comic book I let it get in the way of creating it. After you know who was elected I felt so defeated. I worked on the Hillary campaign. I knew what was at stake and what it would mean if Trump became president. For many the hate he awoken was something new. Growing up I lived with that kind of hate. I've worked hard to get away from it. It's taken me twenty some years. So when he became president it was like my past came back into my world and it was all too much to take. It's one thing to know your family is filled full of hate but to know millions voted for a man like Trump crippled me for months. I would go out into public wondering if the people I ran into voted for Trump. I noticed myself acting different. I can't let them know I'm gay. Will they harass me or worse attack me?\n\nWhen I was growing up in rural Michigan I didn't have a lot of people to look up to, especially who were like me. So I looked to Wonder Woman and Superman. I grew up in a very religious family and being gay was an abomination. I grew up hating myself because of who I was. I was never kicked out but I was rejected and treated horribly by the people who were suppose to love and support me.\n\nI know what that kind of hate does to a child and it breaks my heart to know that so many are facing this kind of hate today, especially now that you know who is in office. While things have gotten better for some that's not the case for all. So many children who live in rural america have nowhere to turn. They don't have community centers to go to. Many get kicked to the curb and face alarming suicide rates. Just recently a couple who started a gay pride near me had their house burned to the ground because they were gay.\n\nRecently I've started to venture back out into the world and have started back on Dragzilla. The comic takes place in a fictional world where it's illegal to be gay. A mix between modern times and the 70's in NYC and San Fran. One night the main character (alter ego) is brutally attacked by Roid Rage (the main villain) after leaving the Triangle connection, a secret club for LGBTQ people. Left for dead he cries out for help and in his hour of a need a fairy drag-mother rescues him. Glimmer gives him a gift, the ability to transform into a drag queen superhero and become the hero that the queer community of Straightlandia desperately needs.\n\nDuring the day Dragzilla is a shy, insecure gay man. At night he's a confident, strong drag queen who fights hate crimes one high kick at a time. I wanted to have a stark contrast from alter ego to superhero. Andrew is based on me. How does he transform into Dragzilla when he's got a beard you might ask. Glimmer gives him magical duct tape (Super Tuck) that he uses to transform whenever he needs to.\n\nIt's really important that my comic book be as diverse as possible. Glimmer is the goddess like entity who becomes Dragzilla's fairy drag-mother. If a movie is ever made I envision either Beyonce or Lucy Liu playing her. Why not dream big? One of the main characters is Miss Connection. She runs Dragzilla's base of operations. Miss Connection is transgender as well. Electric is Dragzilla's best friend, who is straight. She runs the Triangle Connection (a secret club that's a sanctuary for LGBTQ) behind her beauty salon. The main villain is Roid Rage. He's very homophobic and lives in the gym he owns. RR roams the streets of Straightlandia looking for gay people to hurt. He carries around a weight bar with a weight at the end of it, that he uses to attack others with. The Meatheads are two henchmen who follow Roid Rage wherever he goes. Often they cause more trouble than they're worth to RR.\nSo now more than ever our world needs heroes like Dragzilla. She might be fictional but she represents so many in this world. You don't need superpowers to be a hero. You just need the will, heart and fight. I hope that Dragzilla will inspire others to stand up in their own world. Art is great because not only is it therapeutic but it evokes emotion in others and can make a real difference.\n\nDon't you wish we had a drag queen superhero? I know I do. I hope that the comic could make a difference to anyone who feels different whether they're lgbt or not especially our youth. So many just need a light turned on. I hope Dragzilla becomes that light. I know it has been for me.\n\nHere are some illustrations that I've been working on and I'm excited to share them with you. Let me know what you think. Ultimately Dragzilla is me, or the person I wish I was more like. I'm putting my heart and soul into Dragzilla and her story, and I hope that others love her as much as I do.\n\nSo many are still scared and feel powerless. I hope that Dragzilla will remind them that they too can take action. You don't need superpowers to make a difference.\n\n\n\nhttp://imgur.com/9802G58", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "6wx85a", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "I've had the idea of making a comic book about a drag queen superhero who fights hate crimes for years", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/KNXcuZYuJ8y4moFizhgxoePNFpuiQBNCcBEIQpVIxyA.jpg?s=8942492a0a4f9bf6f051437a9fab0e97", "width": 1440, "height": 2560}, "resolutions": [{"url": "https://i.redditmedia.com/KNXcuZYuJ8y4moFizhgxoePNFpuiQBNCcBEIQpVIxyA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=56705320f0504ebb80f6a8faa65ad310", "width": 108, "height": 192}, {"url": "https://i.redditmedia.com/KNXcuZYuJ8y4moFizhgxoePNFpuiQBNCcBEIQpVIxyA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=cf3304d6f02b2ba4956c1e437e75bf93", "width": 216, "height": 384}, {"url": "https://i.redditmedia.com/KNXcuZYuJ8y4moFizhgxoePNFpuiQBNCcBEIQpVIxyA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=abaec9733237089862af111b627ee0db", "width": 320, "height": 568}, {"url": "https://i.redditmedia.com/KNXcuZYuJ8y4moFizhgxoePNFpuiQBNCcBEIQpVIxyA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=d9af898cbbc9d5fb03b99427e450c4e4", "width": 640, "height": 1137}, {"url": "https://i.redditmedia.com/KNXcuZYuJ8y4moFizhgxoePNFpuiQBNCcBEIQpVIxyA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=99de858182622712ae58501edae82c5c", "width": 960, "height": 1706}, {"url": "https://i.redditmedia.com/KNXcuZYuJ8y4moFizhgxoePNFpuiQBNCcBEIQpVIxyA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=eb7f362a13e1b284605759d6dac62f45", "width": 1080, "height": 1920}], "variants": {}, "id": "Go_oEmWxI08fs7-YidnZuUnILTOTbpmkEG49xZzeNAk"}], "enabled": false}, "num_comments": 2, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "post_hint": "self", "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_6wx85a", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/6wx85a/ive_had_the_idea_of_making_a_comic_book_about_a/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1504101641.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/6wx85a/ive_had_the_idea_of_making_a_comic_book_about_a/", "author_flair_text": "Now where could my pipe be?", "quarantine": false, "author": "CrownedCaribou", "created_utc": 1504072841.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.75, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6wx85a", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6wx85a", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dmc5ik9", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "CrownedCaribou", "can_mod_post": false, "ups": 3, "parent_id": "t1_dmbgoym", "score": 3, "approved_by": null, "downs": 0, "body": "what a kuhrazy fictional world nothing like that would ever happen", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;what a kuhrazy fictional world nothing like that would ever happen&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6wx85a/ive_had_the_idea_of_making_a_comic_book_about_a/dmc5ik9/", "subreddit_type": "public", "name": "t1_dmc5ik9", "created": 1504142956.0, "author_flair_text": "Now where could my pipe be?", "created_utc": 1504114156.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dmbgoym", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "bal0rd", "can_mod_post": false, "ups": 6, "parent_id": "t3_6wx85a", "score": 6, "approved_by": null, "downs": 0, "body": "&gt;a fictional world where it's illegal to be gay.\n\nyeah, conveniently forget when you heard it is actually illegal to be gay in many places where white people aren't in charge and continue to target white people for hate crime, make it fictional or become a paranoid schizophrenic if you can't readily pin evidence on them. that's real bravery!", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;a fictional world where it&amp;#39;s illegal to be gay.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;yeah, conveniently forget when you heard it is actually illegal to be gay in many places where white people aren&amp;#39;t in charge and continue to target white people for hate crime, make it fictional or become a paranoid schizophrenic if you can&amp;#39;t readily pin evidence on them. that&amp;#39;s real bravery!&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6wx85a/ive_had_the_idea_of_making_a_comic_book_about_a/dmbgoym/", "subreddit_type": "public", "name": "t1_dmbgoym", "created": 1504102744.0, "author_flair_text": "the finest sweat pants that you can buy in a black person mall", "created_utc": 1504073944.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]