[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was sitting in Cafe Coco when I saw you walk through the door, bright multi-colored canvas bag slung over your shoulder, oversized sunglasses and ballet flats clean but stained from walking between classes and through the neighborhood. You approached the counter and waited with a smile. Not a fake, impatient smile dripping with entitlement and disgust that you weren&amp;#39;t instantly served, but a real smile. Happy to be where you were and happy to wait two minutes to order your vanilla latte.\nYou sat down three tables north of me, removed a textbook from the canvas bag and began to read. You reached back into the bag hanging from the back of the chair and pulled out a pink covered notebook and a purple gel pen. You placed them on the table, adjusted the bag, then turned back and altered their position so they were several inches from your latte.\nYour legs crossed under the table, you began bouncing your heel against the denim on your shin. The rhythm was deliberate and steady, not an absent minded. I wondered what song was playing in your head. I rifled through the songs I know, singing them silently to myself trying to find a match. I soon realized I&amp;#39;d need to at least know the genre to have a chance at solving that piece of the puzzle.\nAfter three sips from your latte, three pages through the textbook and four notes written you closed the book and looked at your phone to see the time or check for messages, maybe both. You then looked at the door and back to your phone. You were waiting for someone you knew, not a first date and not a business meeting of any kind. If that were the case you wouldn&amp;#39;t have taken the time to study, this meeting was taking time away from your normal schedule but wasn&amp;#39;t unique enough to abandon your routine.\nWith your sunglasses off I could see light brown desert eyes, wavy horizons and mirages in their distance. Your phone vibrated loudly against the table and you picked it up quickly with embarrassment. &amp;quot;What&amp;#39;s up?&amp;quot; you answered, smiling. You asked the person on the other end if they were serious, your shoulders dropped and the color from your cheeks disappeared leaving you pale beneath your lightly tanned skin. Your nose crumbled, lips pursed and then opened as you assured the caller everything was fine and made them promise you&amp;#39;d get together tomorrow for a manicure. I thought that your nails looked lovely, despite the paint on your left middle finger being chipped. It looked as if you have a nervous habit of picking at it with the thumb on the same hand.\nYou hung up the phone, put your things back in the canvas bag and slung it over your shoulder. You stood, lifted your left foot, adjusted the heel on the back of your right shoe and walked out the door. I hated myself in that moment, another wasted opportunity. Fear and self-doubt once again stopping me from making the moves I think of later, replaying like a movie and altering so I&amp;#39;m the hero. The man who is bold and simply goes for it.\nI took a deep breath and held it until the count of 15. I headed out the door behind you. I could see you twenty or so feet up the sidewalk and kept my distance, not wanting to make things awkward. You stopped and turned towards a car, I stopped, turned slightly and began to pretend I was looking at something on my phone. I watched as you unlocked the door of a silver 2002 Honda Accord. I turned and ran in the opposite direction towards my car. You were about to drive off and I didn&amp;#39;t want to let this be another failure.\nI hopped in my front seat watching you drive around the corner. I started my car and followed behind. I began to breathe heavily, thinking I was going to lose you, I mashed the gas and nearly hit a middle-aged woman and her stroller as they were crossing the street, I yelled at her to use a crosswalk. When I made it to the corner I could see you four car lengths ahead in front of a white utility van. I kept pace and followed, not wanting to get too close. I didn&amp;#39;t want to risk ending up next to you at a red light and having to yell through my window.\nYou took some odd turns and ultimately made it across town to a Walgreen&amp;#39;s. I pulled into the liquor store parking lot across the side street and waited. You were only inside for four minutes. The automatic door slid open, you were backlit by the florescent interior holding a bulky plastic bag. I couldn&amp;#39;t tell what was in the bag but it looked lumpy and oddly filled, maybe toilet paper or feminine products. I couldn&amp;#39;t be sure from that distance.\nOnce we resumed driving I didn&amp;#39;t have any traffic to keep us apart. I pulled up close and could make out the numbers on your school parking sticker. The strand of beads hanging from your rearview swayed back and forth as you swerved to avoid a pothole. You looked in the mirror once and I thought you may have noticed me. I smiled and you looked back at the road. I realized I was driving too closely and that it probably made you feel unsafe, so I backed off.\nTwo miles down the road applied the brakes and slowly turned into an apartment complex. I didn&amp;#39;t want to freak you out so I kept driving a short distance down the road to a gas station and turned around. When I pulled into the complex I couldn&amp;#39;t see your car. There were several options, routes to the leasing office, the pool, and building letters. I turned down several scanning the parked cars. Your vehicle is popular, I found two other that looked just like it but the license plate numbers didn&amp;#39;t match up. Finally, outside building K I saw the plate I was looking for. I couldn&amp;#39;t remember the whole number but X4D was enough to solve the problem. I pulled into an empty spot.\nI had no idea which apartment was yours and I thought about writing a note but I was worried it would blow off or someone would take it. I sat and waited as the sun set. One by one the lights in your building came on as people returned home from work or just found the darkness inside uncomfortable. I tilted my head trying to look through the blinds on each apartment from my front seat. On the bottom floor the blinds were open but it appeared to be a model unit. The lights were on, everything in a perfect place. It didn&amp;#39;t look lived in. You wouldn&amp;#39;t live in a place like that.\nAt 10:23 I saw a set of living room lights turn off on the second floor. I could feel that it was you. Were you in your pajamas after a shower? Had you brushed your wet hair and prepared yourself to climb into your full-sized bed alone for the night? I imagined the layout of that apartment was identical to the model unit below. Then a front door opened and I saw you step outside.\nYou were wearing a shiny black dress now, with shoes to match. Your canvas bag exchanged for a small purse with a chain strap. You stepped carefully down the first flight of stairs. I watched your calf muscles flex with each delicate step, letting your full weight rest on the toe of your heels before taking the next step. Down the second set of stairs and to your car where you stood for a minute. This was my moment. I took one deep breath and grabbed the handle of my car door. Suddenly there were headlights shining in my eyes stinging them after having sat in the dark for all those hours. I recognized the lit Uber sticker in the front window. The interior lights came on and you stepped inside, closed the door and the driver pulled away. I started my car and followed, but I couldn&amp;#39;t keep up. The driver pulling between traffic and accelerating through a yellow light kept the distance between us. I thought I had a chance until far off I saw the taillights take the exit to merge on to 440. I slammed the gas and was soon at the exit but by the time I made it onto the highway you were gone, in your pretty dress, with your hair pulled up nicely, with your calves sleek and well formed.\nI was the tall slender guy with the dark hair, hard parted to the side. I hadn&amp;#39;t shaved so I had a bit of stubble. I was wearing the blue plaid shirt, jeans and brown shoes. I think you saw me. If you&amp;#39;d like to get another coffee together respond and let me know.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I was sitting in Cafe Coco when I saw you walk through the door, bright multi-colored canvas bag slung over your shoulder, oversized sunglasses and ballet flats clean but stained from walking between classes and through the neighborhood. You approached the counter and waited with a smile. Not a fake, impatient smile dripping with entitlement and disgust that you weren't instantly served, but a real smile. Happy to be where you were and happy to wait two minutes to order your vanilla latte.\nYou sat down three tables north of me, removed a textbook from the canvas bag and began to read. You reached back into the bag hanging from the back of the chair and pulled out a pink covered notebook and a purple gel pen. You placed them on the table, adjusted the bag, then turned back and altered their position so they were several inches from your latte.\nYour legs crossed under the table, you began bouncing your heel against the denim on your shin. The rhythm was deliberate and steady, not an absent minded. I wondered what song was playing in your head. I rifled through the songs I know, singing them silently to myself trying to find a match. I soon realized I'd need to at least know the genre to have a chance at solving that piece of the puzzle.\nAfter three sips from your latte, three pages through the textbook and four notes written you closed the book and looked at your phone to see the time or check for messages, maybe both. You then looked at the door and back to your phone. You were waiting for someone you knew, not a first date and not a business meeting of any kind. If that were the case you wouldn't have taken the time to study, this meeting was taking time away from your normal schedule but wasn't unique enough to abandon your routine.\nWith your sunglasses off I could see light brown desert eyes, wavy horizons and mirages in their distance. Your phone vibrated loudly against the table and you picked it up quickly with embarrassment. \"What's up?\" you answered, smiling. You asked the person on the other end if they were serious, your shoulders dropped and the color from your cheeks disappeared leaving you pale beneath your lightly tanned skin. Your nose crumbled, lips pursed and then opened as you assured the caller everything was fine and made them promise you'd get together tomorrow for a manicure. I thought that your nails looked lovely, despite the paint on your left middle finger being chipped. It looked as if you have a nervous habit of picking at it with the thumb on the same hand.\nYou hung up the phone, put your things back in the canvas bag and slung it over your shoulder. You stood, lifted your left foot, adjusted the heel on the back of your right shoe and walked out the door. I hated myself in that moment, another wasted opportunity. Fear and self-doubt once again stopping me from making the moves I think of later, replaying like a movie and altering so I'm the hero. The man who is bold and simply goes for it.\nI took a deep breath and held it until the count of 15. I headed out the door behind you. I could see you twenty or so feet up the sidewalk and kept my distance, not wanting to make things awkward. You stopped and turned towards a car, I stopped, turned slightly and began to pretend I was looking at something on my phone. I watched as you unlocked the door of a silver 2002 Honda Accord. I turned and ran in the opposite direction towards my car. You were about to drive off and I didn't want to let this be another failure.\nI hopped in my front seat watching you drive around the corner. I started my car and followed behind. I began to breathe heavily, thinking I was going to lose you, I mashed the gas and nearly hit a middle-aged woman and her stroller as they were crossing the street, I yelled at her to use a crosswalk. When I made it to the corner I could see you four car lengths ahead in front of a white utility van. I kept pace and followed, not wanting to get too close. I didn't want to risk ending up next to you at a red light and having to yell through my window.\nYou took some odd turns and ultimately made it across town to a Walgreen's. I pulled into the liquor store parking lot across the side street and waited. You were only inside for four minutes. The automatic door slid open, you were backlit by the florescent interior holding a bulky plastic bag. I couldn't tell what was in the bag but it looked lumpy and oddly filled, maybe toilet paper or feminine products. I couldn't be sure from that distance.\nOnce we resumed driving I didn't have any traffic to keep us apart. I pulled up close and could make out the numbers on your school parking sticker. The strand of beads hanging from your rearview swayed back and forth as you swerved to avoid a pothole. You looked in the mirror once and I thought you may have noticed me. I smiled and you looked back at the road. I realized I was driving too closely and that it probably made you feel unsafe, so I backed off.\nTwo miles down the road applied the brakes and slowly turned into an apartment complex. I didn't want to freak you out so I kept driving a short distance down the road to a gas station and turned around. When I pulled into the complex I couldn't see your car. There were several options, routes to the leasing office, the pool, and building letters. I turned down several scanning the parked cars. Your vehicle is popular, I found two other that looked just like it but the license plate numbers didn't match up. Finally, outside building K I saw the plate I was looking for. I couldn't remember the whole number but X4D was enough to solve the problem. I pulled into an empty spot.\nI had no idea which apartment was yours and I thought about writing a note but I was worried it would blow off or someone would take it. I sat and waited as the sun set. One by one the lights in your building came on as people returned home from work or just found the darkness inside uncomfortable. I tilted my head trying to look through the blinds on each apartment from my front seat. On the bottom floor the blinds were open but it appeared to be a model unit. The lights were on, everything in a perfect place. It didn't look lived in. You wouldn't live in a place like that.\nAt 10:23 I saw a set of living room lights turn off on the second floor. I could feel that it was you. Were you in your pajamas after a shower? Had you brushed your wet hair and prepared yourself to climb into your full-sized bed alone for the night? I imagined the layout of that apartment was identical to the model unit below. Then a front door opened and I saw you step outside.\nYou were wearing a shiny black dress now, with shoes to match. Your canvas bag exchanged for a small purse with a chain strap. You stepped carefully down the first flight of stairs. I watched your calf muscles flex with each delicate step, letting your full weight rest on the toe of your heels before taking the next step. Down the second set of stairs and to your car where you stood for a minute. This was my moment. I took one deep breath and grabbed the handle of my car door. Suddenly there were headlights shining in my eyes stinging them after having sat in the dark for all those hours. I recognized the lit Uber sticker in the front window. The interior lights came on and you stepped inside, closed the door and the driver pulled away. I started my car and followed, but I couldn't keep up. The driver pulling between traffic and accelerating through a yellow light kept the distance between us. I thought I had a chance until far off I saw the taillights take the exit to merge on to 440. I slammed the gas and was soon at the exit but by the time I made it onto the highway you were gone, in your pretty dress, with your hair pulled up nicely, with your calves sleek and well formed.\nI was the tall slender guy with the dark hair, hard parted to the side. I hadn't shaved so I had a bit of stubble. I was wearing the blue plaid shirt, jeans and brown shoes. I think you saw me. If you'd like to get another coffee together respond and let me know.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "63pifw", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "I was sitting in Cafe Coco when I saw you walk through the door", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 5, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_63pifw", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/63pifw/i_was_sitting_in_cafe_coco_when_i_saw_you_walk/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1491466380.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/63pifw/i_was_sitting_in_cafe_coco_when_i_saw_you_walk/", "author_flair_text": null, "quarantine": false, "author": "Protttt", "created_utc": 1491437580.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.64, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_63pifw", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dfw1dkf", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "disnig", "can_mod_post": false, "ups": 2, "parent_id": "t3_63pifw", "score": 2, "approved_by": null, "downs": 0, "body": "sex", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;sex&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/63pifw/i_was_sitting_in_cafe_coco_when_i_saw_you_walk/dfw1dkf/", "subreddit_type": "public", "name": "t1_dfw1dkf", "created": 1491469557.0, "author_flair_text": null, "created_utc": 1491440757.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_63pifw", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dfw36a7", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "throwawayfume10", "can_mod_post": false, "ups": 2, "parent_id": "t3_63pifw", "score": 2, "approved_by": null, "downs": 0, "body": "&gt;If you'd like to get another coffee together respond and let me know.\n\nSure, you sound like a nice guy. Hows this Friday sound?", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If you&amp;#39;d like to get another coffee together respond and let me know.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sure, you sound like a nice guy. Hows this Friday sound?&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/63pifw/i_was_sitting_in_cafe_coco_when_i_saw_you_walk/dfw36a7/", "subreddit_type": "public", "name": "t1_dfw36a7", "created": 1491471819.0, "author_flair_text": "You have so much potential - Mom", "created_utc": 1491443019.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_63pifw", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dfw4i69", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 2, "parent_id": "t3_63pifw", "score": 2, "approved_by": null, "downs": 0, "body": "lol good stuff", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol good stuff&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/63pifw/i_was_sitting_in_cafe_coco_when_i_saw_you_walk/dfw4i69/", "subreddit_type": "public", "name": "t1_dfw4i69", "created": 1491473492.0, "author_flair_text": null, "created_utc": 1491444692.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_63pifw", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dfw2v09", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MagnaFarce", "can_mod_post": false, "ups": 1, "parent_id": "t3_63pifw", "score": 1, "approved_by": null, "downs": 0, "body": "i didn't read all that but good job", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i didn&amp;#39;t read all that but good job&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/63pifw/i_was_sitting_in_cafe_coco_when_i_saw_you_walk/dfw2v09/", "subreddit_type": "public", "name": "t1_dfw2v09", "created": 1491471416.0, "author_flair_text": "Non-transferable Associate Degree", "created_utc": 1491442616.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_63pifw", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dfw9haz", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "rozwolfheart", "can_mod_post": false, "ups": 1, "parent_id": "t3_63pifw", "score": 1, "approved_by": null, "downs": 0, "body": "Get the fuck out of Nashville that city is haunted built on lands of bloodshed", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get the fuck out of Nashville that city is haunted built on lands of bloodshed&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/63pifw/i_was_sitting_in_cafe_coco_when_i_saw_you_walk/dfw9haz/", "subreddit_type": "public", "name": "t1_dfw9haz", "created": 1491480243.0, "author_flair_text": null, "created_utc": 1491451443.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]