[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve made a few shitposts on this subreddit, but its only because I&amp;#39;ve spent so much time with MDE and I have nothing to show for it aside from a burgeoning paranoia and a court case stemming from my attempts at comedy on people IRL.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if Sam Hyde or which mod is doing it, but lots of my best posts get shadowtanked , and I started blaming it on Sam because I thought he was afraid that I would become another lonelyboyonreddit and steal his glory.&lt;/p&gt;\n\n&lt;p&gt;I just want to say that I am not anti-semitic to all the 3 letter agencies reading this.  I actually have a highly nuanced and accurate view of the Ashkenazi Jews.  I understand that since I have lots of German and Polish ancestry, that odds are I have Jewish ancestry as well because I have discovered that the Jews basically took over Russia and Eastern Europe and Germany and Italy and the UK, and so even non Jews in these areas have lots of Jewish ancestry, but my nose is pretty small, but what I&amp;#39;m saying is that Ashkenazi Jews at least the ones that are in charge of the Zionist agenda are truely evil psychopaths because they have been conducting massive eugenics and breeding expiriments on the world, and now that they have taken control over Europe through central banking and wars, now they are trying to destroy it, and that is sick.  The only reason they are special to begin with is because they stole the best genetics from Europe, literally kidnapping children and breeding themselves into royalty.&lt;/p&gt;\n\n&lt;p&gt;According to the scientific paper &amp;quot;On the Origins of Jewish Intelligence&amp;quot; it lays out quite clearly that middle eastern Jews have an average Iq of 94 while Ashkenazi Jews who are actually 60% European and only 40% middle eastern, have an average Iq of 112 and furthermore that this increase in Iq happened over a short period of time, and that the easiest explaintion is that the Khazar Jews who were well known for kiddnapping and murder in Khazaria started doing the same in Europe and literally stole the genetics of superior families.&lt;/p&gt;\n\n&lt;p&gt;So, how the fuck can I be antisemitic if I am Jewish all European people must know the truth that they have been colonized by an outside force which represents the will of Satan or Lucifer.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've made a few shitposts on this subreddit, but its only because I've spent so much time with MDE and I have nothing to show for it aside from a burgeoning paranoia and a court case stemming from my attempts at comedy on people IRL.\n\nI don't know if Sam Hyde or which mod is doing it, but lots of my best posts get shadowtanked , and I started blaming it on Sam because I thought he was afraid that I would become another lonelyboyonreddit and steal his glory.\n\nI just want to say that I am not anti-semitic to all the 3 letter agencies reading this.  I actually have a highly nuanced and accurate view of the Ashkenazi Jews.  I understand that since I have lots of German and Polish ancestry, that odds are I have Jewish ancestry as well because I have discovered that the Jews basically took over Russia and Eastern Europe and Germany and Italy and the UK, and so even non Jews in these areas have lots of Jewish ancestry, but my nose is pretty small, but what I'm saying is that Ashkenazi Jews at least the ones that are in charge of the Zionist agenda are truely evil psychopaths because they have been conducting massive eugenics and breeding expiriments on the world, and now that they have taken control over Europe through central banking and wars, now they are trying to destroy it, and that is sick.  The only reason they are special to begin with is because they stole the best genetics from Europe, literally kidnapping children and breeding themselves into royalty.\n\nAccording to the scientific paper \"On the Origins of Jewish Intelligence\" it lays out quite clearly that middle eastern Jews have an average Iq of 94 while Ashkenazi Jews who are actually 60% European and only 40% middle eastern, have an average Iq of 112 and furthermore that this increase in Iq happened over a short period of time, and that the easiest explaintion is that the Khazar Jews who were well known for kiddnapping and murder in Khazaria started doing the same in Europe and literally stole the genetics of superior families.\n\nSo, how the fuck can I be antisemitic if I am Jewish all European people must know the truth that they have been colonized by an outside force which represents the will of Satan or Lucifer.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "6ujt0w", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "I'm sorry for all the offensive posts", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 2, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_6ujt0w", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/6ujt0w/im_sorry_for_all_the_offensive_posts/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1503109968.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/6ujt0w/im_sorry_for_all_the_offensive_posts/", "author_flair_text": "...", "quarantine": false, "author": "dsocma", "created_utc": 1503081168.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.46, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6ujt0w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6ujt0w", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlt801j", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "rillysmartguy", "can_mod_post": false, "ups": 4, "parent_id": "t1_dlt7j80", "score": 4, "approved_by": null, "downs": 0, "body": "https://youtu.be/ZEUcQtPwZ0U?t=32", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://youtu.be/ZEUcQtPwZ0U?t=32\"&gt;https://youtu.be/ZEUcQtPwZ0U?t=32&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6ujt0w/im_sorry_for_all_the_offensive_posts/dlt801j/", "subreddit_type": "public", "name": "t1_dlt801j", "created": 1503111450.0, "author_flair_text": null, "created_utc": 1503082650.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dlt7j80", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "dsocma", "can_mod_post": false, "ups": -4, "parent_id": "t3_6ujt0w", "score": -4, "approved_by": null, "downs": 0, "body": "Also, the alt right and is retarded, anyone who defines themselves by \"alt right\" is retarded because the MSM has already redefined that term to mean Nazi, and I keep hearing on NPR where they keep slipping in \"neo nazi\" and \"white supremacist\" to define Trump and Bannon.  NPR is owned by the GOVERNMENT ITS NOT NEUTRAL NEWS ITS PROPAFUCKINGANDA YOU DUMB LIBTARD FUCKS.\n\nIf you fags just used the same tricks (((they use, then you wouldn't have this problem\n\nRather than getting behind white supremacy, y'all should partner with the Jews and make them realize that they have more white goy DNA than hebrew DNA and therefore, they are us and we are them, and also partner with the Japs and Chinks and make them realize that it was the Jews who were behind all their problems.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, the alt right and is retarded, anyone who defines themselves by &amp;quot;alt right&amp;quot; is retarded because the MSM has already redefined that term to mean Nazi, and I keep hearing on NPR where they keep slipping in &amp;quot;neo nazi&amp;quot; and &amp;quot;white supremacist&amp;quot; to define Trump and Bannon.  NPR is owned by the GOVERNMENT ITS NOT NEUTRAL NEWS ITS PROPAFUCKINGANDA YOU DUMB LIBTARD FUCKS.&lt;/p&gt;\n\n&lt;p&gt;If you fags just used the same tricks (((they use, then you wouldn&amp;#39;t have this problem&lt;/p&gt;\n\n&lt;p&gt;Rather than getting behind white supremacy, y&amp;#39;all should partner with the Jews and make them realize that they have more white goy DNA than hebrew DNA and therefore, they are us and we are them, and also partner with the Japs and Chinks and make them realize that it was the Jews who were behind all their problems.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6ujt0w/im_sorry_for_all_the_offensive_posts/dlt7j80/", "subreddit_type": "public", "name": "t1_dlt7j80", "created": 1503110971.0, "author_flair_text": "...", "created_utc": 1503082171.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]