[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently moved from my hometown of Saint Louis, Missouri, to a much smaller town in West Virginia; this story is about a different town I stopped at on the way. Normally I wouldn&amp;#39;t tell of real events like this but I don&amp;#39;t have internet anywhere other than my phone and I&amp;#39;m burned out for today with my other creative pursuits. I can&amp;#39;t sleep.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;It was as if I was meant to stop in this town, or at least that&amp;#39;s how it felt - even at the time I had a feeling that the stars were aligning in some strange way. I took this feeling as a premonition that something good was about to happen, and I had even gotten a fortune cookie from a Chinese restaurant the night before that said good things were in store for me. Both the fortune cookie and I were wrong.&lt;/p&gt;\n\n&lt;p&gt;500 miles of driving, non-stop, and the engine of my Jeep began to whine, so I got off the exit and entered a town by the name of - if I am recalling correctly - Litusburg, right inside the invisible borders of Ohio. &lt;/p&gt;\n\n&lt;p&gt;As one would expect from Ohio, most of the scenery surrounding the center of the town was of rolling plains, with quaint and rickety looking houses dotting randomly in the distance. Obviously these were farm houses, as they were surrounded by crops and some were even fenced off and contained livestock. &lt;/p&gt;\n\n&lt;p&gt;The center of the town featured 4-6 variety gas stations, a McDonald&amp;#39;s, a shopping plaza, and a whole block filled with restaurants, who I assumed were competing with each other over travelers like me based on how large their signs were. There was one restaurant on the corner, however, that was not painted or brightly lit with signs. &lt;/p&gt;\n\n&lt;p&gt;It was a box-like brick building with the word &amp;quot;DINER&amp;quot; displayed on the outside in a creamy off-white plastic lettering. As I filled my car up at the gas station next to this diner I peered inside. I didn&amp;#39;t see anyone eating, even though it was obviously open. The gas machine was partially blocking my view so I craned my neck to completely view the building, squinting my eyes to see better. That&amp;#39;s when, coming from a blur, a figure appeared in what seemed to be the back of the kitchen. It was completely black against the background of light emanating from the kitchen but I could tell one thing - whoever it was, he was large. He stood their completely motionless. From his silhouette I could make out his round head and the paper hat sitting atop it. &lt;/p&gt;\n\n&lt;p&gt;My stomach rumbled as I topped off my gas tank. I put my hands on my hips and scanned the line of restaurants, but none of them seemed very appealing. There was always McDonald&amp;#39;s of course, but even looking at it I could still feel the sloppy rock of mush that was the last Big Mac I ate about 7 months prior. After that I had vowed to myself that I&amp;#39;d never touch McDonald&amp;#39;s again. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll admit, I&amp;#39;m not a very adventurous eater, but I am naturally a curious and sometimes nosey person. The only thing that told me the &amp;quot;DINER&amp;quot; was a better choice than all the other restaurants was the prospect of seeing what that towering figure I mentioned previously actually looked like. &lt;/p&gt;\n\n&lt;p&gt;So I started my Jeep and made the short jaunt between the gas station and the diner, taking one of the ten or so parking spots the diner had. I could smell fry oil coming from the ventilation system outside the diner, which gave me and even bigger appetite than before. I hurried in.&lt;/p&gt;\n\n&lt;p&gt;When I entered my eyes immediately drifted to the spot behind the counter where the inside of the kitchen could be seen. The figure I was waiting to see was not there. That&amp;#39;s when a man came quickly from a swinging door leading to the kitchen. It was obvious that this was not the man I was hoping to see; he was much smaller, old with grey hair, and looked very weak. He sort of looked like on of the characters from One Flew Over the Cuckoo&amp;#39;s Nest with Jack Nicholson, a film I had watched a few nights prior. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Welcome, welcome,&amp;quot; he echoed to me as I approached the counter, &amp;quot;what can we do ya for today?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He had a very deep voice and everything he said he muttered once more under his breath. &lt;/p&gt;\n\n&lt;p&gt;There wasn&amp;#39;t a menu anywhere to be seen, so I just said what I felt like eating at the time and what I felt like they probably served - a bacon burger and a side of fries. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sure, sure, I&amp;#39;ll whip it up for you in no time. Have a seat anywhere you wish. What would you like to drink?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I said I wanted a Sprite. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Sorry the only fizzy we have is root beer.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I said that was fine and went to my seat. I made sure to pick a seat with a clear view of the kitchen&amp;#39;s opening, and I waited biting my nails for the man to show up. &lt;/p&gt;\n\n&lt;p&gt;When he did finally romp and stomp into view his features didn&amp;#39;t surprise me at all. He was morbidly obese, had beard stubble covering most of his cheeks and chin, a mole near his stubby nose, and his mouth was agape just enough to see his two front teeth. He was exactly how I imagined him in my head, almost to the point that it was disturbing. &lt;/p&gt;\n\n&lt;p&gt;He was looking down at what I assumed was the grill, as I heard him plop a large piece of meat onto it, followed by an audible sizzle. He then made a strange, sort of strained face. I figured that was the face he made when he had a thought, or something equally pretentious. He kept making that face over and over again, relaxing then straining. &lt;/p&gt;\n\n&lt;p&gt;The man came out with my food. I was perplexed because I had literally just ordered about 4 minutes ago. But there it was, ready to eat. The man clanked my root beer on the table and popped the cap open with his keychain bottle opener combo.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;There ya&amp;#39;re sir.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I gave a breathy &amp;quot;thanks&amp;quot; and eyed the burger. I felt it, and it was warm. The fries were warm too, and honestly they looked delicious. In fact, everything looked delicious. I looked back at the fry cook and he was still standing there, face sometimes straining. Whatever, I thought, and I dug in.&lt;/p&gt;\n\n&lt;p&gt;It was probably the best single meal I&amp;#39;d ever had in my life, and it was just a burger and some fries. The man saw that I was done and rushed over to me.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;How was it then?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I told him the truth, that it was the greatest thing I&amp;#39;d ever eaten. And I told him I was sad that I have to be on my way, that I&amp;#39;m just a traveler. I told the man I wanted him to tell the fry cook that he did something really special, and that it was terrific. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well why don&amp;#39;t you tell him yourself? Come on I&amp;#39;ll let you meet him!&amp;quot; The man said happily. &lt;/p&gt;\n\n&lt;p&gt;Normally I would have said that wasn&amp;#39;t necessary but I&amp;#39;m being serious when I say the meal was life changing. For that minute or two afterwards I was a different man - I felt oddly religious. &lt;/p&gt;\n\n&lt;p&gt;I followed the man and entered the kitchen and I immediately lost all religiosity I was previously experiencing. The giddy attitude the meal gave me turned to absolute horror and dread at what I saw there. &lt;/p&gt;\n\n&lt;p&gt;The fry cook&amp;#39;s apron and white t shirt came to an end right above his belly button, as if they had been burned from the bottom up. Below his belly button was a trail of hairs leading to a forest of charred pubic hairs, which spread outwards to his thighs, which were inordinately hairy as well.&lt;/p&gt;\n\n&lt;p&gt;Dark ashy burn marks pocked the skin of his legs, which were bloated and covered in varicose veins leading towards his ankles like rivers. He wasn&amp;#39;t wearing any shoes, and squishing between his toes was a horrific yellow goo. I looked at this goo, and there was a ripple of something dripping into it. I followed the drips upwards to the most horrific aspect of everything - his penis. &lt;/p&gt;\n\n&lt;p&gt;It was about 11 inches long and as thick as a soda can, and like the rest of his body it was seriously burned. I hadn&amp;#39;t recognized it before because it didn&amp;#39;t even look like a penis. If it wasn&amp;#39;t attached to the bottom of his torso I would have never guessed what it was. There were pockets on the surface of his penis skin where gangrenous guacamole colored mush was resting. If I had a spoon I could have dipped into it. &lt;/p&gt;\n\n&lt;p&gt;The head of his penis was just as charred as the rest, and it was fused to his foreskin completely. Out of his urethra came the yellow goo, almost endlessly. I stood there, stuck in time, watching it. It was like a hose or an industrial waste siphon.&lt;/p&gt;\n\n&lt;p&gt;My eyes then shifted right, towards the grill which was also covered in the charred gangrenous penis goo. The burgers on the grill were hopping up and down as the goo sizzled and boiled underneath them. My eyes then shifted to the fryer, which did not contain fry oil at all, but what seemed to be oily diabetic piss, boiling and corroding inwards upon itself like clothes in a washing machine. &lt;/p&gt;\n\n&lt;p&gt;I then looked upward at the face of the monster, the face of the man I had been so curious about earlier. His eyes were glazed over as he zombie-stared into my soul. I could smell his breath even though he was not visibly breathing. He didn&amp;#39;t seem to be lucid of anything at all, there was nothing behind his eyes.&lt;/p&gt;\n\n&lt;p&gt;I snapped out of the frozen hold of horror and sprinted out of the kitchen, then out of the diner completely, knocking over chairs and tables on my way out. I held my hands on my head outside as the bright sunny day contrasted against the darkness I was feeling inside. I clutched at my shirt unable to properly catch my breath, hyperventilating. Everything seemed so dreamlike and surreal.&lt;/p&gt;\n\n&lt;p&gt;I got my keys and entered my car then screeched out of the driveway and into the street, almost hitting an oncoming vehicle. I made my way onto the highway going around 90 mph. &lt;/p&gt;\n\n&lt;p&gt;It took many hours to parse all of the disturbing information that had soaked into me, but now I believe I am mostly fine, at least mentally. I just got into my new house and now I&amp;#39;m looking into a full body check up for diseases and such. &lt;/p&gt;\n\n&lt;p&gt;I should probably be sleeping right now but I&amp;#39;m still a bit too jarred from the whole thing, haven&amp;#39;t been sleeping much since if happened. Sorry for the long read, I just had to get everything out.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I recently moved from my hometown of Saint Louis, Missouri, to a much smaller town in West Virginia; this story is about a different town I stopped at on the way. Normally I wouldn't tell of real events like this but I don't have internet anywhere other than my phone and I'm burned out for today with my other creative pursuits. I can't sleep.\n\n------\n\nIt was as if I was meant to stop in this town, or at least that's how it felt - even at the time I had a feeling that the stars were aligning in some strange way. I took this feeling as a premonition that something good was about to happen, and I had even gotten a fortune cookie from a Chinese restaurant the night before that said good things were in store for me. Both the fortune cookie and I were wrong.\n\n500 miles of driving, non-stop, and the engine of my Jeep began to whine, so I got off the exit and entered a town by the name of - if I am recalling correctly - Litusburg, right inside the invisible borders of Ohio. \n\nAs one would expect from Ohio, most of the scenery surrounding the center of the town was of rolling plains, with quaint and rickety looking houses dotting randomly in the distance. Obviously these were farm houses, as they were surrounded by crops and some were even fenced off and contained livestock. \n\nThe center of the town featured 4-6 variety gas stations, a McDonald's, a shopping plaza, and a whole block filled with restaurants, who I assumed were competing with each other over travelers like me based on how large their signs were. There was one restaurant on the corner, however, that was not painted or brightly lit with signs. \n\nIt was a box-like brick building with the word \"DINER\" displayed on the outside in a creamy off-white plastic lettering. As I filled my car up at the gas station next to this diner I peered inside. I didn't see anyone eating, even though it was obviously open. The gas machine was partially blocking my view so I craned my neck to completely view the building, squinting my eyes to see better. That's when, coming from a blur, a figure appeared in what seemed to be the back of the kitchen. It was completely black against the background of light emanating from the kitchen but I could tell one thing - whoever it was, he was large. He stood their completely motionless. From his silhouette I could make out his round head and the paper hat sitting atop it. \n\nMy stomach rumbled as I topped off my gas tank. I put my hands on my hips and scanned the line of restaurants, but none of them seemed very appealing. There was always McDonald's of course, but even looking at it I could still feel the sloppy rock of mush that was the last Big Mac I ate about 7 months prior. After that I had vowed to myself that I'd never touch McDonald's again. \n\nI'll admit, I'm not a very adventurous eater, but I am naturally a curious and sometimes nosey person. The only thing that told me the \"DINER\" was a better choice than all the other restaurants was the prospect of seeing what that towering figure I mentioned previously actually looked like. \n\nSo I started my Jeep and made the short jaunt between the gas station and the diner, taking one of the ten or so parking spots the diner had. I could smell fry oil coming from the ventilation system outside the diner, which gave me and even bigger appetite than before. I hurried in.\n\nWhen I entered my eyes immediately drifted to the spot behind the counter where the inside of the kitchen could be seen. The figure I was waiting to see was not there. That's when a man came quickly from a swinging door leading to the kitchen. It was obvious that this was not the man I was hoping to see; he was much smaller, old with grey hair, and looked very weak. He sort of looked like on of the characters from One Flew Over the Cuckoo's Nest with Jack Nicholson, a film I had watched a few nights prior. \n\n\"Welcome, welcome,\" he echoed to me as I approached the counter, \"what can we do ya for today?\"\n\nHe had a very deep voice and everything he said he muttered once more under his breath. \n\nThere wasn't a menu anywhere to be seen, so I just said what I felt like eating at the time and what I felt like they probably served - a bacon burger and a side of fries. \n\n\"Sure, sure, I'll whip it up for you in no time. Have a seat anywhere you wish. What would you like to drink?\"\n\nI said I wanted a Sprite. \n\n\"Sorry the only fizzy we have is root beer.\"\n\nI said that was fine and went to my seat. I made sure to pick a seat with a clear view of the kitchen's opening, and I waited biting my nails for the man to show up. \n\nWhen he did finally romp and stomp into view his features didn't surprise me at all. He was morbidly obese, had beard stubble covering most of his cheeks and chin, a mole near his stubby nose, and his mouth was agape just enough to see his two front teeth. He was exactly how I imagined him in my head, almost to the point that it was disturbing. \n\nHe was looking down at what I assumed was the grill, as I heard him plop a large piece of meat onto it, followed by an audible sizzle. He then made a strange, sort of strained face. I figured that was the face he made when he had a thought, or something equally pretentious. He kept making that face over and over again, relaxing then straining. \n\nThe man came out with my food. I was perplexed because I had literally just ordered about 4 minutes ago. But there it was, ready to eat. The man clanked my root beer on the table and popped the cap open with his keychain bottle opener combo.\n\n\"There ya're sir.\"\n\nI gave a breathy \"thanks\" and eyed the burger. I felt it, and it was warm. The fries were warm too, and honestly they looked delicious. In fact, everything looked delicious. I looked back at the fry cook and he was still standing there, face sometimes straining. Whatever, I thought, and I dug in.\n\nIt was probably the best single meal I'd ever had in my life, and it was just a burger and some fries. The man saw that I was done and rushed over to me.\n\n\"How was it then?\" \n\nI told him the truth, that it was the greatest thing I'd ever eaten. And I told him I was sad that I have to be on my way, that I'm just a traveler. I told the man I wanted him to tell the fry cook that he did something really special, and that it was terrific. \n\n\"Well why don't you tell him yourself? Come on I'll let you meet him!\" The man said happily. \n\nNormally I would have said that wasn't necessary but I'm being serious when I say the meal was life changing. For that minute or two afterwards I was a different man - I felt oddly religious. \n\nI followed the man and entered the kitchen and I immediately lost all religiosity I was previously experiencing. The giddy attitude the meal gave me turned to absolute horror and dread at what I saw there. \n\nThe fry cook's apron and white t shirt came to an end right above his belly button, as if they had been burned from the bottom up. Below his belly button was a trail of hairs leading to a forest of charred pubic hairs, which spread outwards to his thighs, which were inordinately hairy as well.\n\nDark ashy burn marks pocked the skin of his legs, which were bloated and covered in varicose veins leading towards his ankles like rivers. He wasn't wearing any shoes, and squishing between his toes was a horrific yellow goo. I looked at this goo, and there was a ripple of something dripping into it. I followed the drips upwards to the most horrific aspect of everything - his penis. \n\nIt was about 11 inches long and as thick as a soda can, and like the rest of his body it was seriously burned. I hadn't recognized it before because it didn't even look like a penis. If it wasn't attached to the bottom of his torso I would have never guessed what it was. There were pockets on the surface of his penis skin where gangrenous guacamole colored mush was resting. If I had a spoon I could have dipped into it. \n\nThe head of his penis was just as charred as the rest, and it was fused to his foreskin completely. Out of his urethra came the yellow goo, almost endlessly. I stood there, stuck in time, watching it. It was like a hose or an industrial waste siphon.\n\nMy eyes then shifted right, towards the grill which was also covered in the charred gangrenous penis goo. The burgers on the grill were hopping up and down as the goo sizzled and boiled underneath them. My eyes then shifted to the fryer, which did not contain fry oil at all, but what seemed to be oily diabetic piss, boiling and corroding inwards upon itself like clothes in a washing machine. \n\nI then looked upward at the face of the monster, the face of the man I had been so curious about earlier. His eyes were glazed over as he zombie-stared into my soul. I could smell his breath even though he was not visibly breathing. He didn't seem to be lucid of anything at all, there was nothing behind his eyes.\n\nI snapped out of the frozen hold of horror and sprinted out of the kitchen, then out of the diner completely, knocking over chairs and tables on my way out. I held my hands on my head outside as the bright sunny day contrasted against the darkness I was feeling inside. I clutched at my shirt unable to properly catch my breath, hyperventilating. Everything seemed so dreamlike and surreal.\n\nI got my keys and entered my car then screeched out of the driveway and into the street, almost hitting an oncoming vehicle. I made my way onto the highway going around 90 mph. \n\nIt took many hours to parse all of the disturbing information that had soaked into me, but now I believe I am mostly fine, at least mentally. I just got into my new house and now I'm looking into a full body check up for diseases and such. \n\nI should probably be sleeping right now but I'm still a bit too jarred from the whole thing, haven't been sleeping much since if happened. Sorry for the long read, I just had to get everything out.\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "6eznpe", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "The Fry Cook - A Small Town Horror Story", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 9, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 4, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": 1496469224.0, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_6eznpe", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/6eznpe/the_fry_cook_a_small_town_horror_story/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1496497573.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/6eznpe/the_fry_cook_a_small_town_horror_story/", "author_flair_text": "READ UNABOMBER'S MANIFESTO", "quarantine": false, "author": "Psychedelican", "created_utc": 1496468773.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 1.0, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6eznpe", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dig7a4m", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "hiroshima_adventure", "can_mod_post": false, "ups": 2, "parent_id": "t3_6eznpe", "score": 2, "approved_by": null, "downs": 0, "body": "the penis sounded more delicious than the burger ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the penis sounded more delicious than the burger &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6eznpe/the_fry_cook_a_small_town_horror_story/dig7a4m/", "subreddit_type": "public", "name": "t1_dig7a4m", "created": 1496624796.0, "author_flair_text": "what's pec, chest?", "created_utc": 1496595996.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6eznpe", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "diedi1b", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "s4lmon", "can_mod_post": false, "ups": 1, "parent_id": "t3_6eznpe", "score": 1, "approved_by": null, "downs": 0, "body": "appreciate the content psyche", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;appreciate the content psyche&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6eznpe/the_fry_cook_a_small_town_horror_story/diedi1b/", "subreddit_type": "public", "name": "t1_diedi1b", "created": 1496504132.0, "author_flair_text": "Welder", "created_utc": 1496475332.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6eznpe", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "diedvmv", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "psyduck117", "can_mod_post": false, "ups": 1, "parent_id": "t3_6eznpe", "score": 1, "approved_by": null, "downs": 0, "body": "I want to believe that somebody wouldn't write this out of boredom. \n\nyou sure you didn't decide to take reality shattering amount of lsd before you pulled into town? ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to believe that somebody wouldn&amp;#39;t write this out of boredom. &lt;/p&gt;\n\n&lt;p&gt;you sure you didn&amp;#39;t decide to take reality shattering amount of lsd before you pulled into town? &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6eznpe/the_fry_cook_a_small_town_horror_story/diedvmv/", "subreddit_type": "public", "name": "t1_diedvmv", "created": 1496505199.0, "author_flair_text": "&lt;3 /u/GottenGot", "created_utc": 1496476399.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6eznpe", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "diehskv", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "3ruid", "can_mod_post": false, "ups": 1, "parent_id": "t3_6eznpe", "score": 1, "approved_by": null, "downs": 0, "body": "That was funny.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was funny.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6eznpe/the_fry_cook_a_small_town_horror_story/diehskv/", "subreddit_type": "public", "name": "t1_diehskv", "created": 1496517200.0, "author_flair_text": "99th percentile in everything", "created_utc": 1496488400.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]