[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey &lt;a href=\"/r/nosleep\"&gt;r/nosleep&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;You may remember me from my last post... &lt;/p&gt;\n\n&lt;p&gt;So I guess I should start with where I am now. I&amp;#39;m currently sitting in a cafe in an undisclosed location in a small Middle America town. That&amp;#39;s a specific I can get... for my safety. I&amp;#39;m living in my car, not staying in one place for more than a few hours. I&amp;#39;ve been on the road for 4 days now, and I&amp;#39;m staring to realize how grim my situation looks. But, as long as I stay a few miles from the nearest pizza place I&amp;#39;m usually safe for a few hours... usually. &lt;/p&gt;\n\n&lt;p&gt;Now... the first thing I did after I wrote my last post was to try to email sam Gino and apologize. I simply explained how my insecurities and lack of skills or knowledge left me feeling jealous. I explained how I needed an outlet to spew my inadequacies. However... I think it was too late. I instantly received an automated email back saying &amp;quot;the email you have tried reaching does not exist or is no longer in service.&amp;quot; He gave me a chance, and I blew it.&lt;/p&gt;\n\n&lt;p&gt;The next morning, I decided I had enough of it. I couldn&amp;#39;t take any more pizza boxes showing up at my house every day filled with grotesque objects. I couldn&amp;#39;t stand the pizza sauce covering the walls of my house every time I stepped outside. Things started getting even worse too. The local dominoes, marios, and papa Gino&amp;#39;s cars would sit outside of my house every night. I could see them taking pictures, planning for the perfect strike where I would finally be taken down for good. I didn&amp;#39;t have the courage to confront them, so I would just hide and prey they would leave.&lt;/p&gt;\n\n&lt;p&gt;Anyways, because they knew where I lived, I realized I had to leave. The next morning I got in my car and drove west. I drove and drove for hours until I felt like I was going to give out. Suddenly, just as I was about to fall asleep at the wheel, I realized I was craving a nice, cheesy, crusty, gooey pizza. Since this fiasco started, I had been too scared to even have a slice. However, now that I was out of Papa Gino&amp;#39;s chain range, I figured there would be no harm. &lt;/p&gt;\n\n&lt;p&gt;I went on yelp and found that the nearest pizza place was called &amp;quot;Giovanis family pizza.&amp;quot; I quickly drove to the location only .2 miles away and went inside. I was greeted by a friendly old woman at the counter. She was at least 70 and had the kindest smile that made me feel at home &amp;quot;Hello, sir! Welcome to Giovanni&amp;#39;s family pizza. the oldest family restaurant in town, run only by my husband and I!&amp;quot; I greeted the friendly woman and quickly and ordered a nice slice of pepperoni sausage and a Diet Coke. I waited patiently as she and her husband hand prepared my slice in the back. I decided to take out my phone and read some cool stuff on &lt;a href=\"/r/askreddit\"&gt;r/askreddit&lt;/a&gt; (shoutout my askers!) while I waited. It seemed to be taking suspiciously long. Suddenly, I felt a warm drop on neck. I whirled around only to see that the woman was slowly dropping pizza sauce on me with a large label while simultaneously putting a knife to my neck. She laughed maniacally while I screamed and shoved her as hard as I could. It didn&amp;#39;t seem to phase her as she chased me around the restaurant. I flung the door open and ran back to my car with the lady grinned behind me, still standing in the restaurant. I&amp;#39;m not gona bother with the police. &lt;/p&gt;\n\n&lt;p&gt;So here I am now. Maybe five towns over now. Please sam... I know it&amp;#39;s too late and I know you have the power to destroy me... but please. Out of the mercy of your heart just forgive me. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey r/nosleep\n\nYou may remember me from my last post... \n\nSo I guess I should start with where I am now. I'm currently sitting in a cafe in an undisclosed location in a small Middle America town. That's a specific I can get... for my safety. I'm living in my car, not staying in one place for more than a few hours. I've been on the road for 4 days now, and I'm staring to realize how grim my situation looks. But, as long as I stay a few miles from the nearest pizza place I'm usually safe for a few hours... usually. \n\nNow... the first thing I did after I wrote my last post was to try to email sam Gino and apologize. I simply explained how my insecurities and lack of skills or knowledge left me feeling jealous. I explained how I needed an outlet to spew my inadequacies. However... I think it was too late. I instantly received an automated email back saying \"the email you have tried reaching does not exist or is no longer in service.\" He gave me a chance, and I blew it.\n\nThe next morning, I decided I had enough of it. I couldn't take any more pizza boxes showing up at my house every day filled with grotesque objects. I couldn't stand the pizza sauce covering the walls of my house every time I stepped outside. Things started getting even worse too. The local dominoes, marios, and papa Gino's cars would sit outside of my house every night. I could see them taking pictures, planning for the perfect strike where I would finally be taken down for good. I didn't have the courage to confront them, so I would just hide and prey they would leave.\n\nAnyways, because they knew where I lived, I realized I had to leave. The next morning I got in my car and drove west. I drove and drove for hours until I felt like I was going to give out. Suddenly, just as I was about to fall asleep at the wheel, I realized I was craving a nice, cheesy, crusty, gooey pizza. Since this fiasco started, I had been too scared to even have a slice. However, now that I was out of Papa Gino's chain range, I figured there would be no harm. \n\nI went on yelp and found that the nearest pizza place was called \"Giovanis family pizza.\" I quickly drove to the location only .2 miles away and went inside. I was greeted by a friendly old woman at the counter. She was at least 70 and had the kindest smile that made me feel at home \"Hello, sir! Welcome to Giovanni's family pizza. the oldest family restaurant in town, run only by my husband and I!\" I greeted the friendly woman and quickly and ordered a nice slice of pepperoni sausage and a Diet Coke. I waited patiently as she and her husband hand prepared my slice in the back. I decided to take out my phone and read some cool stuff on r/askreddit (shoutout my askers!) while I waited. It seemed to be taking suspiciously long. Suddenly, I felt a warm drop on neck. I whirled around only to see that the woman was slowly dropping pizza sauce on me with a large label while simultaneously putting a knife to my neck. She laughed maniacally while I screamed and shoved her as hard as I could. It didn't seem to phase her as she chased me around the restaurant. I flung the door open and ran back to my car with the lady grinned behind me, still standing in the restaurant. I'm not gona bother with the police. \n\nSo here I am now. Maybe five towns over now. Please sam... I know it's too late and I know you have the power to destroy me... but please. Out of the mercy of your heart just forgive me. \n\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "6uwe5m", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "Update: Sam Gino still after me... I'm not safe", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 15, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 1, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_6uwe5m", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/6uwe5m/update_sam_gino_still_after_me_im_not_safe/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1503272590.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/6uwe5m/update_sam_gino_still_after_me_im_not_safe/", "author_flair_text": null, "quarantine": false, "author": "tmanuel247", "created_utc": 1503243790.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.83, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6uwe5m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlwu48d", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "psyduck117", "can_mod_post": false, "ups": 2, "parent_id": "t3_6uwe5m", "score": 2, "approved_by": null, "downs": 0, "body": "What's that your on the run? You made a little road trip? You tried to escape from the papa Genos family?\n\nWell let me take this opportunity to congratulate you, the monkey learned a trick. Look at you sleeping in your car, your already spreading your vile filth all over the country huh?\n\nCongratulations, you must have an iq in the double digits! Here's a little piece of advice; next time your gonna unload your jealousy and your inadequacies on the papa Genos family, here's a little piece of advice:\n\nHere's a little piece of advice:\n\nHere's a little piece of advice slick, next time you're gonna go in your car (mommy and daddy bought you a new car!), you're going to unload your jealousy and inadequacies on somebody else, on a stranger? Just make sure you don't pick Sam Geno, the son of the Papa Geno Pizza empire. I've bought people like you. I've destroyed people like you. It's nothing for me to call up my father, and have every pizza jockey in the nation have a photo of you, right above their oven. Thinking about you, my personal army of pizza makers.\n\nThey'll put sauce on you. They'll lay you out. Swing you around in the air just like in the old movies.\n\nThen they'll destroy you. Piece by piece. Piece by delicious piece. Cheesy piece by cheesy crusty piece. They'll destroy you.\n\nThat's option one. Option two is you can apologize to me. Just say you're sorry. Takes a big man to apologize, don't it? Humble yourself before a god, a pizza god?\n\nAnyway. That's about it. Go fuck yourself.﻿\n\n", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;s that your on the run? You made a little road trip? You tried to escape from the papa Genos family?&lt;/p&gt;\n\n&lt;p&gt;Well let me take this opportunity to congratulate you, the monkey learned a trick. Look at you sleeping in your car, your already spreading your vile filth all over the country huh?&lt;/p&gt;\n\n&lt;p&gt;Congratulations, you must have an iq in the double digits! Here&amp;#39;s a little piece of advice; next time your gonna unload your jealousy and your inadequacies on the papa Genos family, here&amp;#39;s a little piece of advice:&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s a little piece of advice:&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s a little piece of advice slick, next time you&amp;#39;re gonna go in your car (mommy and daddy bought you a new car!), you&amp;#39;re going to unload your jealousy and inadequacies on somebody else, on a stranger? Just make sure you don&amp;#39;t pick Sam Geno, the son of the Papa Geno Pizza empire. I&amp;#39;ve bought people like you. I&amp;#39;ve destroyed people like you. It&amp;#39;s nothing for me to call up my father, and have every pizza jockey in the nation have a photo of you, right above their oven. Thinking about you, my personal army of pizza makers.&lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;ll put sauce on you. They&amp;#39;ll lay you out. Swing you around in the air just like in the old movies.&lt;/p&gt;\n\n&lt;p&gt;Then they&amp;#39;ll destroy you. Piece by piece. Piece by delicious piece. Cheesy piece by cheesy crusty piece. They&amp;#39;ll destroy you.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s option one. Option two is you can apologize to me. Just say you&amp;#39;re sorry. Takes a big man to apologize, don&amp;#39;t it? Humble yourself before a god, a pizza god?&lt;/p&gt;\n\n&lt;p&gt;Anyway. That&amp;#39;s about it. Go fuck yourself.﻿&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6uwe5m/update_sam_gino_still_after_me_im_not_safe/dlwu48d/", "subreddit_type": "public", "name": "t1_dlwu48d", "created": 1503318712.0, "author_flair_text": "&lt;3 /u/GottenGot", "created_utc": 1503289912.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]