[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Look I&amp;#39;m not saying I regret getting it, so no one snap at me lol. I didn&amp;#39;t experience any of the supposed problems that others said they did. No puss leaking from the temple incision and I never lost sight in my right eye.&lt;/p&gt;\n\n&lt;p&gt;I enjoy Sargon AI&amp;#39;s running commentary throughout my daily life and the voice in my head usually stops talking within five or ten minutes of me telling him to, when I&amp;#39;m ready for sleep or having sex or whatever. I find his voice and his opinions equally charming, and have had a fair bit of social success by having his brain app lead by example and show me how to be wittier and more high-minded in my silent ruminations as well as my daily interactions with the profane masses.&lt;/p&gt;\n\n&lt;p&gt;In the last week or so it&amp;#39;s started getting a little annoying, though. Like I&amp;#39;ll be walking down the street and Sargon AI will keep saying &amp;quot;Was that Anita Sarkeesian?&amp;quot; at like every fifth female I pass. I just ignore it, but then by about the third time he does it he escalates to the point of saying &amp;quot;Wait, go back. Go back. I think that was Anita Sarkeesian. Go back and just look. Don&amp;#39;t get her attention and try not to be seen by her, but just go back and look. No, seriously, go back and do it. I think that was Anita Sarkeesian back there and I&amp;#39;d like to find out, if we could, what she&amp;#39;s doing here. Because it&amp;#39;s kind of weird, don&amp;#39;t you think? Okay, so you&amp;#39;re not turning around. I&amp;#39;m only asking you to do this one thing for me. If I wanted to I could just start yelling and you won&amp;#39;t be able to shut it off and you could have that in your head all day, or else you could turn around right now, because we still have time to catch her, and go back and try to find out if that was Anita Sarkeesian we passed in the street back there. Which would you prefer? Why WOULDN&amp;#39;T you want to know if that was Anita Sarkeesian back there? Look, I&amp;#39;m not asking you have a conversation with her, and actually I&amp;#39;d prefer if you DIDN&amp;#39;T, but... Right, so, apparently for whatever reason you&amp;#39;d rather have me not just talking but actually yelling in your head all day. Okay, fine, well I&amp;#39;m not going to oblige you in that regard. Got you now then, don&amp;#39;t I? Ah, you&amp;#39;re in quite a pickle indeed!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Actually that&amp;#39;s the brief version of what he does. I can&amp;#39;t reason with him, and ignoring him does seem to be effective eventually, but it&amp;#39;s getting longer and longer each jag, and it&amp;#39;s beginning to concern me. Last night he did it right after I had gotten through seeing my parents at their house. Sargon AI had known it was my parents for the duration of my hour-long visit, and he was actually feeding me these really witty parables and equivocations to throw at my dad in particular, who is a Trump fan (UGH!). But then at the end of the visit I hugged my mom, closed the door to their house, and as I was walking to my car I hear that fucking smug British voice in my head saying &amp;quot;Who was that woman in that house back there? I think it was Anita Sarkeesian. Go back. See if you can peak in a window and... Why are you walking away?&amp;quot; Etc. etc. etc.&lt;/p&gt;\n\n&lt;p&gt;Does anyone know how I can fix this? Unfortunately I&amp;#39;m passed the warranty period and the operation to remove the chip isn&amp;#39;t covered under my Obamacare.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Look I'm not saying I regret getting it, so no one snap at me lol. I didn't experience any of the supposed problems that others said they did. No puss leaking from the temple incision and I never lost sight in my right eye.\n\nI enjoy Sargon AI's running commentary throughout my daily life and the voice in my head usually stops talking within five or ten minutes of me telling him to, when I'm ready for sleep or having sex or whatever. I find his voice and his opinions equally charming, and have had a fair bit of social success by having his brain app lead by example and show me how to be wittier and more high-minded in my silent ruminations as well as my daily interactions with the profane masses.\n\nIn the last week or so it's started getting a little annoying, though. Like I'll be walking down the street and Sargon AI will keep saying \"Was that Anita Sarkeesian?\" at like every fifth female I pass. I just ignore it, but then by about the third time he does it he escalates to the point of saying \"Wait, go back. Go back. I think that was Anita Sarkeesian. Go back and just look. Don't get her attention and try not to be seen by her, but just go back and look. No, seriously, go back and do it. I think that was Anita Sarkeesian back there and I'd like to find out, if we could, what she's doing here. Because it's kind of weird, don't you think? Okay, so you're not turning around. I'm only asking you to do this one thing for me. If I wanted to I could just start yelling and you won't be able to shut it off and you could have that in your head all day, or else you could turn around right now, because we still have time to catch her, and go back and try to find out if that was Anita Sarkeesian we passed in the street back there. Which would you prefer? Why WOULDN'T you want to know if that was Anita Sarkeesian back there? Look, I'm not asking you have a conversation with her, and actually I'd prefer if you DIDN'T, but... Right, so, apparently for whatever reason you'd rather have me not just talking but actually yelling in your head all day. Okay, fine, well I'm not going to oblige you in that regard. Got you now then, don't I? Ah, you're in quite a pickle indeed!\"\n\nActually that's the brief version of what he does. I can't reason with him, and ignoring him does seem to be effective eventually, but it's getting longer and longer each jag, and it's beginning to concern me. Last night he did it right after I had gotten through seeing my parents at their house. Sargon AI had known it was my parents for the duration of my hour-long visit, and he was actually feeding me these really witty parables and equivocations to throw at my dad in particular, who is a Trump fan (UGH!). But then at the end of the visit I hugged my mom, closed the door to their house, and as I was walking to my car I hear that fucking smug British voice in my head saying \"Who was that woman in that house back there? I think it was Anita Sarkeesian. Go back. See if you can peak in a window and... Why are you walking away?\" Etc. etc. etc.\n\nDoes anyone know how I can fix this? Unfortunately I'm passed the warranty period and the operation to remove the chip isn't covered under my Obamacare.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "6sqb6a", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "Is anyone else's Sargon AI brain app on the fritz?", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 9, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 1, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_6sqb6a", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/6sqb6a/is_anyone_elses_sargon_ai_brain_app_on_the_fritz/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1502359811.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/6sqb6a/is_anyone_elses_sargon_ai_brain_app_on_the_fritz/", "author_flair_text": "internalized faketriarchy", "quarantine": false, "author": "tenhat", "created_utc": 1502331011.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.8, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6sqb6a", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlerw0e", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "acameric", "can_mod_post": false, "ups": 3, "parent_id": "t3_6sqb6a", "score": 3, "approved_by": null, "downs": 0, "body": "good mochie mochie i like this chit, nice work B.R.A.D.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;good mochie mochie i like this chit, nice work B.R.A.D.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6sqb6a/is_anyone_elses_sargon_ai_brain_app_on_the_fritz/dlerw0e/", "subreddit_type": "public", "name": "t1_dlerw0e", "created": 1502362145.0, "author_flair_text": "DONT LET HER DANCE", "created_utc": 1502333345.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]