[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In marketing research, trend prediction is vital to forseeing future consumer activity and preparing for it to gain an economic upper hand. This concept is even more important in fashion, where the company that sets the trends and rakes in the money usually comes down to who&amp;#39;s got the best fashion forecast agency, and thus the best prediction of what stylistic direction to go in.\nInstead of deducing what textiles, colors, and fabrics the average consumer will want to find on the runway next season, we&amp;#39;ll be using fashion forecasting tactics to predict what kinds of memes people will see across the internet.\nCheif among the tactics fashion forecasters use to predict trends is market research, and usually this means studying what consumers are buying now and drawing an idea of what consumers will buy later based on this information. Looking at the &amp;quot;popular&amp;quot; page on KYM gives you... cancer. But we&amp;#39;re going to stick our arms all the way down the shit bucket to try and figure out what&amp;#39;s comin&amp;#39; up in memes.\nYou&amp;#39;ll notice the majority of the memes are rage faces. That is, comic characters used to convey a specific emotion. It&amp;#39;s safe to assume that more and more rage faces will emerge, but this assumption is an easy one to make. We need to go deeper than that.\nMany popular memes also derive from already popular viral videos, especially video games. Many memes revolve solely around oft-referenced events in pop culture. But what does this mean for the memes of tomorrow? I think this means that tomorrow internet memes will come from the popular media of today. In film, lines from Frozen have become memes in their own right, and I believe the next Disney film will spark a new host of one liners around the internet. In music, Taylor Swift&amp;#39;s hit &amp;quot;Shake it Off&amp;quot; is currently at the number one spot on the billboard 100, and the album of which it is the lead single, &amp;quot;1984&amp;quot;, has been certified Gold by the BPI (the RIAA hasn&amp;#39;t certified it yet), and her public life has been the subject of significant media attention as of late. I predict the phrase &amp;quot;shake it off&amp;quot; will become a meme akin to &amp;quot;haters gonna hate&amp;quot;, like the British act Frankie Goes to Hollywood popularized the phrase &amp;quot;Frankie Says&amp;quot; in the mid 80s, a phrase which has appeared on numerous t-shirts and is still a novelty amongst 80s fans.\nAnother tactic employed by fashion forecasters is analyzing what niches are left to fill in the industry. With something like internet memes, this is difficult to do. But, after carefully looking at recent trends and popular videos, images and phrases on the internet, I&amp;#39;ve come to the conclusion that weeaboos haven&amp;#39;t yet made an anime meme about everything, so we can expect to see even more shitty anime memes in the near future.\nAs for the rest, all we can do is speculate. Pretty much any trends in the internet revolve around viral videos and recent events, especially news, so it&amp;#39;s entirely possible that you could even set a trend. Go film your cat doing cat things or mutilate a family. The internet trends of tomorrow are up to you!*&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "In marketing research, trend prediction is vital to forseeing future consumer activity and preparing for it to gain an economic upper hand. This concept is even more important in fashion, where the company that sets the trends and rakes in the money usually comes down to who's got the best fashion forecast agency, and thus the best prediction of what stylistic direction to go in.\nInstead of deducing what textiles, colors, and fabrics the average consumer will want to find on the runway next season, we'll be using fashion forecasting tactics to predict what kinds of memes people will see across the internet.\nCheif among the tactics fashion forecasters use to predict trends is market research, and usually this means studying what consumers are buying now and drawing an idea of what consumers will buy later based on this information. Looking at the \"popular\" page on KYM gives you... cancer. But we're going to stick our arms all the way down the shit bucket to try and figure out what's comin' up in memes.\nYou'll notice the majority of the memes are rage faces. That is, comic characters used to convey a specific emotion. It's safe to assume that more and more rage faces will emerge, but this assumption is an easy one to make. We need to go deeper than that.\nMany popular memes also derive from already popular viral videos, especially video games. Many memes revolve solely around oft-referenced events in pop culture. But what does this mean for the memes of tomorrow? I think this means that tomorrow internet memes will come from the popular media of today. In film, lines from Frozen have become memes in their own right, and I believe the next Disney film will spark a new host of one liners around the internet. In music, Taylor Swift's hit \"Shake it Off\" is currently at the number one spot on the billboard 100, and the album of which it is the lead single, \"1984\", has been certified Gold by the BPI (the RIAA hasn't certified it yet), and her public life has been the subject of significant media attention as of late. I predict the phrase \"shake it off\" will become a meme akin to \"haters gonna hate\", like the British act Frankie Goes to Hollywood popularized the phrase \"Frankie Says\" in the mid 80s, a phrase which has appeared on numerous t-shirts and is still a novelty amongst 80s fans.\nAnother tactic employed by fashion forecasters is analyzing what niches are left to fill in the industry. With something like internet memes, this is difficult to do. But, after carefully looking at recent trends and popular videos, images and phrases on the internet, I've come to the conclusion that weeaboos haven't yet made an anime meme about everything, so we can expect to see even more shitty anime memes in the near future.\nAs for the rest, all we can do is speculate. Pretty much any trends in the internet revolve around viral videos and recent events, especially news, so it's entirely possible that you could even set a trend. Go film your cat doing cat things or mutilate a family. The internet trends of tomorrow are up to you!*", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "661537", "banned_at_utc": null, "view_count": null, "archived": true, "clicked": false, "report_reasons": null, "title": "How can we use the trends of today to predict the memes of tomorrow?", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 2, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_661537", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/661537/how_can_we_use_the_trends_of_today_to_predict_the/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1492524846.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/661537/how_can_we_use_the_trends_of_today_to_predict_the/", "author_flair_text": "DONT LET HER DANCE", "quarantine": false, "author": "acameric", "created_utc": 1492496046.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.66, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_661537", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dgf8fzy", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "reversetranscriptACE", "can_mod_post": false, "ups": 3, "parent_id": "t3_661537", "score": 3, "approved_by": null, "downs": 0, "body": "Tldr faggot learn to use paragraphs", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tldr faggot learn to use paragraphs&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/661537/how_can_we_use_the_trends_of_today_to_predict_the/dgf8fzy/", "subreddit_type": "public", "name": "t1_dgf8fzy", "created": 1492556978.0, "author_flair_text": null, "created_utc": 1492528178.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_661537", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dgeus34", "banned_at_utc": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t3_661537", "score": 1, "approved_by": null, "downs": 0, "body": "Since hipsters always seem to ironically dress up in ugly grandpa clothes, I would say that it's very safe to invest in socks and sandals.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since hipsters always seem to ironically dress up in ugly grandpa clothes, I would say that it&amp;#39;s very safe to invest in socks and sandals.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/661537/how_can_we_use_the_trends_of_today_to_predict_the/dgeus34/", "subreddit_type": "public", "name": "t1_dgeus34", "created": 1492530487.0, "author_flair_text": null, "created_utc": 1492501687.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]