[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ichigo rested his head in his hands as he looked over the homework he had completed over the last two hours. It had only taken him two hours because the woman in his closet kept consuming his thoughts. He just happened to receive homework from every teacher that day, and seeing as the hollows weren&amp;#39;t on the hunt tonight, he thought he better get it out of the way while he could. He looked down at his watch; 11:30. He collapsed from his chair into his bed, not bothering to put the light off as he slipped into the sheets. He took his shirt off and just tossed it at the end of his bed. He closed his eye tight, hoping that he could fall asleep with the light on so he wouldn&amp;#39;t have to get up again. He twitched slighted as he heard the closet door open, knowing that a violet haired woman was going to very angry with him.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Dammit Ichigo! Why couldn&amp;#39;t you turn the damn lights off?&amp;quot; Rukia said in her chappy pyjamas, her arms crossed in front of her chest. He opened his eyes and looked in her direction, only to see a slight blush across her face and her looking down at the ground. He couldn&amp;#39;t help but think about how cute she looked.&lt;/p&gt;\n\n&lt;p&gt;Ichigo just rolled over, facing away from Rukia and towards his wall. He smirked at her reaction. He heard her mumble his name again but he didn&amp;#39;t give her an answer. He felt something soft hit him. He looked down towards the bottom of his bed and saw Rukia&amp;#39;s pillow and laughed.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You really think throwing one pillow at me is going to make me turn off the lights?&amp;quot; Ichigo teased as he took Rukia&amp;#39;s pillow and put in under his head. He kept facing away from her, knowing it would just make her even angrier. Then he felt another pillow, and another pillow and another one hit him hard. He scrunched his eyebrows up and sat up and faced Rukia in confusion, only to be hit with multiple pillows.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Rukia! What the hell!?&amp;quot; Ichigo yelled as he looked around his bed at all the pillows, they were all different shapes and sizes.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What?&amp;quot; Rukia asked in an innocent tone as she let her legs dangle out of the closet. She still had that tint of blush in her cheeks. Ichigo just looked at her, dumbfounded.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Where…where did you get all these pillows from?&amp;quot; Ichigo asked as he looked around his bed, still confused. Rukia just giggled at him, making Ichigo look over at her with an angry face.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;ve always slept with pillows.&amp;quot; Rukia said casually, receiving an even more confused look from Ichigo.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;How do you even fit in there with all these?&amp;quot; Ichigo asked picking up a large pillow and looking between it and Rukia. Rukia just shrugged.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Just give me my pillows back and turn the lights off. I&amp;#39;m tired.&amp;quot; Rukia said in her best bossy tone. Ichigo just smirked again, shaking his head.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re already up, you turn off the lights&amp;quot; Ichigo said as he slowly picked up all of Rukia&amp;#39;s pillows and put them on the wall side of his bed. He heard Rukia&amp;#39;s feet hit the floor, and her faint footsteps got closer towards him.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ichigo, give me my pillows&amp;quot; Rukia said in a commanding voice as she shook his shoulder. He just laughed.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No way, turn the lights off. I thought you were tired?&amp;quot; Ichigo asked as he tucked one of Rukia&amp;#39;s pillows behind his head.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s when he felt a very small fist hit him hard against his cheek.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ouch!&amp;quot; Ichigo said angrily.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I said give me my pillows!&amp;quot; Rukia yelled trying to grab one of her pillows away from Ichigo. Ichigo grabbed the other end of the pillow and pulled, causing Rukia to fall on top of him, pillow still tight in her hands. She gave him the biggest evils she could manage, even though her face was going red. Ichigo sat up, he still held onto Rukia&amp;#39;s pillow. She moved so she was sitting on top of the blanket, but sitting in his lap. She smiled when she saw Ichigo&amp;#39;s cheeks blush.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Why do you want them so bad?&amp;quot; Ichigo asked, giving a slight tug at the pillow. Rukia just shook her head.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Just give them back&amp;quot; Rukia whispered as he head was facing down, her eyes fixated on the pillow her and Ichigo were holding onto.&lt;/p&gt;\n\n&lt;p&gt;Ichigo studied her for a moment, then sighed and tried to look her in the eyes. He moved his free hand and tilted her chin up, forcing her to look at him. He could see the loneliness deep in her eyes.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What&amp;#39;s wrong&amp;quot; Ichigo asked in a soft voice, one he didn&amp;#39;t use often. Rukia stared into his eyes and an idea came to her.&lt;/p&gt;\n\n&lt;p&gt;She hoped off Ichigo&amp;#39;s bed and switched the light off. Ichigo didn&amp;#39;t take his eyes off her the whole time he could make her small frame out in the dark, the moonlight had crept into his room threw his window. She walked towards his bed and climbed over him to where her pillows were. She jumped underneath the covers and cuddled up to her pillows, her back facing Ichigo. Ichigo lay down on his back and looked towards Rukia.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You gonna tell me?&amp;quot; Ichigo asked quietly as Rukia moved lay still.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You really want to know?&amp;quot; Rukia asked in a whisper, not moving an inch. Ichigo mumbled what sounded a lot like &amp;#39;of corse I do or I wouldn&amp;#39;t have asked&amp;#39;. Rukia smiled, same old Ichigo.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I guess ever since I was little, I liked having someone to sleep with. Just so I wouldn&amp;#39;t feel so alone. When I was a kid, all of my friends would share a bed. But I guess it was so we wouldn&amp;#39;t go cold…&amp;quot; Rukia said as she turned over to lie on her back along with Ichigo.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Then in my academy days, I started sleeping with a few extra pillows. The nights just seemed long and lonely, and the Byakuya adopted me. He lived on one side of the house and I was on the other, and it was just me and him. I felt really lonely, and I just kept buying pillows. I don&amp;#39;t know why, but they make me feel like someone&amp;#39;s there…&amp;quot; Rukia said in a small voice, Ichigo looked at her. He searched for her hand under the blankets, and when he found it he held it tight.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You can sleep here if you feel lonely.&amp;quot; Ichigo said as that familiar red slowly appeared back to his cheeks. Rukia turned around and found her way to Ichigo&amp;#39;s shoulder and rested her arm on his chest. Ichigo placed his arm around her, pulling her closer to him. Ichigo kissed her head softly.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Goodnight Rukia&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Ichigo rested his head in his hands as he looked over the homework he had completed over the last two hours. It had only taken him two hours because the woman in his closet kept consuming his thoughts. He just happened to receive homework from every teacher that day, and seeing as the hollows weren't on the hunt tonight, he thought he better get it out of the way while he could. He looked down at his watch; 11:30. He collapsed from his chair into his bed, not bothering to put the light off as he slipped into the sheets. He took his shirt off and just tossed it at the end of his bed. He closed his eye tight, hoping that he could fall asleep with the light on so he wouldn't have to get up again. He twitched slighted as he heard the closet door open, knowing that a violet haired woman was going to very angry with him.\n\n\"Dammit Ichigo! Why couldn't you turn the damn lights off?\" Rukia said in her chappy pyjamas, her arms crossed in front of her chest. He opened his eyes and looked in her direction, only to see a slight blush across her face and her looking down at the ground. He couldn't help but think about how cute she looked.\n\nIchigo just rolled over, facing away from Rukia and towards his wall. He smirked at her reaction. He heard her mumble his name again but he didn't give her an answer. He felt something soft hit him. He looked down towards the bottom of his bed and saw Rukia's pillow and laughed.\n\n\"You really think throwing one pillow at me is going to make me turn off the lights?\" Ichigo teased as he took Rukia's pillow and put in under his head. He kept facing away from her, knowing it would just make her even angrier. Then he felt another pillow, and another pillow and another one hit him hard. He scrunched his eyebrows up and sat up and faced Rukia in confusion, only to be hit with multiple pillows.\n\n\"Rukia! What the hell!?\" Ichigo yelled as he looked around his bed at all the pillows, they were all different shapes and sizes.\n\n\"What?\" Rukia asked in an innocent tone as she let her legs dangle out of the closet. She still had that tint of blush in her cheeks. Ichigo just looked at her, dumbfounded.\n\n\"Where…where did you get all these pillows from?\" Ichigo asked as he looked around his bed, still confused. Rukia just giggled at him, making Ichigo look over at her with an angry face.\n\n\"I've always slept with pillows.\" Rukia said casually, receiving an even more confused look from Ichigo.\n\n\"How do you even fit in there with all these?\" Ichigo asked picking up a large pillow and looking between it and Rukia. Rukia just shrugged.\n\n\"Just give me my pillows back and turn the lights off. I'm tired.\" Rukia said in her best bossy tone. Ichigo just smirked again, shaking his head.\n\n\"You're already up, you turn off the lights\" Ichigo said as he slowly picked up all of Rukia's pillows and put them on the wall side of his bed. He heard Rukia's feet hit the floor, and her faint footsteps got closer towards him.\n\n\"Ichigo, give me my pillows\" Rukia said in a commanding voice as she shook his shoulder. He just laughed.\n\n\"No way, turn the lights off. I thought you were tired?\" Ichigo asked as he tucked one of Rukia's pillows behind his head.\n\nThat's when he felt a very small fist hit him hard against his cheek.\n\n\"Ouch!\" Ichigo said angrily.\n\n\"I said give me my pillows!\" Rukia yelled trying to grab one of her pillows away from Ichigo. Ichigo grabbed the other end of the pillow and pulled, causing Rukia to fall on top of him, pillow still tight in her hands. She gave him the biggest evils she could manage, even though her face was going red. Ichigo sat up, he still held onto Rukia's pillow. She moved so she was sitting on top of the blanket, but sitting in his lap. She smiled when she saw Ichigo's cheeks blush.\n\n\"Why do you want them so bad?\" Ichigo asked, giving a slight tug at the pillow. Rukia just shook her head.\n\n\"Just give them back\" Rukia whispered as he head was facing down, her eyes fixated on the pillow her and Ichigo were holding onto.\n\nIchigo studied her for a moment, then sighed and tried to look her in the eyes. He moved his free hand and tilted her chin up, forcing her to look at him. He could see the loneliness deep in her eyes.\n\n\"What's wrong\" Ichigo asked in a soft voice, one he didn't use often. Rukia stared into his eyes and an idea came to her.\n\nShe hoped off Ichigo's bed and switched the light off. Ichigo didn't take his eyes off her the whole time he could make her small frame out in the dark, the moonlight had crept into his room threw his window. She walked towards his bed and climbed over him to where her pillows were. She jumped underneath the covers and cuddled up to her pillows, her back facing Ichigo. Ichigo lay down on his back and looked towards Rukia.\n\n\"You gonna tell me?\" Ichigo asked quietly as Rukia moved lay still.\n\n\"You really want to know?\" Rukia asked in a whisper, not moving an inch. Ichigo mumbled what sounded a lot like 'of corse I do or I wouldn't have asked'. Rukia smiled, same old Ichigo.\n\n\"I guess ever since I was little, I liked having someone to sleep with. Just so I wouldn't feel so alone. When I was a kid, all of my friends would share a bed. But I guess it was so we wouldn't go cold…\" Rukia said as she turned over to lie on her back along with Ichigo.\n\n\"Then in my academy days, I started sleeping with a few extra pillows. The nights just seemed long and lonely, and the Byakuya adopted me. He lived on one side of the house and I was on the other, and it was just me and him. I felt really lonely, and I just kept buying pillows. I don't know why, but they make me feel like someone's there…\" Rukia said in a small voice, Ichigo looked at her. He searched for her hand under the blankets, and when he found it he held it tight.\n\n\"You can sleep here if you feel lonely.\" Ichigo said as that familiar red slowly appeared back to his cheeks. Rukia turned around and found her way to Ichigo's shoulder and rested her arm on his chest. Ichigo placed his arm around her, pulling her closer to him. Ichigo kissed her head softly.\n\n\"Goodnight Rukia\"", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "6sjolt", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "I'm so despondent about everything. Everything I try goes totally wrong. There's no escape from this hole here. I feel drained. So far, I still haven't found a real purpose in life. Sometimes, I'm afraid to get out of bed in the morning. There's nothing to get up for.", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 3, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_6sjolt", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/6sjolt/im_so_despondent_about_everything_everything_i/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1502289127.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/6sjolt/im_so_despondent_about_everything_everything_i/", "author_flair_text": "when my field hockey wife asked me to marry her i said yes", "quarantine": false, "author": "MitchellTrutitsky", "created_utc": 1502260327.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.44, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6sjolt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6sjolt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6sjolt", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dldi9jv", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Love_Em", "can_mod_post": false, "ups": 1, "parent_id": "t1_dlda6y5", "score": 1, "approved_by": null, "downs": 0, "body": "Rukia is Gin's conquest.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rukia is Gin&amp;#39;s conquest.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6sjolt/im_so_despondent_about_everything_everything_i/dldi9jv/", "subreddit_type": "public", "name": "t1_dldi9jv", "created": 1502309384.0, "author_flair_text": null, "created_utc": 1502280584.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dlda6y5", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "MitchellTrutitsky", "can_mod_post": false, "ups": 1, "parent_id": "t1_dlda2zy", "score": 1, "approved_by": null, "downs": 0, "body": "Pig", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pig&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6sjolt/im_so_despondent_about_everything_everything_i/dlda6y5/", "subreddit_type": "public", "name": "t1_dlda6y5", "created": 1502290004.0, "author_flair_text": "when my field hockey wife asked me to marry her i said yes", "created_utc": 1502261204.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dlda2zy", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "sherdickofnuttingham", "can_mod_post": false, "ups": 2, "parent_id": "t3_6sjolt", "score": 2, "approved_by": null, "downs": 0, "body": "I was waiting for them to fuck and was excited, but am profoundly disappointed", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was waiting for them to fuck and was excited, but am profoundly disappointed&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6sjolt/im_so_despondent_about_everything_everything_i/dlda2zy/", "subreddit_type": "public", "name": "t1_dlda2zy", "created": 1502289767.0, "author_flair_text": null, "created_utc": 1502260967.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]