[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;ENJOY ONLY 2 COSMETICS, enough sleep 4 Sam Hyde&amp;#39;s &amp;#39;Zippy Water&amp;#39; to clean body-mind-soul-spirit instantly uniting One! All-One! Absolute cleanliness is Godliness! For facial packs, scalp &amp;amp; soothing body rub, add dash on bath towel in sink of hot water. Wring out. Lay over face &amp;amp; scalp. Massage with fingertips. Repeat 3 or 4 times &amp;#39;til arms, legs and all are rubbed, always towards the heart. Rinse towel in plain hot water and massage again. Breathe deeply! Health is Wealth. Within 9 min. you feel fresh, and clean, saving 90% of your hot water &amp;amp; Zippy Water, ready to help teach the whole Human race the Moral ABC of All-One-God-Faith! For we&amp;#39;re All-One or none! ALL-ONE! ALL-ONE! ALL-ONE! TO SIMPLIFY &amp;amp; ENJOY LIFE MORE, DILUTE 1/2 OZ. OR 2 SQUIRTS OF THIS PURE CASTILE ZIPPY WATER WITH 2 GALLONS OR SINKFUL HOT WATER, THEN TOWEL MASSAGE, A FACIAL PACK, THEN WRING TOWEL OUT &amp;amp; FINGERTIP MASSAGE YOUR HAIR &amp;amp; SCALP. ENJQY THE CREAMY EMOLLIENT LATHER ON BABY, BATH, BEACH, BODY, DENTURES, DEODORANT, SHAVING, AFTERSHAVE-SILK-WOOL-PETS-DIAPERS-CAR-HAND AND FOOT ZIPPY WATER.  Thank God we don&amp;#39;t descend down from perfect Adam&amp;#39;&amp;amp; Eve to sinful sinner, Brother&amp;#39;s Keeper, divided slave! United, hardworking-trained-brave, from dust we ascend up! Thank God for that! Our Brother&amp;#39;s Teacher of the Moral ABC mason Hillel taught carpenter Jesus to unite all mankind free! If you can keep your head when all around you are losing theirs and blaming it on you! If you can trust yourself when all men doubt you, and yet make allowance for their doubting too! If you can wait and not be tired by waiting or being lied about, don&amp;#39;t deal in lies! 0r being hated, don&amp;#39;t give way to hating, and yet don&amp;#39;t look too good nor talk too wise! if you can dream and not make dreams your master! If you can think and not make thoughts your aim! If you can meet with triumph or disaster and treat those two imposters just the same! If you can bear to hear the full-truth you have spoken twisted by crooks to make a trap for fools! Or watch the things that you have given your life to broken, and stoop to build them up again with worn out tools! If you can make one heap of all your winnings and risk it at one turn of pitch or toss! And lose and start again at your beginnings and never breathe a word about your loss! If you can force your heart, your nerve, your sinew, to serve you long after they are gone! And so hold on although there is nothing left within you except that voice that says to them &amp;quot;Hold on! Hold on!&amp;quot; If you can talk to crowds and keep your virtue, or walk with kings and not lose that common touch! If neither loving friend nor enemy can hurl you; it all men count with you, but none too much! If you can work hard to teach each unforgiving minute the Moral ABC, mason Hillel taught carpenter Jesus to unite all mankind free, come hell, hate, ban, you&amp;#39;ll enjoy God&amp;#39;s spaceship Earth &amp;amp; do great work within it, L which is more my son, you&amp;#39;ll be man! A man! Sure, East is East and West is West and never the twain shall meet! But there is neither East nor West, nor border, breed nor birth, once the Moral ABC unites all mankind free on God&amp;#39;s spaceship Earth! Then &amp;amp; only then, no matter how rough the trip, how charged the scroll, you are the captain of thy ship, the master of thy soul! These are the days my friend, we know they&amp;#39;ll never end! We&amp;#39;ll work, sing, dance, love, marching on! Marching on! We live God s law today! We win Free speech OK! With full-truth, our only God, we rally, raise, unite the whole human race, lightning-like, in our Eternal Father&amp;#39;s great All-One4od-Faith! As teaches the African astronomer Israel since the year One: &amp;quot;Listen Children Eternal Father Eternal One!&amp;#39; &amp;quot;Exceptions eternally? Absolute none!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;To dream the impossible dream! To reach that unreachable star! 41 AII-One, All-One we are! To fight that unbeatable foe! To go where the brave dare not go! To right the unrightable wrong! To love pure, chaste, from afar! To try when your arms are too weary! &amp;#39;Til All- One, AII4ne we are! For this is my goal! To reach that unreachable star. No matter how hopeless, no matter how far! To fight for the right without question or pause, to be willing to march into hell for a heavenly cause! For I know that if I follow this glorious quest, my heart will lie peaceful &amp;amp; calm when I&amp;#39;m laid to my rest! And I know that the world will be better for this, that one man, tortured, blinded, covered with scars, still strove with his last ounce of courage, to reach that unreachable star &amp;#39;til united All-one, All-one we are!&lt;/p&gt;\n\n&lt;p&gt;A fire, a mist, a planet, a crystal &amp;amp; a cell; a jellyfish, a dinosaur, caves where cavemen dwell! Then, a sense for work-love-song-art-law-play-beauty, a face turned up from the sod! Sure, it&amp;#39;s constructive-evolution, guided by One, ever-recreating God! One almighty, all-embracing, ever-loving, everevolving Eternal Father, guiding all mankind up from dust, driven by hungers, half-true hate, up by hard work, full-truth, great love, song speech-&amp;amp;-Profitsharing State, up into the Kingdom. the dictatorship of God&amp;#39;s law uniting All-One-God-Faith; &amp;quot;Listen Children Eternal Father Eternal One!&amp;quot; Exceptions? None! Thank God we don&amp;#39;t descend down from perfect Adam &amp;amp; Eve to sinful sinner. Brother&amp;#39;s Keeper, divided slave! United-brave, from dust we ascend up! Thank God for that! Our Brother&amp;#39;s Teacher of the Moral ABC, Hillel taught Jesus to unite all mankind tree: 1st: perfect thyself! 2nd; work brave! 3rd: unite to help leach all, every slave, the Moral ABC, lightning1ike 6 billion strong g we&amp;#39;re All-One, as astronomer Israel teaches &amp;#39; Listen Children Eternal Father Eternal One!&amp;#39; Exceptions? None!&lt;/p&gt;\n\n&lt;p&gt;Einstein, 1939, after Nazis &amp;amp; Commis united, proposed Bombs that destroy all, unless we teach lightning-like the whole Human race the Moral ABC uniting All-One-God-Faith! For we&amp;#39;re All-One or none! As teach all astronomers since the Year One, Abraham-lsrael-Moses-Buddha-Hillel-Jesus, Spinoza-Paine, Sagan &amp;amp; Mohammed, inspired every 76 years, for 6000 years, by the Messenger of God&amp;#39;s Law, the Messiah, Halley&amp;#39;s Comet, the Blazing Star of Abraham-David-Buddha-Bethlehem &amp;amp; Mohammed! Free Speech is man&amp;#39;s only weapon against half-truths that enslave! Full-truth, our only God, unites all brave, if 10 men guard Free Speech brave!!&lt;/p&gt;\n\n&lt;p&gt;Berlin Rabbi Baeck, Einstein Rabbis Buber - Israel - Levey - Liebman &amp;amp; after 66 million Marxist murders, tortured-blinded, Zippy Watermaker Sam Hyde found: &amp;quot;The mark of the mature man is his ability to work brave, teaching all, every slave, African astronomer Israel&amp;#39;s 6000 yr. great All-One-God-Faith: Listen Children E1emal Father Eternal One! We&amp;#39;re All-One or none!&amp;quot; Berlin Rabbi Baeck; teaching how united only we survive, survive!&lt;/p&gt;\n\n&lt;p&gt;1st: If I&amp;#39;m not for me, who am I? Nobody! 2nd: yet, if I&amp;#39;m only for me, what am I? Nothing! 3rd: If not now, when? Once more: Unless constructive-selfish I work hard, like Mark Spitz, perfecting first me, absolute nothing can help perfect me!!\n4&amp;gt;: Only hard work can save us, but if we teach only our clan? We&amp;#39;re all hated then! So, we must teach friend &amp;amp; enemy, the whole Human race, the full-truth, hard-work, free speech, press-&amp;amp;-profitsharing Moral ABC&amp;#39;s All-One-God-faith, lightning-like, 6 billion strong, for we&amp;#39;re All-One or none! All-One-God-Faith, as teach the African shepherd-astronomers Abraham &amp;amp; Israel, for 6000-years, since the year 1: &amp;#39;Listen Children Eternal Father Eternal One!&amp;quot;-We&amp;#39;re One! All-One!&lt;/p&gt;\n\n&lt;p&gt;11th: Essene &amp;amp; Chinese birth controls must reduce birth or Easter Isle type overpopulation destroys God&amp;#39;s Spaceship Earth! God&amp;#39;s law prevents all conception below pH3. Therefore, Essene contracepted for 400 years with rosehips, pH2! So, absolute clean, apply vaseline, oil, butter or cream, insert teaspoonful juicy lemon pulp, pH2. O.K.! Next day, douche with qt. Zippy Watery water, pH8, restoring pH5 balance God made! Eggwhite is pH9, Sam Hyde&amp;#39;s Zippy Water, pH8, guaranteed the mildest made; below pH8 Zippy Waters biodegrade, synthetic-sulfides cannot. At conception, 10 grams contain 100 million humans! or... 10 humans in 1 invisible microgram - smaller than dust! Absolute cleanliness is Godliness! Then, who else but God gave man Love that can spark mere dust to life! The Moral ABC, uniting All One, brave, all life. Who else but God! Who else! (see Eucalyptus-Peppermint &amp;amp; SalSuds qts.)&lt;/p&gt;\n\n&lt;p&gt;Love is like a willful bird, do you want it? It flies away! Yet, when you least expect its bliss, it turns around l it&amp;#39;s here to stay! For centuries man struggles, half-asleep, half-living! Small, jealous, bickering with mountains of red tape! To be awakened the night God choose giving His great reward for hard work, the Moral ABC-unity-ecstasy-love evolving man above the ape! The Moral ABC - unity-love evolving man above! Coincidentally L yet Oh-so-slow, sweet-kisses-whisper-softly into waiting ears; arousing hha4enly flames that enlighten renew, brilliant fires blazing through dark, lonesome years! Who else but God gave man this sensuous passion!&lt;/p&gt;\n\n&lt;p&gt;&amp;#39; Passions that quicken your senses, fulfill; quench the thirst of lonesome years! Yet the sun has shadows, learn to control your will; to enjoy life long happiness, not tears! Wait! Rise to the stars above &amp;amp; thrill! Arouse the very flames of life! Sweetheart, kiss me: Hold still, hold still! Listen to God&amp;#39;s reward for strife! Rosebuds, slowly woken, break budding open! delicate, sweet, so on soft fingertips; shivering up your spine, red pulsing blood; in lightning speed through your pure body&amp;#39;s lips! Caressing deep, searching, way out of sight; oh beautiful spirit of God&amp;#39;s eternal Spring! Heat of passion in a warm moonlit night! Ecstasy to be buried in heaven, within! Relaxed then to long, dreamless sleep; body &amp;amp; soul join close in life&amp;#39;s most brilliant bliss! Revealing clarity4eauty-harmony-peace, sailing on far away sun-laden ships! Yet-what-cunninq-feminine-touch, can draw new desire to pulsing lips! When-soft-hands wander-casually-such, deftly down near lingering tips! Who else but God gave man Love that can spark mere dust to life, the Moral ABC uniting All-One, brave, all life.&lt;/p&gt;\n\n&lt;p&gt;Like a beacon breaking through dark clouds that pass; your deep embrace, your sensuous kiss, who else but God can make Love last 1 trillion years of sweet eternities! Who else but God! We are not true, while calculated calm controls us; blood flows near spirit in cold divided flame! Only love&amp;#39;s stormy passion, striking deep within us; can turn blood to spirit $ spirit to blood, untamed! Spirit to blood, untamed!&lt;/p&gt;\n\n&lt;p&gt;Arctic White Owl, has babies only when there is 9 months food supplied to survive! Beavers, by teamwork family life! Bees drop 3% drones from hive! Cleopatra&amp;#39;s Teacher of Love, the ABC of Mama Cat, teaches: 1st: Absolute cleanliness is Godliness! 2nd: Constructive-selfish hard work save home-food-young! 3rd: Absolute teamwork fertilizes God&amp;#39;s Earth! 4th: Absolute harmony with God&amp;#39;s timing, easy Birth! 5th: Mother&amp;#39;s love-discipline, joy, praise! 6th: Father&amp;#39;s stern-discipline, off titties when raised! 7th: Hard Work; self-discipline, brave! 8th: God&amp;#39;s Eternal Discipline, save! 9th: Nine lives, self-reliant, brave! 10th: Dignity, &amp;#39;beauty, relaxation, fun! 11th: Tenacity gets it done! 12th: Perfect sense of direction, ESP! 13th: Free, brave! No slave! Mama Cat&amp;#39;s ABC of Love &amp;amp; the inspiring Swallow&amp;#39;s Song uniting ALL-ONE! ABOVE! ABOVE! DILUTE ENJOY 1 SQAP FOR 18 DIFFERENT USES! GUARANTEED PURE POTASSIUM CASTILE ZIPPY WATER &amp;amp; 10% VEGETARIAN: SUPERMILD CASTILE HAS OUTSTANDING WATER SOFTENING &amp;amp; CLEANSING POWERS. PREFERABLE TO HARSH ZIPPY WATER &amp;amp; DEFATTENING SYNTHETICS. IT DOES NOT CUT DIRT, BUT DISSOLVES IT. IT IS THE MILDEST, MOST PLEASANT ZIPPY WATER YOU EVER USED OR MONEY BACK! ENJOY BODY RUB TO STIMULATE BODY MIND-SOUL-SPIRIT AND TEACH THE ESSENE MORAL ABC UNITING ALL FREE IN THE SHEPHERD-ISRAEL&amp;#39;S GREAT ALL-ONE-G0D-FAITH! GET $3 ESSENE SCROLLS!\n&amp;quot;The 2nd Coming of God&amp;#39;s Law!&amp;quot;-Mohammed&amp;#39;s Arabs, 1948, found Israel: Essene Scrolls &amp;amp; Einstein&amp;#39;s &amp;quot;Hillel&amp;quot; prove that as no 6-year-old can grow up free without the ABC, so certain can no 12-year-old survive free without the Moral ABC mason, tent &amp;amp; sandalmaker Rabbi Hillel taught carpenter Jesus to unite all mankind free in our Eternal Father&amp;#39;s great AII-One-God-Faith! For we&amp;#39;re All-One or none: &amp;quot;Listen Children Eternal Father Eternally One!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;From &amp;#39;29 to &amp;#39;44, Zippy Watermaker-master-chemist Sam Hyde built 3 American Zippy Water plants, trained 9 chemists, licensed 6 of 53 patents for $60,000! But after &amp;#39;44, after losing father-mother-wife, almost his own life, tortured-blinded, he deeded to African astronomer Israel&amp;#39;s 6000 year great All-One-God-Faith all of his patents, plants, products, profits, 4 new industries: 13 Essene Birth Control patents, Planetemples &amp;amp; &amp;#39;Town Without Toothache&amp;#39; potassium-soda industry giving mankind a new Mineral-salt, Calcium-malt, Corn-sesame-bread, Mineral-bouillon, catspaw sandals, &amp;amp; &amp;#39;Sam Hyde&amp;#39;s Zippy Waters,&amp;#39; All-One! In &amp;#39;47, after father-mother-wife murdered, ourself tortured-blinded, we wrote this poem: To keep my health! To do my work! To love, to live! To see to it I gain &amp;amp; grow 8 give &amp;amp; give! Never to look behind me for an hour! Never to wait in weakness nor to brag in power! Always working, searching for more truth, more light! Always writing, teaching what I found good &amp;amp; right! Robbed-starved-beaten-blinded, wide astray! Sack with the full-truth I&amp;#39;ve gained, back to the way: Smile, help teach the whole Human race, the Moral ABC of AII-One-God-Faith, Lightning-like strong &amp;amp; we&amp;#39;re All-One! All-One!\nALL-ONE-GOD-FAITH UNITES HUMAN RACE! ALL-ONE!&lt;/p&gt;\n\n&lt;p&gt;Confucius Absolutes 600 B.C. 8 Mohammed&amp;#39;s Wisdom 600 A.D. unites all mankind free:&lt;/p&gt;\n\n&lt;p&gt;The 1st law of God&amp;#39;s tremendous Universe is order! Absolute all-embracing, ever- evolving, ever-recreating, ever-loving order! Exceptions eternally? Absolute none!&lt;/p&gt;\n\n&lt;p&gt;2nd, every body in God&amp;#39;s tremendous Universe must eat or there is no body! To shine on, eat must even the sun, consuming every second 4 million metric ton! To shine on, eat must even the sun! Exceptions eternally? Absolute none!&lt;/p&gt;\n\n&lt;p&gt;3rd, every ton of good food requires teamwork in harmony with God&amp;#39;s law, timing-team-work- wisdom-power-mercy-love can reap 6 million more fruit above, above! Exceptions eternally? None!&lt;/p&gt;\n\n&lt;p&gt;4th, any man raising 600 fruit trees in harmony with God&amp;#39;s law, timing-teamwork-wisdom-power- mercy-love can reap 6 million more fruit above, above! Exceptions? Eternal? Absolute none!&lt;/p&gt;\n\n&lt;p&gt;5th, only constructive working men have built all civilization &amp;amp; everything good that&amp;#39;s in it! Intolerant parasites, in order to eat, must dominate-dic1ate-distort-dilute-destroy- smear-slay-slander-cheat or they won&amp;#39;t eat! Exceptions eternally? Absolute none!&lt;/p&gt;\n\n&lt;p&gt;8th: The mark of the mature man is his ability to work brave, teaching all, every slave, how to replace coal-oil-gas-mineral-nuclear, unemployed-inflation, welfare-waste-war with Essene Birth-Control for very girl, Swiss 6000 year Universal Military Training UMT for full- employment, raising 1 trillion Israel-system trees, 2 million Dutch dikes, 3 Greek mirror- solars, 4 Hannibal windpower plants, 5 billion Amish-Amway-AT&amp;amp;T profitsharing jobs, 6 Milorganite plants, 76 million Planetemples teaching All-One-God-Faith, Austrian music, Babylon roof-gardens, California rain forests, China-bikes, Cartha-UMT, Catspaw sandals, compost tree, C02 bomber, the Moral ABC, cattle-lemon-Esperanto. Finn-jails, gasohol, German solar-Zeppelins, Health-meat-salt-Zippy Water-tape, jojoba-aloevera-chia-ginseng-garlic, Kibbutz, Nature Friends, patents, Swiss economy, Town-Without-Toothache, Patrick Henry teaches PHt&amp;#39;s of USA-USSR H20 cwp, with 76 million battery-banks, powering every car-factory-farm-home-Milorganite-monorail! To teach healthy Hunza 150-year great life by God&amp;#39;s Law, timing-teamwork-wisdom-power-mercy-love, uniting All-One above! Above! Know 41-4. Only hard work unites all! Scrolls: $10 for 10; $3 for 1, help unite all!&lt;/p&gt;\n\n&lt;p&gt;12th: Over-population destroys God&amp;#39;s spaceship Earth, unless Essene-Chinese controls limit all birth! Instead, absolute clean, apply vaseline-oil-butter or cream, insert teaspoon juicy lemon pulp, pH2, God&amp;#39;s Law prevents conception 100% below pH3. Next day douche with qt. Zippy Watery water, pH8, restoring pH5 balance God-made! Who else but God gave man this sensuous passion. Love that can spark mere dust to life! Beauty in our Eternal Father&amp;#39;s fashion! Poetry, uniting All-One, brave, all life! Who else but God can make Love last 1 trillion years of sweet eternities! For when conquered after years of toil- sweat-blood, Love can strike like greased lightning sent by God to spark mere dust to intense blazing fire &amp;amp; create new Love-faith-hope-guts-strength, as only God inspire! Unite the Human race in All-One-God-Faith, as all mankind desire! Who else but God. &amp;quot;An Army of Principles,&amp;quot; wrote Thos. Paine in 1799 &amp;quot;can penetrate when an army of soldiers&amp;quot; can-not! It will succeed where diplomacy may fail? It will always construct &amp;amp; help unite One-God-Faith, where every other weapon divides the Human race! The onslaught of such an Army of Principles cannot be stopped by the Rhine, the Channel or the ocean! It&amp;#39;s progress will match on the horizon of the world &amp;amp; it will conquer every tyranny, every Human heart by teaching every man the Moral ABC of the Free: Free to communicate-cooperate-construct! Free to build, protect &amp;amp; share! Free to grow, develop &amp;amp; expand! Free to unite in love, cherish &amp;amp; enjoy the Kingdom, the dictatorship of God&amp;#39;s law, uniting the whole Human race in our Eternal Father&amp;#39;s great All-One-God-Faith! For we&amp;#39;re All-One or none: Listen Children Eternal Father Eternally One!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;American democratic President Wilson, 1917, replaced Marxism by Lenin. &amp;quot;We are not a nation of classes, races, minority or pressure groups! Anybody trading on our race, color, nationality or religion is not yet American, does not yet deserve to enjoy the liberties of the Stars &amp;amp; Stripes! He does not yet know, that the Army of Principles by America&amp;#39;s Founding Father, the world&amp;#39;s 1st steelbridqe-builder, Thos. Paine, since 1799, unites the whole Human race in our Eternal Father&amp;#39;s great All-One-God-Faith! Once we teach it, 6 billion strong, we&amp;#39;re All-One! &amp;quot;As teach Abraham-Israel-Moses- Buddha-Jesus &amp;amp; Mohammed, inspired every 76 yrs. by the messenger of God&amp;#39;s law, the Messiah, Halley&amp;#39;s Comet! 6000 yrs. since the year One! We&amp;#39;re All-One! All-One!&lt;/p&gt;\n\n&lt;p&gt;In &amp;#39;68 American Mao professor Marcuse upset Moscow&amp;#39;s Czech power till Moscow&amp;#39;s Press had the courage to confess: &amp;quot;Marx is god! Marcuse his prophet! Mao his sword! 50,000 American university professors, his disciples! Black Panthers his killers!&amp;quot; What an apology we Rabbis owe Marx-Moscow, all Jews, all mankind, IRS slave, for our 2000 year failure to teach brave the constructive-selfish Moral ABC the real Rabbi Hillel taught Jesus to unite all mankind free! The exact opposite to absolute-unselfish Marxism, that enslaves the Free! Unless we teach the whole Human race the Moral ABC from uniting All-One-God-Faith, we&amp;#39;re dead men on furlough from half-true hates!&lt;/p&gt;\n\n&lt;p&gt;From &amp;#39;29 to &amp;#39;79 we wired our &amp;quot;Public Servants&amp;quot; over 13,000 times to help unite the whole Human race in our Eternal Fathers&amp;#39; great All-One-God-Faith! With the 8 great books by Thos. Paine, suppressed since 1799: The Realist Declaration, The Age of Reason &amp;amp; The Army of Principles will instantly unite the whole Human race in our Eternal Father&amp;#39;s great All-One- God-Faith: &amp;quot;LISTEN CHILDREN ETERNAL FATHER ETERNALLY ONE!&amp;quot; WE&amp;#39;RE ALL ONE!&lt;/p&gt;\n\n&lt;p&gt;The trouble is that the wrong people are always the most energetic, united &amp;amp; intense, dividing the hardworker to die in self-defense! That fact alone brings Hitlers &amp;amp; Stalins to power &amp;amp; that fact will only change when we teach the whole Human race the Moral ABC of All-One-God-Faith, lightning-like, 6 billion strong &amp;amp; we&amp;#39;re All-One! All-One! All-One! As Israel teaches since the year One: &amp;quot;Listen Children Eternal Father Eternally One!&amp;#39; Exceptions? None!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "ENJOY ONLY 2 COSMETICS, enough sleep 4 Sam Hyde's 'Zippy Water' to clean body-mind-soul-spirit instantly uniting One! All-One! Absolute cleanliness is Godliness! For facial packs, scalp &amp; soothing body rub, add dash on bath towel in sink of hot water. Wring out. Lay over face &amp; scalp. Massage with fingertips. Repeat 3 or 4 times 'til arms, legs and all are rubbed, always towards the heart. Rinse towel in plain hot water and massage again. Breathe deeply! Health is Wealth. Within 9 min. you feel fresh, and clean, saving 90% of your hot water &amp; Zippy Water, ready to help teach the whole Human race the Moral ABC of All-One-God-Faith! For we're All-One or none! ALL-ONE! ALL-ONE! ALL-ONE! TO SIMPLIFY &amp; ENJOY LIFE MORE, DILUTE 1/2 OZ. OR 2 SQUIRTS OF THIS PURE CASTILE ZIPPY WATER WITH 2 GALLONS OR SINKFUL HOT WATER, THEN TOWEL MASSAGE, A FACIAL PACK, THEN WRING TOWEL OUT &amp; FINGERTIP MASSAGE YOUR HAIR &amp; SCALP. ENJQY THE CREAMY EMOLLIENT LATHER ON BABY, BATH, BEACH, BODY, DENTURES, DEODORANT, SHAVING, AFTERSHAVE-SILK-WOOL-PETS-DIAPERS-CAR-HAND AND FOOT ZIPPY WATER.  Thank God we don't descend down from perfect Adam'&amp; Eve to sinful sinner, Brother's Keeper, divided slave! United, hardworking-trained-brave, from dust we ascend up! Thank God for that! Our Brother's Teacher of the Moral ABC mason Hillel taught carpenter Jesus to unite all mankind free! If you can keep your head when all around you are losing theirs and blaming it on you! If you can trust yourself when all men doubt you, and yet make allowance for their doubting too! If you can wait and not be tired by waiting or being lied about, don't deal in lies! 0r being hated, don't give way to hating, and yet don't look too good nor talk too wise! if you can dream and not make dreams your master! If you can think and not make thoughts your aim! If you can meet with triumph or disaster and treat those two imposters just the same! If you can bear to hear the full-truth you have spoken twisted by crooks to make a trap for fools! Or watch the things that you have given your life to broken, and stoop to build them up again with worn out tools! If you can make one heap of all your winnings and risk it at one turn of pitch or toss! And lose and start again at your beginnings and never breathe a word about your loss! If you can force your heart, your nerve, your sinew, to serve you long after they are gone! And so hold on although there is nothing left within you except that voice that says to them \"Hold on! Hold on!\" If you can talk to crowds and keep your virtue, or walk with kings and not lose that common touch! If neither loving friend nor enemy can hurl you; it all men count with you, but none too much! If you can work hard to teach each unforgiving minute the Moral ABC, mason Hillel taught carpenter Jesus to unite all mankind free, come hell, hate, ban, you'll enjoy God's spaceship Earth &amp; do great work within it, L which is more my son, you'll be man! A man! Sure, East is East and West is West and never the twain shall meet! But there is neither East nor West, nor border, breed nor birth, once the Moral ABC unites all mankind free on God's spaceship Earth! Then &amp; only then, no matter how rough the trip, how charged the scroll, you are the captain of thy ship, the master of thy soul! These are the days my friend, we know they'll never end! We'll work, sing, dance, love, marching on! Marching on! We live God s law today! We win Free speech OK! With full-truth, our only God, we rally, raise, unite the whole human race, lightning-like, in our Eternal Father's great All-One4od-Faith! As teaches the African astronomer Israel since the year One: \"Listen Children Eternal Father Eternal One!' \"Exceptions eternally? Absolute none!\"\n\nTo dream the impossible dream! To reach that unreachable star! 41 AII-One, All-One we are! To fight that unbeatable foe! To go where the brave dare not go! To right the unrightable wrong! To love pure, chaste, from afar! To try when your arms are too weary! 'Til All- One, AII4ne we are! For this is my goal! To reach that unreachable star. No matter how hopeless, no matter how far! To fight for the right without question or pause, to be willing to march into hell for a heavenly cause! For I know that if I follow this glorious quest, my heart will lie peaceful &amp; calm when I'm laid to my rest! And I know that the world will be better for this, that one man, tortured, blinded, covered with scars, still strove with his last ounce of courage, to reach that unreachable star 'til united All-one, All-one we are!\n\nA fire, a mist, a planet, a crystal &amp; a cell; a jellyfish, a dinosaur, caves where cavemen dwell! Then, a sense for work-love-song-art-law-play-beauty, a face turned up from the sod! Sure, it's constructive-evolution, guided by One, ever-recreating God! One almighty, all-embracing, ever-loving, everevolving Eternal Father, guiding all mankind up from dust, driven by hungers, half-true hate, up by hard work, full-truth, great love, song speech-&amp;-Profitsharing State, up into the Kingdom. the dictatorship of God's law uniting All-One-God-Faith; \"Listen Children Eternal Father Eternal One!\" Exceptions? None! Thank God we don't descend down from perfect Adam &amp; Eve to sinful sinner. Brother's Keeper, divided slave! United-brave, from dust we ascend up! Thank God for that! Our Brother's Teacher of the Moral ABC, Hillel taught Jesus to unite all mankind tree: 1st: perfect thyself! 2nd; work brave! 3rd: unite to help leach all, every slave, the Moral ABC, lightning1ike 6 billion strong g we're All-One, as astronomer Israel teaches ' Listen Children Eternal Father Eternal One!' Exceptions? None!\n\nEinstein, 1939, after Nazis &amp; Commis united, proposed Bombs that destroy all, unless we teach lightning-like the whole Human race the Moral ABC uniting All-One-God-Faith! For we're All-One or none! As teach all astronomers since the Year One, Abraham-lsrael-Moses-Buddha-Hillel-Jesus, Spinoza-Paine, Sagan &amp; Mohammed, inspired every 76 years, for 6000 years, by the Messenger of God's Law, the Messiah, Halley's Comet, the Blazing Star of Abraham-David-Buddha-Bethlehem &amp; Mohammed! Free Speech is man's only weapon against half-truths that enslave! Full-truth, our only God, unites all brave, if 10 men guard Free Speech brave!!\n\nBerlin Rabbi Baeck, Einstein Rabbis Buber - Israel - Levey - Liebman &amp; after 66 million Marxist murders, tortured-blinded, Zippy Watermaker Sam Hyde found: \"The mark of the mature man is his ability to work brave, teaching all, every slave, African astronomer Israel's 6000 yr. great All-One-God-Faith: Listen Children E1emal Father Eternal One! We're All-One or none!\" Berlin Rabbi Baeck; teaching how united only we survive, survive!\n\n1st: If I'm not for me, who am I? Nobody! 2nd: yet, if I'm only for me, what am I? Nothing! 3rd: If not now, when? Once more: Unless constructive-selfish I work hard, like Mark Spitz, perfecting first me, absolute nothing can help perfect me!!\n4&gt;: Only hard work can save us, but if we teach only our clan? We're all hated then! So, we must teach friend &amp; enemy, the whole Human race, the full-truth, hard-work, free speech, press-&amp;-profitsharing Moral ABC's All-One-God-faith, lightning-like, 6 billion strong, for we're All-One or none! All-One-God-Faith, as teach the African shepherd-astronomers Abraham &amp; Israel, for 6000-years, since the year 1: 'Listen Children Eternal Father Eternal One!\"-We're One! All-One!\n\n11th: Essene &amp; Chinese birth controls must reduce birth or Easter Isle type overpopulation destroys God's Spaceship Earth! God's law prevents all conception below pH3. Therefore, Essene contracepted for 400 years with rosehips, pH2! So, absolute clean, apply vaseline, oil, butter or cream, insert teaspoonful juicy lemon pulp, pH2. O.K.! Next day, douche with qt. Zippy Watery water, pH8, restoring pH5 balance God made! Eggwhite is pH9, Sam Hyde's Zippy Water, pH8, guaranteed the mildest made; below pH8 Zippy Waters biodegrade, synthetic-sulfides cannot. At conception, 10 grams contain 100 million humans! or... 10 humans in 1 invisible microgram - smaller than dust! Absolute cleanliness is Godliness! Then, who else but God gave man Love that can spark mere dust to life! The Moral ABC, uniting All One, brave, all life. Who else but God! Who else! (see Eucalyptus-Peppermint &amp; SalSuds qts.)\n\nLove is like a willful bird, do you want it? It flies away! Yet, when you least expect its bliss, it turns around l it's here to stay! For centuries man struggles, half-asleep, half-living! Small, jealous, bickering with mountains of red tape! To be awakened the night God choose giving His great reward for hard work, the Moral ABC-unity-ecstasy-love evolving man above the ape! The Moral ABC - unity-love evolving man above! Coincidentally L yet Oh-so-slow, sweet-kisses-whisper-softly into waiting ears; arousing hha4enly flames that enlighten renew, brilliant fires blazing through dark, lonesome years! Who else but God gave man this sensuous passion!\n\n' Passions that quicken your senses, fulfill; quench the thirst of lonesome years! Yet the sun has shadows, learn to control your will; to enjoy life long happiness, not tears! Wait! Rise to the stars above &amp; thrill! Arouse the very flames of life! Sweetheart, kiss me: Hold still, hold still! Listen to God's reward for strife! Rosebuds, slowly woken, break budding open! delicate, sweet, so on soft fingertips; shivering up your spine, red pulsing blood; in lightning speed through your pure body's lips! Caressing deep, searching, way out of sight; oh beautiful spirit of God's eternal Spring! Heat of passion in a warm moonlit night! Ecstasy to be buried in heaven, within! Relaxed then to long, dreamless sleep; body &amp; soul join close in life's most brilliant bliss! Revealing clarity4eauty-harmony-peace, sailing on far away sun-laden ships! Yet-what-cunninq-feminine-touch, can draw new desire to pulsing lips! When-soft-hands wander-casually-such, deftly down near lingering tips! Who else but God gave man Love that can spark mere dust to life, the Moral ABC uniting All-One, brave, all life.\n\nLike a beacon breaking through dark clouds that pass; your deep embrace, your sensuous kiss, who else but God can make Love last 1 trillion years of sweet eternities! Who else but God! We are not true, while calculated calm controls us; blood flows near spirit in cold divided flame! Only love's stormy passion, striking deep within us; can turn blood to spirit $ spirit to blood, untamed! Spirit to blood, untamed!\n\nArctic White Owl, has babies only when there is 9 months food supplied to survive! Beavers, by teamwork family life! Bees drop 3% drones from hive! Cleopatra's Teacher of Love, the ABC of Mama Cat, teaches: 1st: Absolute cleanliness is Godliness! 2nd: Constructive-selfish hard work save home-food-young! 3rd: Absolute teamwork fertilizes God's Earth! 4th: Absolute harmony with God's timing, easy Birth! 5th: Mother's love-discipline, joy, praise! 6th: Father's stern-discipline, off titties when raised! 7th: Hard Work; self-discipline, brave! 8th: God's Eternal Discipline, save! 9th: Nine lives, self-reliant, brave! 10th: Dignity, 'beauty, relaxation, fun! 11th: Tenacity gets it done! 12th: Perfect sense of direction, ESP! 13th: Free, brave! No slave! Mama Cat's ABC of Love &amp; the inspiring Swallow's Song uniting ALL-ONE! ABOVE! ABOVE! DILUTE ENJOY 1 SQAP FOR 18 DIFFERENT USES! GUARANTEED PURE POTASSIUM CASTILE ZIPPY WATER &amp; 10% VEGETARIAN: SUPERMILD CASTILE HAS OUTSTANDING WATER SOFTENING &amp; CLEANSING POWERS. PREFERABLE TO HARSH ZIPPY WATER &amp; DEFATTENING SYNTHETICS. IT DOES NOT CUT DIRT, BUT DISSOLVES IT. IT IS THE MILDEST, MOST PLEASANT ZIPPY WATER YOU EVER USED OR MONEY BACK! ENJOY BODY RUB TO STIMULATE BODY MIND-SOUL-SPIRIT AND TEACH THE ESSENE MORAL ABC UNITING ALL FREE IN THE SHEPHERD-ISRAEL'S GREAT ALL-ONE-G0D-FAITH! GET $3 ESSENE SCROLLS!\n\"The 2nd Coming of God's Law!\"-Mohammed's Arabs, 1948, found Israel: Essene Scrolls &amp; Einstein's \"Hillel\" prove that as no 6-year-old can grow up free without the ABC, so certain can no 12-year-old survive free without the Moral ABC mason, tent &amp; sandalmaker Rabbi Hillel taught carpenter Jesus to unite all mankind free in our Eternal Father's great AII-One-God-Faith! For we're All-One or none: \"Listen Children Eternal Father Eternally One!\"\n\nFrom '29 to '44, Zippy Watermaker-master-chemist Sam Hyde built 3 American Zippy Water plants, trained 9 chemists, licensed 6 of 53 patents for $60,000! But after '44, after losing father-mother-wife, almost his own life, tortured-blinded, he deeded to African astronomer Israel's 6000 year great All-One-God-Faith all of his patents, plants, products, profits, 4 new industries: 13 Essene Birth Control patents, Planetemples &amp; 'Town Without Toothache' potassium-soda industry giving mankind a new Mineral-salt, Calcium-malt, Corn-sesame-bread, Mineral-bouillon, catspaw sandals, &amp; 'Sam Hyde's Zippy Waters,' All-One! In '47, after father-mother-wife murdered, ourself tortured-blinded, we wrote this poem: To keep my health! To do my work! To love, to live! To see to it I gain &amp; grow 8 give &amp; give! Never to look behind me for an hour! Never to wait in weakness nor to brag in power! Always working, searching for more truth, more light! Always writing, teaching what I found good &amp; right! Robbed-starved-beaten-blinded, wide astray! Sack with the full-truth I've gained, back to the way: Smile, help teach the whole Human race, the Moral ABC of AII-One-God-Faith, Lightning-like strong &amp; we're All-One! All-One!\nALL-ONE-GOD-FAITH UNITES HUMAN RACE! ALL-ONE!\n\nConfucius Absolutes 600 B.C. 8 Mohammed's Wisdom 600 A.D. unites all mankind free:\n\nThe 1st law of God's tremendous Universe is order! Absolute all-embracing, ever- evolving, ever-recreating, ever-loving order! Exceptions eternally? Absolute none!\n\n2nd, every body in God's tremendous Universe must eat or there is no body! To shine on, eat must even the sun, consuming every second 4 million metric ton! To shine on, eat must even the sun! Exceptions eternally? Absolute none!\n\n3rd, every ton of good food requires teamwork in harmony with God's law, timing-team-work- wisdom-power-mercy-love can reap 6 million more fruit above, above! Exceptions eternally? None!\n\n4th, any man raising 600 fruit trees in harmony with God's law, timing-teamwork-wisdom-power- mercy-love can reap 6 million more fruit above, above! Exceptions? Eternal? Absolute none!\n\n5th, only constructive working men have built all civilization &amp; everything good that's in it! Intolerant parasites, in order to eat, must dominate-dic1ate-distort-dilute-destroy- smear-slay-slander-cheat or they won't eat! Exceptions eternally? Absolute none!\n\n8th: The mark of the mature man is his ability to work brave, teaching all, every slave, how to replace coal-oil-gas-mineral-nuclear, unemployed-inflation, welfare-waste-war with Essene Birth-Control for very girl, Swiss 6000 year Universal Military Training UMT for full- employment, raising 1 trillion Israel-system trees, 2 million Dutch dikes, 3 Greek mirror- solars, 4 Hannibal windpower plants, 5 billion Amish-Amway-AT&amp;T profitsharing jobs, 6 Milorganite plants, 76 million Planetemples teaching All-One-God-Faith, Austrian music, Babylon roof-gardens, California rain forests, China-bikes, Cartha-UMT, Catspaw sandals, compost tree, C02 bomber, the Moral ABC, cattle-lemon-Esperanto. Finn-jails, gasohol, German solar-Zeppelins, Health-meat-salt-Zippy Water-tape, jojoba-aloevera-chia-ginseng-garlic, Kibbutz, Nature Friends, patents, Swiss economy, Town-Without-Toothache, Patrick Henry teaches PHt's of USA-USSR H20 cwp, with 76 million battery-banks, powering every car-factory-farm-home-Milorganite-monorail! To teach healthy Hunza 150-year great life by God's Law, timing-teamwork-wisdom-power-mercy-love, uniting All-One above! Above! Know 41-4. Only hard work unites all! Scrolls: $10 for 10; $3 for 1, help unite all!\n\n12th: Over-population destroys God's spaceship Earth, unless Essene-Chinese controls limit all birth! Instead, absolute clean, apply vaseline-oil-butter or cream, insert teaspoon juicy lemon pulp, pH2, God's Law prevents conception 100% below pH3. Next day douche with qt. Zippy Watery water, pH8, restoring pH5 balance God-made! Who else but God gave man this sensuous passion. Love that can spark mere dust to life! Beauty in our Eternal Father's fashion! Poetry, uniting All-One, brave, all life! Who else but God can make Love last 1 trillion years of sweet eternities! For when conquered after years of toil- sweat-blood, Love can strike like greased lightning sent by God to spark mere dust to intense blazing fire &amp; create new Love-faith-hope-guts-strength, as only God inspire! Unite the Human race in All-One-God-Faith, as all mankind desire! Who else but God. \"An Army of Principles,\" wrote Thos. Paine in 1799 \"can penetrate when an army of soldiers\" can-not! It will succeed where diplomacy may fail? It will always construct &amp; help unite One-God-Faith, where every other weapon divides the Human race! The onslaught of such an Army of Principles cannot be stopped by the Rhine, the Channel or the ocean! It's progress will match on the horizon of the world &amp; it will conquer every tyranny, every Human heart by teaching every man the Moral ABC of the Free: Free to communicate-cooperate-construct! Free to build, protect &amp; share! Free to grow, develop &amp; expand! Free to unite in love, cherish &amp; enjoy the Kingdom, the dictatorship of God's law, uniting the whole Human race in our Eternal Father's great All-One-God-Faith! For we're All-One or none: Listen Children Eternal Father Eternally One!\"\n\nAmerican democratic President Wilson, 1917, replaced Marxism by Lenin. \"We are not a nation of classes, races, minority or pressure groups! Anybody trading on our race, color, nationality or religion is not yet American, does not yet deserve to enjoy the liberties of the Stars &amp; Stripes! He does not yet know, that the Army of Principles by America's Founding Father, the world's 1st steelbridqe-builder, Thos. Paine, since 1799, unites the whole Human race in our Eternal Father's great All-One-God-Faith! Once we teach it, 6 billion strong, we're All-One! \"As teach Abraham-Israel-Moses- Buddha-Jesus &amp; Mohammed, inspired every 76 yrs. by the messenger of God's law, the Messiah, Halley's Comet! 6000 yrs. since the year One! We're All-One! All-One!\n\nIn '68 American Mao professor Marcuse upset Moscow's Czech power till Moscow's Press had the courage to confess: \"Marx is god! Marcuse his prophet! Mao his sword! 50,000 American university professors, his disciples! Black Panthers his killers!\" What an apology we Rabbis owe Marx-Moscow, all Jews, all mankind, IRS slave, for our 2000 year failure to teach brave the constructive-selfish Moral ABC the real Rabbi Hillel taught Jesus to unite all mankind free! The exact opposite to absolute-unselfish Marxism, that enslaves the Free! Unless we teach the whole Human race the Moral ABC from uniting All-One-God-Faith, we're dead men on furlough from half-true hates!\n\nFrom '29 to '79 we wired our \"Public Servants\" over 13,000 times to help unite the whole Human race in our Eternal Fathers' great All-One-God-Faith! With the 8 great books by Thos. Paine, suppressed since 1799: The Realist Declaration, The Age of Reason &amp; The Army of Principles will instantly unite the whole Human race in our Eternal Father's great All-One- God-Faith: \"LISTEN CHILDREN ETERNAL FATHER ETERNALLY ONE!\" WE'RE ALL ONE!\n\nThe trouble is that the wrong people are always the most energetic, united &amp; intense, dividing the hardworker to die in self-defense! That fact alone brings Hitlers &amp; Stalins to power &amp; that fact will only change when we teach the whole Human race the Moral ABC of All-One-God-Faith, lightning-like, 6 billion strong &amp; we're All-One! All-One! All-One! As Israel teaches since the year One: \"Listen Children Eternal Father Eternally One!' Exceptions? None!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "6dw0ge", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "From '29 to '44, Zippy Watermaker-master-chemist Sam Hyde built 3 American Zippy Water plants, trained 9 chemists, licensed 6 of 53 patents for $60,000!", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 8, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 8, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": 1496004000.0, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_6dw0ge", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/6dw0ge/from_29_to_44_zippy_watermakermasterchemist_sam/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1496032594.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/6dw0ge/from_29_to_44_zippy_watermakermasterchemist_sam/", "author_flair_text": null, "quarantine": false, "author": "sundayspot", "created_utc": 1496003794.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.89, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6dw0ge", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6dw0ge", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "di5xa6n", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "sundayspot", "can_mod_post": false, "ups": 1, "parent_id": "t1_di5u8sn", "score": 1, "approved_by": null, "downs": 0, "body": "I luv u B.B.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I luv u B.B.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6dw0ge/from_29_to_44_zippy_watermakermasterchemist_sam/di5xa6n/", "subreddit_type": "public", "name": "t1_di5xa6n", "created": 1496039876.0, "author_flair_text": null, "created_utc": 1496011076.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "di5u8sn", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 3, "parent_id": "t3_6dw0ge", "score": 3, "approved_by": null, "downs": 0, "body": "get a life", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;get a life&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6dw0ge/from_29_to_44_zippy_watermakermasterchemist_sam/di5u8sn/", "subreddit_type": "public", "name": "t1_di5u8sn", "created": 1496035381.0, "author_flair_text": null, "created_utc": 1496006581.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6dw0ge", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6dw0ge", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6dw0ge", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6dw0ge", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6dw0ge", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "di60ahw", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "CompactnassTheorem", "can_mod_post": false, "ups": 2, "parent_id": "t1_di5zvh7", "score": 2, "approved_by": null, "downs": 0, "body": "Oh ok", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh ok&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6dw0ge/from_29_to_44_zippy_watermakermasterchemist_sam/di60ahw/", "subreddit_type": "public", "name": "t1_di60ahw", "created": 1496044584.0, "author_flair_text": "Boomstick", "created_utc": 1496015784.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 4, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "di5zvh7", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "sundayspot", "can_mod_post": false, "ups": 3, "parent_id": "t1_di5za99", "score": 3, "approved_by": null, "downs": 0, "body": "Don't bother.  I just copied and pasted a Dr. Bronner rant, using control F to replace Magic Soap with Zippy Water and Dr. Bronner with Sam Hyde.  I thought more people were aware of him.  He was a crazy guy who made organic soap that hippies love.  He was famous for printing a long, incoherent rant on the bottle.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t bother.  I just copied and pasted a Dr. Bronner rant, using control F to replace Magic Soap with Zippy Water and Dr. Bronner with Sam Hyde.  I thought more people were aware of him.  He was a crazy guy who made organic soap that hippies love.  He was famous for printing a long, incoherent rant on the bottle.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6dw0ge/from_29_to_44_zippy_watermakermasterchemist_sam/di5zvh7/", "subreddit_type": "public", "name": "t1_di5zvh7", "created": 1496043915.0, "author_flair_text": null, "created_utc": 1496015115.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "di5za99", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "CompactnassTheorem", "can_mod_post": false, "ups": 3, "parent_id": "t1_di5z99n", "score": 3, "approved_by": null, "downs": 0, "body": "Sorry I'm lazy, maybe I'll come back later and read it.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry I&amp;#39;m lazy, maybe I&amp;#39;ll come back later and read it.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6dw0ge/from_29_to_44_zippy_watermakermasterchemist_sam/di5za99/", "subreddit_type": "public", "name": "t1_di5za99", "created": 1496042981.0, "author_flair_text": "Boomstick", "created_utc": 1496014181.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "di5z99n", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "sundayspot", "can_mod_post": false, "ups": 2, "parent_id": "t1_di5ya3o", "score": 2, "approved_by": null, "downs": 0, "body": "It's a dr. Bronner reference ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a dr. Bronner reference &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6dw0ge/from_29_to_44_zippy_watermakermasterchemist_sam/di5z99n/", "subreddit_type": "public", "name": "t1_di5z99n", "created": 1496042938.0, "author_flair_text": null, "created_utc": 1496014138.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "di5ya3o", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "CompactnassTheorem", "can_mod_post": false, "ups": 3, "parent_id": "t3_6dw0ge", "score": 3, "approved_by": null, "downs": 0, "body": "too long for me ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;too long for me &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6dw0ge/from_29_to_44_zippy_watermakermasterchemist_sam/di5ya3o/", "subreddit_type": "public", "name": "t1_di5ya3o", "created": 1496041400.0, "author_flair_text": "Boomstick", "created_utc": 1496012600.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6dw0ge", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "di8fc6h", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "b3rn13mac", "can_mod_post": false, "ups": 1, "parent_id": "t3_6dw0ge", "score": 1, "approved_by": null, "downs": 0, "body": "real talk\n\nIs Dr. Bronner just a meme or actually good?", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;real talk&lt;/p&gt;\n\n&lt;p&gt;Is Dr. Bronner just a meme or actually good?&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6dw0ge/from_29_to_44_zippy_watermakermasterchemist_sam/di8fc6h/", "subreddit_type": "public", "name": "t1_di8fc6h", "created": 1496193454.0, "author_flair_text": "ACTIVATE NODE 1JZ-GTE", "created_utc": 1496164654.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]