[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;NOTE: STORY IS FICTIONAL, SIMPLY BORED ON BREAK &lt;/p&gt;\n\n&lt;p&gt;SATURDAY MAY 16th 1999&lt;/p&gt;\n\n&lt;p&gt;It wasn&amp;#39;t a big lawn, not one of those expensively seeded spreads, it garnered no envy, took no favors, and it certainly wasn&amp;#39;t big enough of an excuse for him to buy a sit down mower, why did he need such a thing? Steve enjoyed simply cutting the grass with a hand-held mower for a very simple reason--it took longer. &lt;/p&gt;\n\n&lt;p&gt;Why did Steve like it to take longer? So it provided a convienent excuse to focus on his own thoughts instead of listening to Anna telling him stories about people at the bank where she worked or explaning the rote weekend errands that involved him picking up her lingerie for her so called &amp;quot;girls night out&amp;quot;. Steve hated those &amp;quot;honey could you get this-&amp;quot; to-do lists. It always aggravated him when he was playing Call of Duty 4 with his roomates from college, gone were the days of no responsibilites and working around his parents to garner some sort of financially stable life because he was simply too busy spending it on pot brownies and other &amp;quot;work&amp;quot; related items that he deemed he oh-so needed. He then started thinking about his 15 year old son Peter. Where was he again? It flashed his memory that he was at soccer practice with the school, boy Peter sure took a cop-out of his chores, no longer was he the one that had to go get the milk or other related items, leave it to dear old dad to get the family by. &amp;quot;Fucking little twerp&amp;quot;, he quickly thought to himself. &lt;/p&gt;\n\n&lt;p&gt;Some people might think Steve&amp;#39;s job designing new devices for GeminiMed Medical Products was boring; Steve knew was saving lives, he didn&amp;#39;t care that he missed all the football on TV or forgot Poker Night for the boys, as long as he was getting an A-ok from the big cheese--well that was okay for him. Steve thought to himself as an artist, because he thought that like artists, composers, and musicians, they all created something that no-one has ever done before in the history of mankind, good for him he thought to himself, maybe his wife will stop nagging him so much after he achieves this job related goal of his and finally get that raise. &lt;/p&gt;\n\n&lt;p&gt;It was almost 11:30 AM on this particulary Saturday, and Steve was annoyed because he had almost finished cutting the grass and hadn&amp;#39;t made any real progress in figuring out how to reduce the power requirement on the heart stent, the last remaining hurdle. A perfect problem to mull over while mowing, but no solution had come. &lt;/p&gt;\n\n&lt;p&gt;His wife, appeared at the door, her hair covered in the red paisley cowboy scarf she always wore while dusting. &amp;quot;Phone call,&amp;quot; she shouted to him. &amp;quot;Somebody from work.&amp;quot;\n&amp;quot;Who?&amp;quot; Steve shoted back. \n&amp;quot;Ralph something, some foreigner.&amp;quot;\nRalph? Steve couldn&amp;#39;t remember anybody at GeminiMed named Ralph who might be calling on a weekend. But Anna probably had the name wrong. \n&amp;quot;Steve, this is Ramon Pinoz in Tech Support.&amp;quot; Ranon--how in the world did Anna get from a Hispanic name to Ralph, Steve was perplexed. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This is just a courtesy call,&amp;quot; Ramon was saying. &amp;quot;Three of the server are down, we think maybe one of those worms, and we have to wipe the drives and restore from the backup. We should be able to have your files up and running by Friday morning...that is if we&amp;#39;re lucky.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Absolutely not,&amp;quot; Steve said in a firm voice, trying not to let his infantile frustration take over the telephone. How could these people be so stupid? Did they really think he could manage without access to his files all weekend and most of next week? It&amp;#39;s like these people don&amp;#39;t have anything to do! &amp;quot;NO way, I&amp;#39;m going to sit down at my home terminal in just about two hours and I will need access to my files. Am I making myself clear?&amp;quot; Steve voices cracks under the aggression and frustration. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah, well, everybody I&amp;#39;ve called so far wants to be at the top of the list. I gave up my weekend to come in and work this shift and it&amp;#39;s no fun having everyone yap about their home directories and pictures of family members they forgot to backup.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;There is nothing juvenile about this Ramon, the company has blueprints assigned specifically to me so I can finish this. I&amp;#39;ve got to get work done this afternoon. What part of this do you not understand?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;ve still got a lot of people to call before I can even get this started,&amp;quot; Ramon said. &amp;quot;How about we say you&amp;#39;ll have your files by Tuesday instead of Frida-&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;NOT TUESDAY, NOT MONDAY, TODAY. NOW!!!&amp;quot; Steve said, wondering who he would call if Ramon didn&amp;#39;t budge to his forceful efforts. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Okay, okay&amp;quot; Ramon said, and Steve could hear a very large sigh of vexation. &amp;quot;Let me see what I can do to get you going. You use the RM65 server right?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;RM65 and GM16, Both.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Right, Okay, I can cut some corners and save some time.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Fine.&amp;quot; said Steve.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m going to need you to supply me with your username and password.&amp;quot; Said Ramon.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Huh?&amp;quot; Steve sat their in his 700 dollar pro office chair and wondered what in the world did this Tech dweebie mean? Isn&amp;#39;t it the golden rule that you&amp;#39;re NEVER supposed to give out your account information over the telephone? &lt;/p&gt;\n\n&lt;p&gt;Steve replied, &amp;quot;Yeah, um are you sure that&amp;#39;s alright? What did you say your last name was? Who is your supervisor? I want names.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ramon Piroz, Listen Steve when you signed onto the company there was a form for you to fill out for you to put down a username and password you would like to use for the network.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Steve thought about the statement and grew quite impatient, there was probably casserole waiting in the oven from him from some supermarket, his favorite, and he just wanted his documents.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ah here they are.&amp;quot; Ramon returned with the supplement documents, &amp;quot;Username: scramer, Password: Janice?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Steve thought, &amp;quot;Why yes...that&amp;#39;s correct.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Ramon replied, &amp;quot;Okay so you know I&amp;#39;m the real thing, let me just get this thing set up for you in a couple of hours, I&amp;#39;ll give you a page once it&amp;#39;s all done, can you supply me with your fax number?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Steve gave the corresponding digits and thanked Ramon.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It&amp;#39;s my pleasure sir, your files will be ready on time. Have a nice day.&amp;quot; Ramon hung up. &lt;/p&gt;\n\n&lt;p&gt;Steve finished the lawn. had lunch, and by the time he got to his computer he was delighted that his digital documents were as they were before the network brownout, all sorted on his little background with his wife, cat, and son. It was nice knowing that technology was working in his favor that day. He was pleased with knowing that he handled himself well with the cooperative IT guy, he never liked them anyway, after all that&amp;#39;s why he got a position as head engineer, so he can laud himself around the lower ranking people of the company as being smarter and more charismatic. He really hoped that his wife overheard the conversation, maybe he can finally score some bed loving that he has been oh so craving for 2 years now. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Back to work&amp;quot;, he said. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "NOTE: STORY IS FICTIONAL, SIMPLY BORED ON BREAK \n\nSATURDAY MAY 16th 1999\n\nIt wasn't a big lawn, not one of those expensively seeded spreads, it garnered no envy, took no favors, and it certainly wasn't big enough of an excuse for him to buy a sit down mower, why did he need such a thing? Steve enjoyed simply cutting the grass with a hand-held mower for a very simple reason--it took longer. \n\nWhy did Steve like it to take longer? So it provided a convienent excuse to focus on his own thoughts instead of listening to Anna telling him stories about people at the bank where she worked or explaning the rote weekend errands that involved him picking up her lingerie for her so called \"girls night out\". Steve hated those \"honey could you get this-\" to-do lists. It always aggravated him when he was playing Call of Duty 4 with his roomates from college, gone were the days of no responsibilites and working around his parents to garner some sort of financially stable life because he was simply too busy spending it on pot brownies and other \"work\" related items that he deemed he oh-so needed. He then started thinking about his 15 year old son Peter. Where was he again? It flashed his memory that he was at soccer practice with the school, boy Peter sure took a cop-out of his chores, no longer was he the one that had to go get the milk or other related items, leave it to dear old dad to get the family by. \"Fucking little twerp\", he quickly thought to himself. \n\nSome people might think Steve's job designing new devices for GeminiMed Medical Products was boring; Steve knew was saving lives, he didn't care that he missed all the football on TV or forgot Poker Night for the boys, as long as he was getting an A-ok from the big cheese--well that was okay for him. Steve thought to himself as an artist, because he thought that like artists, composers, and musicians, they all created something that no-one has ever done before in the history of mankind, good for him he thought to himself, maybe his wife will stop nagging him so much after he achieves this job related goal of his and finally get that raise. \n\nIt was almost 11:30 AM on this particulary Saturday, and Steve was annoyed because he had almost finished cutting the grass and hadn't made any real progress in figuring out how to reduce the power requirement on the heart stent, the last remaining hurdle. A perfect problem to mull over while mowing, but no solution had come. \n\nHis wife, appeared at the door, her hair covered in the red paisley cowboy scarf she always wore while dusting. \"Phone call,\" she shouted to him. \"Somebody from work.\"\n\"Who?\" Steve shoted back. \n\"Ralph something, some foreigner.\"\nRalph? Steve couldn't remember anybody at GeminiMed named Ralph who might be calling on a weekend. But Anna probably had the name wrong. \n\"Steve, this is Ramon Pinoz in Tech Support.\" Ranon--how in the world did Anna get from a Hispanic name to Ralph, Steve was perplexed. \n\n\"This is just a courtesy call,\" Ramon was saying. \"Three of the server are down, we think maybe one of those worms, and we have to wipe the drives and restore from the backup. We should be able to have your files up and running by Friday morning...that is if we're lucky.\" \n\n\"Absolutely not,\" Steve said in a firm voice, trying not to let his infantile frustration take over the telephone. How could these people be so stupid? Did they really think he could manage without access to his files all weekend and most of next week? It's like these people don't have anything to do! \"NO way, I'm going to sit down at my home terminal in just about two hours and I will need access to my files. Am I making myself clear?\" Steve voices cracks under the aggression and frustration. \n\n\"Yeah, well, everybody I've called so far wants to be at the top of the list. I gave up my weekend to come in and work this shift and it's no fun having everyone yap about their home directories and pictures of family members they forgot to backup.\"\n\n\"There is nothing juvenile about this Ramon, the company has blueprints assigned specifically to me so I can finish this. I've got to get work done this afternoon. What part of this do you not understand?\" \n\n\"I've still got a lot of people to call before I can even get this started,\" Ramon said. \"How about we say you'll have your files by Tuesday instead of Frida-\"\n\n\"NOT TUESDAY, NOT MONDAY, TODAY. NOW!!!\" Steve said, wondering who he would call if Ramon didn't budge to his forceful efforts. \n\n\"Okay, okay\" Ramon said, and Steve could hear a very large sigh of vexation. \"Let me see what I can do to get you going. You use the RM65 server right?\"\n\n\"RM65 and GM16, Both.\"\n\n\"Right, Okay, I can cut some corners and save some time.\" \n\n\"Fine.\" said Steve.\n\n\"I'm going to need you to supply me with your username and password.\" Said Ramon.\n\n\"Huh?\" Steve sat their in his 700 dollar pro office chair and wondered what in the world did this Tech dweebie mean? Isn't it the golden rule that you're NEVER supposed to give out your account information over the telephone? \n\nSteve replied, \"Yeah, um are you sure that's alright? What did you say your last name was? Who is your supervisor? I want names.\" \n\n\"Ramon Piroz, Listen Steve when you signed onto the company there was a form for you to fill out for you to put down a username and password you would like to use for the network.\"\n\nSteve thought about the statement and grew quite impatient, there was probably casserole waiting in the oven from him from some supermarket, his favorite, and he just wanted his documents.\n\n\"Ah here they are.\" Ramon returned with the supplement documents, \"Username: scramer, Password: Janice?\"\n\nSteve thought, \"Why yes...that's correct.\"\n\nRamon replied, \"Okay so you know I'm the real thing, let me just get this thing set up for you in a couple of hours, I'll give you a page once it's all done, can you supply me with your fax number?\" \n\nSteve gave the corresponding digits and thanked Ramon.\n\n\"It's my pleasure sir, your files will be ready on time. Have a nice day.\" Ramon hung up. \n\nSteve finished the lawn. had lunch, and by the time he got to his computer he was delighted that his digital documents were as they were before the network brownout, all sorted on his little background with his wife, cat, and son. It was nice knowing that technology was working in his favor that day. He was pleased with knowing that he handled himself well with the cooperative IT guy, he never liked them anyway, after all that's why he got a position as head engineer, so he can laud himself around the lower ranking people of the company as being smarter and more charismatic. He really hoped that his wife overheard the conversation, maybe he can finally score some bed loving that he has been oh so craving for 2 years now. \n\n\"Back to work\", he said. \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "6d6teo", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "My Crazy TECH story(Part 1), gotta share.", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 10, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_6d6teo", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1495707703.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/", "author_flair_text": "yes russian exercise guru", "quarantine": false, "author": "Kommander000", "created_utc": 1495678903.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.7, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6d6teo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6d6teo", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "di0secr", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Kommander000", "can_mod_post": false, "ups": 1, "parent_id": "t1_di0dtb5", "score": 1, "approved_by": null, "downs": 0, "body": "ok", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ok&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/di0secr/", "subreddit_type": "public", "name": "t1_di0secr", "created": 1495742252.0, "author_flair_text": "yes russian exercise guru", "created_utc": 1495713452.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "di0dtb5", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "BanSameRaceRelations", "can_mod_post": false, "ups": 1, "parent_id": "t3_6d6teo", "score": 1, "approved_by": null, "downs": 0, "body": "Fuck off, Sam", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck off, Sam&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/di0dtb5/", "subreddit_type": "public", "name": "t1_di0dtb5", "created": 1495710418.0, "author_flair_text": "Jewish Supremacist", "created_utc": 1495681618.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6d6teo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6d6teo", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "di0sepb", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Kommander000", "can_mod_post": false, "ups": 1, "parent_id": "t1_di0ete6", "score": 1, "approved_by": null, "downs": 0, "body": "42", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;42&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/di0sepb/", "subreddit_type": "public", "name": "t1_di0sepb", "created": 1495742269.0, "author_flair_text": "yes russian exercise guru", "created_utc": 1495713469.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "di0ete6", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "casualca", "can_mod_post": false, "ups": 1, "parent_id": "t3_6d6teo", "score": 1, "approved_by": null, "downs": 0, "body": "What we only fantasize - he does.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What we only fantasize - he does.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/di0ete6/", "subreddit_type": "public", "name": "t1_di0ete6", "created": 1495711873.0, "author_flair_text": null, "created_utc": 1495683073.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6d6teo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6d6teo", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "di1f9et", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Kommander000", "can_mod_post": false, "ups": 1, "parent_id": "t1_di1f28b", "score": 1, "approved_by": null, "downs": 0, "body": "https://pastebin.com/e6p2Qj9Q - just for you ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://pastebin.com/e6p2Qj9Q\"&gt;https://pastebin.com/e6p2Qj9Q&lt;/a&gt; - just for you &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/di1f9et/", "subreddit_type": "public", "name": "t1_di1f9et", "created": 1495769650.0, "author_flair_text": "yes russian exercise guru", "created_utc": 1495740850.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "di1f28b", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t3_6d6teo", "score": 1, "approved_by": null, "downs": 0, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "collapsed": true, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/di1f28b/", "subreddit_type": "public", "name": "t1_di1f28b", "created": 1495769430.0, "author_flair_text": null, "created_utc": 1495740630.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6d6teo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6d6teo", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "di1fvt6", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Kommander000", "can_mod_post": false, "ups": 1, "parent_id": "t1_di1fp7v", "score": 1, "approved_by": null, "downs": 0, "body": "It's only part 1. Part 2 is about a character named Craig Colbourne how outlines how managed to social engineer Steve Cramer into getting his username and password and stealing government documents. ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s only part 1. Part 2 is about a character named Craig Colbourne how outlines how managed to social engineer Steve Cramer into getting his username and password and stealing government documents. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/di1fvt6/", "subreddit_type": "public", "name": "t1_di1fvt6", "created": 1495770321.0, "author_flair_text": "yes russian exercise guru", "created_utc": 1495741521.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "di1fp7v", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "ernstrohm96", "can_mod_post": false, "ups": 1, "parent_id": "t3_6d6teo", "score": 1, "approved_by": null, "downs": 0, "body": "That was kind of boring tbh. i dont get the point", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was kind of boring tbh. i dont get the point&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/di1fp7v/", "subreddit_type": "public", "name": "t1_di1fp7v", "created": 1495770123.0, "author_flair_text": null, "created_utc": 1495741323.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6d6teo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6d6teo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6d6teo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6d6teo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6d6teo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6d6teo", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "di4dlck", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Kommander000", "can_mod_post": false, "ups": 1, "parent_id": "t1_di47ln2", "score": 1, "approved_by": null, "downs": 0, "body": "Will do", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Will do&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/di4dlck/", "subreddit_type": "public", "name": "t1_di4dlck", "created": 1495941573.0, "author_flair_text": "yes russian exercise guru", "created_utc": 1495912773.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 5, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "di47ln2", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t1_di3xwgd", "score": 1, "approved_by": null, "downs": 0, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "collapsed": true, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/di47ln2/", "subreddit_type": "public", "name": "t1_di47ln2", "created": 1495933370.0, "author_flair_text": null, "created_utc": 1495904570.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 4, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "di3xwgd", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Kommander000", "can_mod_post": false, "ups": 1, "parent_id": "t1_di3qdxu", "score": 1, "approved_by": null, "downs": 0, "body": "Thanks man", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks man&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/di3xwgd/", "subreddit_type": "public", "name": "t1_di3xwgd", "created": 1495917356.0, "author_flair_text": "yes russian exercise guru", "created_utc": 1495888556.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "di3qdxu", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t1_di3dcgk", "score": 1, "approved_by": null, "downs": 0, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "collapsed": true, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/di3qdxu/", "subreddit_type": "public", "name": "t1_di3qdxu", "created": 1495895013.0, "author_flair_text": null, "created_utc": 1495866213.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "di3dcgk", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Kommander000", "can_mod_post": false, "ups": 1, "parent_id": "t1_di370mi", "score": 1, "approved_by": null, "downs": 0, "body": "Very well made. I guess this is a spiritual successor to the story. More of Ralph's development as a major character. Saved.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very well made. I guess this is a spiritual successor to the story. More of Ralph&amp;#39;s development as a major character. Saved.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/di3dcgk/", "subreddit_type": "public", "name": "t1_di3dcgk", "created": 1495871838.0, "author_flair_text": "yes russian exercise guru", "created_utc": 1495843038.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "di370mi", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t3_6d6teo", "score": 1, "approved_by": null, "downs": 0, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "collapsed": true, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6d6teo/my_crazy_tech_storypart_1_gotta_share/di370mi/", "subreddit_type": "public", "name": "t1_di370mi", "created": 1495862879.0, "author_flair_text": null, "created_utc": 1495834079.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]