[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;so this guy, he identifies as a classical liberal, but he&amp;#39;s sort of somewhere inbetween a classical liberal and basically an ironpill.&lt;/p&gt;\n\n&lt;p&gt;he was talking to me about how, he, like me, basically likes to appraise people based on an individual and meritocratic level. that he doesn&amp;#39;t like to think of people interms of what ever group they belong to, but based off of ideas and their charector. &lt;/p&gt;\n\n&lt;p&gt;but he made a fucking really depressing but good point.&lt;/p&gt;\n\n&lt;p&gt;most of the people who think this way in the world, are incidentally white. and then second to those people, are asian, paticularily japanese.&lt;/p&gt;\n\n&lt;p&gt;as well, incidentally, who is the people who are reproducing the least in the world? white people and japanese people.&lt;/p&gt;\n\n&lt;p&gt;and who is letting in mass immigration of people who are breeding with them, reproducing like crazy, and are going to out number them soon? white people.&lt;/p&gt;\n\n&lt;p&gt;he said that, in like twenty years, japans population is going to reduce by thirty percent.&lt;/p&gt;\n\n&lt;p&gt;he said that in italy, where he comes from, the average amount of children that people has is 1.2. here in canada, its 1.5.&lt;/p&gt;\n\n&lt;p&gt;he said that, he hates to think about things in these ways, but there exists a nexus point where caring about ideas and carrying about your genes crosses over when you consider that people with the same genes tend to stay in groups and incubate and shelter their own ideas.&lt;/p&gt;\n\n&lt;p&gt;jews, black people, and muslims, are extremely tribally minded, and they are doing a great job in preserving their races and their ideas through k and r style preservation.&lt;/p&gt;\n\n&lt;p&gt;white people are calling their cats their kids.&lt;/p&gt;\n\n&lt;p&gt;he like, says that he won&amp;#39;t go as far as to try and make people do anything, but he thinks that people should be having kids if they are white, and like alot, atleast three. &lt;/p&gt;\n\n&lt;p&gt;he&amp;#39;s thirty two and he has three kids and he moved to alberta in morman country because there the reproduction rate is like 3.5.&lt;/p&gt;\n\n&lt;p&gt;but he feels kind of guilty, because he feels like he&amp;#39;s giving birth to kids who are going to have a future where their going to be a minority and they are going to be hated and no one is going want to reproduce with them even if they are a different race.&lt;/p&gt;\n\n&lt;p&gt;so yea, i know that on a macro level, when you can&amp;#39;t appraise people on an individual level, stats and trends are important, but i never thought of it that way, that fucking intensely and fucked up. and it is really fucked up. and we are basically headed for a hellscape future where at best white people can hope to retreat to the mountains some where in religious communes where we can try and fend off hoards of people with low IQ&amp;#39;s and militant hatred towards us.&lt;/p&gt;\n\n&lt;p&gt;like i think that ideas are way more important then race, but thats pretty fucking useless if no one is alive to agree with me, and its just a fact, there are definitely exceptions, but its ironically white people who think that race isn&amp;#39;t important, and we are fucking dieing.&lt;/p&gt;\n\n&lt;p&gt;he said that japanese people might be able to save them selves, because they are atleast not letting in hoards of people to over take them, even though they are radiating them.&lt;/p&gt;\n\n&lt;p&gt;i honestly don&amp;#39;t care if my great grand kids are brown. but fuck will it suck if they are total fucking retards. and there is a genetic component to ideas, because families and heritage and culture is sheltered by genes, which helps to cultivate ideas.&lt;/p&gt;\n\n&lt;p&gt;let me know what you guys think about this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "so this guy, he identifies as a classical liberal, but he's sort of somewhere inbetween a classical liberal and basically an ironpill.\n\nhe was talking to me about how, he, like me, basically likes to appraise people based on an individual and meritocratic level. that he doesn't like to think of people interms of what ever group they belong to, but based off of ideas and their charector. \n\nbut he made a fucking really depressing but good point.\n\nmost of the people who think this way in the world, are incidentally white. and then second to those people, are asian, paticularily japanese.\n\nas well, incidentally, who is the people who are reproducing the least in the world? white people and japanese people.\n\nand who is letting in mass immigration of people who are breeding with them, reproducing like crazy, and are going to out number them soon? white people.\n\nhe said that, in like twenty years, japans population is going to reduce by thirty percent.\n\nhe said that in italy, where he comes from, the average amount of children that people has is 1.2. here in canada, its 1.5.\n\nhe said that, he hates to think about things in these ways, but there exists a nexus point where caring about ideas and carrying about your genes crosses over when you consider that people with the same genes tend to stay in groups and incubate and shelter their own ideas.\n\njews, black people, and muslims, are extremely tribally minded, and they are doing a great job in preserving their races and their ideas through k and r style preservation.\n\nwhite people are calling their cats their kids.\n\nhe like, says that he won't go as far as to try and make people do anything, but he thinks that people should be having kids if they are white, and like alot, atleast three. \n\nhe's thirty two and he has three kids and he moved to alberta in morman country because there the reproduction rate is like 3.5.\n\nbut he feels kind of guilty, because he feels like he's giving birth to kids who are going to have a future where their going to be a minority and they are going to be hated and no one is going want to reproduce with them even if they are a different race.\n\nso yea, i know that on a macro level, when you can't appraise people on an individual level, stats and trends are important, but i never thought of it that way, that fucking intensely and fucked up. and it is really fucked up. and we are basically headed for a hellscape future where at best white people can hope to retreat to the mountains some where in religious communes where we can try and fend off hoards of people with low IQ's and militant hatred towards us.\n\nlike i think that ideas are way more important then race, but thats pretty fucking useless if no one is alive to agree with me, and its just a fact, there are definitely exceptions, but its ironically white people who think that race isn't important, and we are fucking dieing.\n\nhe said that japanese people might be able to save them selves, because they are atleast not letting in hoards of people to over take them, even though they are radiating them.\n\ni honestly don't care if my great grand kids are brown. but fuck will it suck if they are total fucking retards. and there is a genetic component to ideas, because families and heritage and culture is sheltered by genes, which helps to cultivate ideas.\n\nlet me know what you guys think about this.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "6tzzpq", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "yo so i had a really sobering conversation with someone about the future and the coming dystopia thats happening. some hyde wars level shit.", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 12, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 17, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_6tzzpq", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1502890211.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/", "author_flair_text": null, "quarantine": false, "author": "dogchrist", "created_utc": 1502861411.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.87, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlpjmly", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "hhhehhehe_", "can_mod_post": false, "ups": 4, "parent_id": "t1_dloxinq", "score": 4, "approved_by": null, "downs": 0, "body": "You're just using human decency as a simulacra for whiteness. Preference for those genetically similar to us is a fundamental quality of most organisms. You say you don't care about your children creating a new race but would you be fine being cucked and raising someone else's children if that guy were intelligent and had \"human decency\" or whatever? No, because you want your children to be fifty percent your genetic material because this is what it is to be human, to be alive.. This impulse is as primal and important as hunger or thirst , to deny it is to deny your humanity. Would you have kids with a retard or a sub Saharan woman? No, because  you want your children to act and think like you do and the path towards that is to mate with someone who is reasonably genetically similar to you. The reason you prefer the particular way of thinking and the particular sociological milieu you claim to prefer is as a consequence of your biological imperative to reproduce your own memetic material and similar genetic material for the ultimate end of ensuring the success of your direct progeny. This is evolution. With all due respect this reads to me like you have accepted certain truths which clearly contradict the White liberal values into which we have all been over socialized and you are trying to rationalize maintaining the sort of Protestant egalitarian ethic because you are understandably hesitant to admit to yourself that you are racial and so is everyone else, because you still want to cling to this emancipatory Christian ethic of sacrifice and transcendence of the flesh or whatever. This spirit which has been animating humanity since the enlightenment which tells us that the very impulses which make us human and have allowed us to exist are profane and need to be subverted as destroyed so that we can transcend and become a faceless mass of really nice beige AI hellbots with maximum \"human\" decency is what's driving us towards self anihilation. This trans humanist impulse is behind liberalism classical or otherwise and it's fundamental consequence is the creation of the nihilistic technological suicide cult that we all find ourselves in and which has very effectively taught us that the LITERAL PURPOSE OF LIFE AKA REPRODUCING OUR GENETIC MATERIAL AND ADVANCING A DIVINE ANCESTRAL TRADITION is evil and should be destroyed because life itself is evils and should be destroyed. If you believe that there is something good or true or whatever to humanity then it is your God given duty to reproduce humanity. All this quibbling about race is gay nonsense and you shouldn't have to rationalize away the preference for white peoples and white culture which you obviously have because some fucking Jewish professors and autistic techniologists have robbed us of our ancestral modes of being. \n\n\nIdk man, this probably all sounds ike nonsense, but you should think hard about this \"waxing poetic\" shit about the death of your people, treat it seriously, and choose the path that makes you feel ennobled because the fate of our species hangs in the balance UNIRONICALLY and we have been very ill equipped by modernity to treat ourselves with humanity and to identify what really matters. ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re just using human decency as a simulacra for whiteness. Preference for those genetically similar to us is a fundamental quality of most organisms. You say you don&amp;#39;t care about your children creating a new race but would you be fine being cucked and raising someone else&amp;#39;s children if that guy were intelligent and had &amp;quot;human decency&amp;quot; or whatever? No, because you want your children to be fifty percent your genetic material because this is what it is to be human, to be alive.. This impulse is as primal and important as hunger or thirst , to deny it is to deny your humanity. Would you have kids with a retard or a sub Saharan woman? No, because  you want your children to act and think like you do and the path towards that is to mate with someone who is reasonably genetically similar to you. The reason you prefer the particular way of thinking and the particular sociological milieu you claim to prefer is as a consequence of your biological imperative to reproduce your own memetic material and similar genetic material for the ultimate end of ensuring the success of your direct progeny. This is evolution. With all due respect this reads to me like you have accepted certain truths which clearly contradict the White liberal values into which we have all been over socialized and you are trying to rationalize maintaining the sort of Protestant egalitarian ethic because you are understandably hesitant to admit to yourself that you are racial and so is everyone else, because you still want to cling to this emancipatory Christian ethic of sacrifice and transcendence of the flesh or whatever. This spirit which has been animating humanity since the enlightenment which tells us that the very impulses which make us human and have allowed us to exist are profane and need to be subverted as destroyed so that we can transcend and become a faceless mass of really nice beige AI hellbots with maximum &amp;quot;human&amp;quot; decency is what&amp;#39;s driving us towards self anihilation. This trans humanist impulse is behind liberalism classical or otherwise and it&amp;#39;s fundamental consequence is the creation of the nihilistic technological suicide cult that we all find ourselves in and which has very effectively taught us that the LITERAL PURPOSE OF LIFE AKA REPRODUCING OUR GENETIC MATERIAL AND ADVANCING A DIVINE ANCESTRAL TRADITION is evil and should be destroyed because life itself is evils and should be destroyed. If you believe that there is something good or true or whatever to humanity then it is your God given duty to reproduce humanity. All this quibbling about race is gay nonsense and you shouldn&amp;#39;t have to rationalize away the preference for white peoples and white culture which you obviously have because some fucking Jewish professors and autistic techniologists have robbed us of our ancestral modes of being. &lt;/p&gt;\n\n&lt;p&gt;Idk man, this probably all sounds ike nonsense, but you should think hard about this &amp;quot;waxing poetic&amp;quot; shit about the death of your people, treat it seriously, and choose the path that makes you feel ennobled because the fate of our species hangs in the balance UNIRONICALLY and we have been very ill equipped by modernity to treat ourselves with humanity and to identify what really matters. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlpjmly/", "subreddit_type": "public", "name": "t1_dlpjmly", "created": 1502930376.0, "author_flair_text": "read the third policeman", "created_utc": 1502901576.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlpu4j2", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "fattypatty396", "can_mod_post": false, "ups": 3, "parent_id": "t1_dloxinq", "score": 3, "approved_by": null, "downs": 0, "body": "His post was good. You are repeating the bullshit propaganda that is being used to push multiculturalism. Birth rates are not the problem it's the immigration agenda.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;His post was good. You are repeating the bullshit propaganda that is being used to push multiculturalism. Birth rates are not the problem it&amp;#39;s the immigration agenda.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlpu4j2/", "subreddit_type": "public", "name": "t1_dlpu4j2", "created": 1502940905.0, "author_flair_text": null, "created_utc": 1502912105.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlp33e2", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "k0ka-k0la", "can_mod_post": false, "ups": 0, "parent_id": "t1_dloy13i", "score": 0, "approved_by": null, "downs": 0, "body": "cuck cuck kys cuck cuck", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;cuck cuck kys cuck cuck&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlp33e2/", "subreddit_type": "public", "name": "t1_dlp33e2", "created": 1502908668.0, "author_flair_text": "cool story babe", "created_utc": 1502879868.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dloy13i", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "sherdickofnuttingham", "can_mod_post": false, "ups": 3, "parent_id": "t1_dloxinq", "score": 3, "approved_by": null, "downs": 0, "body": "You're cucking yourself and all the people who contributed to your genetic make-up over millennia. Kys faggot. ", "edited": 1502867825.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re cucking yourself and all the people who contributed to your genetic make-up over millennia. Kys faggot. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dloy13i/", "subreddit_type": "public", "name": "t1_dloy13i", "created": 1502895640.0, "author_flair_text": null, "created_utc": 1502866840.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlpedr8", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "psyduck117", "can_mod_post": false, "ups": 1, "parent_id": "t1_dloxinq", "score": 1, "approved_by": null, "downs": 0, "body": "You dont get it.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You dont get it.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlpedr8/", "subreddit_type": "public", "name": "t1_dlpedr8", "created": 1502924986.0, "author_flair_text": "&lt;3 /u/GottenGot", "created_utc": 1502896186.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlq3g40", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Fuknmods", "can_mod_post": false, "ups": 1, "parent_id": "t1_dloxinq", "score": 1, "approved_by": null, "downs": 0, "body": "&gt;i don't mean to rule out entirely that what you're talking about will play a factor, i'm just saying that preserving the \"white race\" means fuck all if this human decency is not preserved in the process\n\nGreat idea fam. When are you gonna go live as a christian in muslim countries to experience their human decency? How about moving to south africa to experience the soon to come human decency of \"we will remove white farmers from their lands without pay and kill them if necessary\"? How about you move to a majority black neighborhood in the US? How about you move to mexico or el salvador or venezuela for some of their human decency and respect for human life? Almost seems like human decency is part of a more traditionalist white america and the near 100% homogenous japan. Nah, race isnt a component of this at all. \n\n&gt;and if this human decency is preserved, that matters whether or not the genos is preserved as well, the genos only matters in as far as it aids this human decency.\n\nIf genes dont matter then why even live? Just suckstart a shotgun until you get a nice lead surprise. Look around the world dipshit, outside of white countries and maybe japan/korea the human decency you give so much of a shit about DOES NOT EXIST. EVEN IN WHITE COUNTRIES MINORITY GROUPS AND BRAINWASHED WHITES LACK HUMAN DECENCY. WONDER WHY THE FUCK THAT IS.\n\n&gt;like i wouldn't mind if my daughter married and had kids with a guy like tj sotomayer because he may be black but he's actually not a fucking idiot. so who gives a shit if he's complexion is darker then mine. \n\nMuh based black guy! Go cuck out some more. If being able to use basic logic and reasoning is all it takes to not be an idiot then by an intelligent persons metric youre fucking retarded. By stats alone and his personal past (he came from a ghetto life) odds are he isnt in the high iq range, you legitimately do not care if your family goes through willing dysgenics? Go protest with antifags somewhere and dont forget to suck some nigger dick in public to showcase how fucking \"decent\" and tolerant you are.\n\n&gt;b-b-but bad times are coming and i dont like thinking non fun thoughts!\n\nHeres another one, human decency on the right is the only thing that prevented shit like Charlottesville from actually turning into a bloodbath. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;i don&amp;#39;t mean to rule out entirely that what you&amp;#39;re talking about will play a factor, i&amp;#39;m just saying that preserving the &amp;quot;white race&amp;quot; means fuck all if this human decency is not preserved in the process&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Great idea fam. When are you gonna go live as a christian in muslim countries to experience their human decency? How about moving to south africa to experience the soon to come human decency of &amp;quot;we will remove white farmers from their lands without pay and kill them if necessary&amp;quot;? How about you move to a majority black neighborhood in the US? How about you move to mexico or el salvador or venezuela for some of their human decency and respect for human life? Almost seems like human decency is part of a more traditionalist white america and the near 100% homogenous japan. Nah, race isnt a component of this at all. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;and if this human decency is preserved, that matters whether or not the genos is preserved as well, the genos only matters in as far as it aids this human decency.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If genes dont matter then why even live? Just suckstart a shotgun until you get a nice lead surprise. Look around the world dipshit, outside of white countries and maybe japan/korea the human decency you give so much of a shit about DOES NOT EXIST. EVEN IN WHITE COUNTRIES MINORITY GROUPS AND BRAINWASHED WHITES LACK HUMAN DECENCY. WONDER WHY THE FUCK THAT IS.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;like i wouldn&amp;#39;t mind if my daughter married and had kids with a guy like tj sotomayer because he may be black but he&amp;#39;s actually not a fucking idiot. so who gives a shit if he&amp;#39;s complexion is darker then mine. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Muh based black guy! Go cuck out some more. If being able to use basic logic and reasoning is all it takes to not be an idiot then by an intelligent persons metric youre fucking retarded. By stats alone and his personal past (he came from a ghetto life) odds are he isnt in the high iq range, you legitimately do not care if your family goes through willing dysgenics? Go protest with antifags somewhere and dont forget to suck some nigger dick in public to showcase how fucking &amp;quot;decent&amp;quot; and tolerant you are.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;b-b-but bad times are coming and i dont like thinking non fun thoughts!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Heres another one, human decency on the right is the only thing that prevented shit like Charlottesville from actually turning into a bloodbath. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlq3g40/", "subreddit_type": "public", "name": "t1_dlq3g40", "created": 1502950623.0, "author_flair_text": null, "created_utc": 1502921823.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dloxinq", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "dogchrist", "can_mod_post": false, "ups": 2, "parent_id": "t1_dlox94v", "score": 2, "approved_by": null, "downs": 0, "body": "dude, i don't really care about your waxing poetic about \"the death of one people, the birth of another, the relation between ancestor and progeny. \"\n\ni care more about memes then genes.\n\ni care more about extended phenotypes then phenotypes. \n\ni care more about maintaining knowledge of the spider web then preserving the specific form and genos of the spider.\n\ni don't give a fuck if my children create a new race, i care if they aren't fucking retarded and through their actions and beliefs can facilitate me being proud of them, and i care about whether or not they live in an environment that will allow them to thrive and to make me proud.\n\ni understand that there is a genetic component to that, and i'm still figuring that out, but i will be more happy if they are good people but brown then if they are shitty people but white.\n\nlook at antifa, look at all the degenerate whites who fucking put hair dye on their armpit hair and shit and tell me that preserving the white race is more important then preserving some sort of human decency.\n\ni understand that genetics have an impact on this decency, but i believe there are other factors, and i'm entirely indifferent to transformation of the races if the result is still a respectable human being.\n\ni don't mean to rule out entirely that what you're talking about will play a factor, i'm just saying that preserving the \"white race\" means fuck all if this human decency is not preserved in the process, and if this human decency is preserved, that matters whether or not the genos is preserved as well, the genos only matters in as far as it aids this human decency.\n\nlike i wouldn't mind if my daughter married and had kids with a guy like tj sotomayer because he may be black but he's actually not a fucking idiot. so who gives a shit if he's complexion is darker then mine.", "edited": 1502866010.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;dude, i don&amp;#39;t really care about your waxing poetic about &amp;quot;the death of one people, the birth of another, the relation between ancestor and progeny. &amp;quot;&lt;/p&gt;\n\n&lt;p&gt;i care more about memes then genes.&lt;/p&gt;\n\n&lt;p&gt;i care more about extended phenotypes then phenotypes. &lt;/p&gt;\n\n&lt;p&gt;i care more about maintaining knowledge of the spider web then preserving the specific form and genos of the spider.&lt;/p&gt;\n\n&lt;p&gt;i don&amp;#39;t give a fuck if my children create a new race, i care if they aren&amp;#39;t fucking retarded and through their actions and beliefs can facilitate me being proud of them, and i care about whether or not they live in an environment that will allow them to thrive and to make me proud.&lt;/p&gt;\n\n&lt;p&gt;i understand that there is a genetic component to that, and i&amp;#39;m still figuring that out, but i will be more happy if they are good people but brown then if they are shitty people but white.&lt;/p&gt;\n\n&lt;p&gt;look at antifa, look at all the degenerate whites who fucking put hair dye on their armpit hair and shit and tell me that preserving the white race is more important then preserving some sort of human decency.&lt;/p&gt;\n\n&lt;p&gt;i understand that genetics have an impact on this decency, but i believe there are other factors, and i&amp;#39;m entirely indifferent to transformation of the races if the result is still a respectable human being.&lt;/p&gt;\n\n&lt;p&gt;i don&amp;#39;t mean to rule out entirely that what you&amp;#39;re talking about will play a factor, i&amp;#39;m just saying that preserving the &amp;quot;white race&amp;quot; means fuck all if this human decency is not preserved in the process, and if this human decency is preserved, that matters whether or not the genos is preserved as well, the genos only matters in as far as it aids this human decency.&lt;/p&gt;\n\n&lt;p&gt;like i wouldn&amp;#39;t mind if my daughter married and had kids with a guy like tj sotomayer because he may be black but he&amp;#39;s actually not a fucking idiot. so who gives a shit if he&amp;#39;s complexion is darker then mine.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dloxinq/", "subreddit_type": "public", "name": "t1_dloxinq", "created": 1502894551.0, "author_flair_text": null, "created_utc": 1502865751.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 1, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlp3dkv", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "CrownedCaribou", "can_mod_post": false, "ups": 1, "parent_id": "t1_dlox94v", "score": 1, "approved_by": null, "downs": 0, "body": "What if you pick a good mate?  ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What if you pick a good mate?  &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlp3dkv/", "subreddit_type": "public", "name": "t1_dlp3dkv", "created": 1502909353.0, "author_flair_text": "Now where could my pipe be?", "created_utc": 1502880553.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dlox94v", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "sherdickofnuttingham", "can_mod_post": false, "ups": 14, "parent_id": "t3_6tzzpq", "score": 14, "approved_by": null, "downs": 0, "body": "You should care if your great grandkids are brown. Racemixing is a tragedy. It's a person who is of both and neither groups. They are conflicted in themselves, and almost every action they take in the interests of one group is a betrayal to the interests of other group they are of. There is an unalterable rift in the interests of the micro family unit and the macro tribe/collection of families/nation/race. It divorces them from their very spirituality, whose eternality is mirrored in the relation between ancestor and progeny. They are a death of people, and a birth of people, and are cut off from the infinite flow. Not only that, but they will not see themselves as white. Your line will end as a supplement to an alien group. And as they will not see themselves as white, but brown, they or their descendents will eventually reduce down to the mean of their new group (border-line retarded, muh nigguh)... Societal structures like welfare and tax breaks for poorer people also encourage non-whites to have more kids, as well as whites generally being more invested in their children's welfare, and time preference and the ability to plan better and not have as many \"accidents.\" Also religiosity should be taken into account, which superimposes the individual onto eternity, and encourages many children (like the Amish, the Orthodox Jews, other higher IQ communities which have higher birth-rates). Idk though, there's probably a range of contributing factors. Maybe there's something in the tap water.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should care if your great grandkids are brown. Racemixing is a tragedy. It&amp;#39;s a person who is of both and neither groups. They are conflicted in themselves, and almost every action they take in the interests of one group is a betrayal to the interests of other group they are of. There is an unalterable rift in the interests of the micro family unit and the macro tribe/collection of families/nation/race. It divorces them from their very spirituality, whose eternality is mirrored in the relation between ancestor and progeny. They are a death of people, and a birth of people, and are cut off from the infinite flow. Not only that, but they will not see themselves as white. Your line will end as a supplement to an alien group. And as they will not see themselves as white, but brown, they or their descendents will eventually reduce down to the mean of their new group (border-line retarded, muh nigguh)... Societal structures like welfare and tax breaks for poorer people also encourage non-whites to have more kids, as well as whites generally being more invested in their children&amp;#39;s welfare, and time preference and the ability to plan better and not have as many &amp;quot;accidents.&amp;quot; Also religiosity should be taken into account, which superimposes the individual onto eternity, and encourages many children (like the Amish, the Orthodox Jews, other higher IQ communities which have higher birth-rates). Idk though, there&amp;#39;s probably a range of contributing factors. Maybe there&amp;#39;s something in the tap water.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlox94v/", "subreddit_type": "public", "name": "t1_dlox94v", "created": 1502893993.0, "author_flair_text": null, "created_utc": 1502865193.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlp57g2", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "reversetranscriptACE", "can_mod_post": false, "ups": 2, "parent_id": "t3_6tzzpq", "score": 2, "approved_by": null, "downs": 0, "body": "The future is now, 🅱oi!", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The future is now, 🅱oi!&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlp57g2/", "subreddit_type": "public", "name": "t1_dlp57g2", "created": 1502913155.0, "author_flair_text": null, "created_utc": 1502884355.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlphxt5", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "hhhehhehe_", "can_mod_post": false, "ups": 2, "parent_id": "t3_6tzzpq", "score": 2, "approved_by": null, "downs": 0, "body": "Charls' point about keeping everyone stupid and living in a flying castle is I think prescient but it won't be technocratic overlords tentacle raping everyone's minds, it'll be white flight but into space. ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Charls&amp;#39; point about keeping everyone stupid and living in a flying castle is I think prescient but it won&amp;#39;t be technocratic overlords tentacle raping everyone&amp;#39;s minds, it&amp;#39;ll be white flight but into space. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlphxt5/", "subreddit_type": "public", "name": "t1_dlphxt5", "created": 1502928675.0, "author_flair_text": "read the third policeman", "created_utc": 1502899875.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlpref4", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "pabbus", "can_mod_post": false, "ups": 2, "parent_id": "t3_6tzzpq", "score": 2, "approved_by": null, "downs": 0, "body": "if african tribes of 50 people are still up and running I don't think \"\"white people\"\" will be running into caves in the mountains for their very survival in the near future. the  frozen shithole known as canada is a depressing place for sure, but it can't screw your brain up that bad.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;if african tribes of 50 people are still up and running I don&amp;#39;t think &amp;quot;&amp;quot;white people&amp;quot;&amp;quot; will be running into caves in the mountains for their very survival in the near future. the  frozen shithole known as canada is a depressing place for sure, but it can&amp;#39;t screw your brain up that bad.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlpref4/", "subreddit_type": "public", "name": "t1_dlpref4", "created": 1502938118.0, "author_flair_text": "what is the cure for such disorders? beatings.", "created_utc": 1502909318.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlqoag9", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "dogchrist", "can_mod_post": false, "ups": 2, "parent_id": "t1_dlqo1jh", "score": 2, "approved_by": null, "downs": 0, "body": "FAWK YA!", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;FAWK YA!&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlqoag9/", "subreddit_type": "public", "name": "t1_dlqoag9", "created": 1502979531.0, "author_flair_text": null, "created_utc": 1502950731.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dlqo1jh", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "ThaChippa", "can_mod_post": false, "ups": 2, "parent_id": "t1_dlqo0jy", "score": 2, "approved_by": null, "downs": 0, "body": "My mudder always said \"Chipper, old people shouldn't be allowed make love. Whenever they fawk they look like two Halloween decorations bumpin' around in the dryer.\" I'm like, \"HIGH FIVE, MA!\"", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My mudder always said &amp;quot;Chipper, old people shouldn&amp;#39;t be allowed make love. Whenever they fawk they look like two Halloween decorations bumpin&amp;#39; around in the dryer.&amp;quot; I&amp;#39;m like, &amp;quot;HIGH FIVE, MA!&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlqo1jh/", "subreddit_type": "public", "name": "t1_dlqo1jh", "created": 1502979023.0, "author_flair_text": null, "created_utc": 1502950223.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dlqo0jy", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "dogchrist", "can_mod_post": false, "ups": 1, "parent_id": "t3_6tzzpq", "score": 1, "approved_by": null, "downs": 0, "body": "@Fuknmods and @hhhehhehe_\n\ni acknowledged that genos currently does play a part in the preservation of worthwhile ideas. but like i said, you can talk about \"the purpose of life\" all you fucking want, but thats just your interpretation bros.\n\ni want to reproduce but i, in addition to that, actually wouldn't mind adopting a kid that is a different race if i can raise them to be a good person, so in other words, i wouldn't mind raising another dudes kid. you can call that cucked all you want, but thats you attaching some dumb ass cave man attachment to genes thats so fucking important that you are totally ignorant of all the dumb ass white people that have existed through out history. in my experience, anyone who is super attached to this idea of a \"racial family\" is just incredibly socially retarded and uses the idea of a racial family to try and feel some sort of connection to other human beings without actually working on all their glaring inadequacies.\n\nyou ever read the gulag archipelago? thats a fucking white country that created the worlds worst lefty hellscape every known to mankind, that is the worst thing that humans have ever done to them selves, all created by white men, does that mean that white guilt is legitimate? no, thats fucking retarded. but is \"white pride\" intelligent in the face of that? no, thats fucking retarded.  \n\ngeno's are a macro look at a large amount of families, and they have trends, but in any situation where you can appraise someone on an individual level, it is intellectually lazy to appraise someone for any other reason.\n\nyou literally described koreans and japanese who arguably also have what i refer to as \"human decency\", that proves that human decency isn't exclusive to white people. and you can refer to the reason why that is as racial homogeniety, but i think its more that they don't let swathes of people come in who have incompatible values, so that the ones that do come in can have a mutually beneficial exchange of culture.\n\ndude i'm not threatened by racial purity on a moral level, i just think its fucking dumb and inadequete. look at a fucking antifa with armpit hair with hair dye on it and tell me that white people need to be preserved and \"human decency\" is just a simulacra for whiteness.\n\ni straight up do not have a preference for white culture, i care about the amalgam of things that i value, alot of which white people contributed to, but also alot of which alot of other cultures contributed to too.\n\nwhat your saying isn't wholly nonsense, i think that genos has an impact on preserving worthwile memes. i just think that genetic purity is inferior to preserving worthwile memes, and that preserving some kind of genetic liniage is nice and all, but purity is insignificant, and easily becomes inbreeding and incest and a bunch of problems that muslims fucking have who have the same dumb ass idea you do. and even carrying on your genetic line isn't all that great if your offspring are fuckign dumb asses that say shit like \"stalin wasn't that bad\" or \"i prefer stalin to hitler\" or \"cuba erased illiteracy\" or \"north korea has alot of positives\" or what ever fucking dumb shit.\n\ntelling me to go live in south africa or egypt or venesuela or elsvador doesn't prove your points you dumb cunts. go live in Stalinist russia.\n\ni literally did say race is a component, but it is just a component, it is not everything you fags, you are just gay for whiteness you fucking homo's. go suck your dads white dick.  ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;@Fuknmods and @hhhehhehe_&lt;/p&gt;\n\n&lt;p&gt;i acknowledged that genos currently does play a part in the preservation of worthwhile ideas. but like i said, you can talk about &amp;quot;the purpose of life&amp;quot; all you fucking want, but thats just your interpretation bros.&lt;/p&gt;\n\n&lt;p&gt;i want to reproduce but i, in addition to that, actually wouldn&amp;#39;t mind adopting a kid that is a different race if i can raise them to be a good person, so in other words, i wouldn&amp;#39;t mind raising another dudes kid. you can call that cucked all you want, but thats you attaching some dumb ass cave man attachment to genes thats so fucking important that you are totally ignorant of all the dumb ass white people that have existed through out history. in my experience, anyone who is super attached to this idea of a &amp;quot;racial family&amp;quot; is just incredibly socially retarded and uses the idea of a racial family to try and feel some sort of connection to other human beings without actually working on all their glaring inadequacies.&lt;/p&gt;\n\n&lt;p&gt;you ever read the gulag archipelago? thats a fucking white country that created the worlds worst lefty hellscape every known to mankind, that is the worst thing that humans have ever done to them selves, all created by white men, does that mean that white guilt is legitimate? no, thats fucking retarded. but is &amp;quot;white pride&amp;quot; intelligent in the face of that? no, thats fucking retarded.  &lt;/p&gt;\n\n&lt;p&gt;geno&amp;#39;s are a macro look at a large amount of families, and they have trends, but in any situation where you can appraise someone on an individual level, it is intellectually lazy to appraise someone for any other reason.&lt;/p&gt;\n\n&lt;p&gt;you literally described koreans and japanese who arguably also have what i refer to as &amp;quot;human decency&amp;quot;, that proves that human decency isn&amp;#39;t exclusive to white people. and you can refer to the reason why that is as racial homogeniety, but i think its more that they don&amp;#39;t let swathes of people come in who have incompatible values, so that the ones that do come in can have a mutually beneficial exchange of culture.&lt;/p&gt;\n\n&lt;p&gt;dude i&amp;#39;m not threatened by racial purity on a moral level, i just think its fucking dumb and inadequete. look at a fucking antifa with armpit hair with hair dye on it and tell me that white people need to be preserved and &amp;quot;human decency&amp;quot; is just a simulacra for whiteness.&lt;/p&gt;\n\n&lt;p&gt;i straight up do not have a preference for white culture, i care about the amalgam of things that i value, alot of which white people contributed to, but also alot of which alot of other cultures contributed to too.&lt;/p&gt;\n\n&lt;p&gt;what your saying isn&amp;#39;t wholly nonsense, i think that genos has an impact on preserving worthwile memes. i just think that genetic purity is inferior to preserving worthwile memes, and that preserving some kind of genetic liniage is nice and all, but purity is insignificant, and easily becomes inbreeding and incest and a bunch of problems that muslims fucking have who have the same dumb ass idea you do. and even carrying on your genetic line isn&amp;#39;t all that great if your offspring are fuckign dumb asses that say shit like &amp;quot;stalin wasn&amp;#39;t that bad&amp;quot; or &amp;quot;i prefer stalin to hitler&amp;quot; or &amp;quot;cuba erased illiteracy&amp;quot; or &amp;quot;north korea has alot of positives&amp;quot; or what ever fucking dumb shit.&lt;/p&gt;\n\n&lt;p&gt;telling me to go live in south africa or egypt or venesuela or elsvador doesn&amp;#39;t prove your points you dumb cunts. go live in Stalinist russia.&lt;/p&gt;\n\n&lt;p&gt;i literally did say race is a component, but it is just a component, it is not everything you fags, you are just gay for whiteness you fucking homo&amp;#39;s. go suck your dads white dick.  &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlqo0jy/", "subreddit_type": "public", "name": "t1_dlqo0jy", "created": 1502978966.0, "author_flair_text": null, "created_utc": 1502950166.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlp026c", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "emfyo", "can_mod_post": false, "ups": 1, "parent_id": "t3_6tzzpq", "score": 1, "approved_by": null, "downs": 0, "body": "haha cool meme bro", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;haha cool meme bro&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlp026c/", "subreddit_type": "public", "name": "t1_dlp026c", "created": 1502900567.0, "author_flair_text": null, "created_utc": 1502871767.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6tzzpq", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dlp3jjm", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t3_6tzzpq", "score": 1, "approved_by": null, "downs": 0, "body": "I think there's no way I'm going to read all that and my time isn't even that valuable to begin with.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think there&amp;#39;s no way I&amp;#39;m going to read all that and my time isn&amp;#39;t even that valuable to begin with.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6tzzpq/yo_so_i_had_a_really_sobering_conversation_with/dlp3jjm/", "subreddit_type": "public", "name": "t1_dlp3jjm", "created": 1502909733.0, "author_flair_text": null, "created_utc": 1502880933.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]