[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;An able man is a man who can do things, and his ability to do things is dependent on what he has in him. What he has in him depends on what he started with and what he has done to increase and discipline it.&lt;/p&gt;\n\n&lt;p&gt;An educated man is not one whose memory is trained to carry a few dates in history — he is one who can accomplish things. A man who cannot think is not an educated man however many college degrees he may have acquired. Thinking is the hardest work any one can do — which is probably the reason why we have so few thinkers. There are two extremes to be avoided: one is the attitude of contempt toward education, the other is the tragic snobbery of assuming that marching through an educational system is a sure cure for ignorance and mediocrity. You cannot learn in any school what the world is going to do next year, but you can learn some of the things which the world has tried to do in former years, and where it failed and where it succeeded. If education consisted in warning the young student away from some of the false theories on which men have tried to build, so that he may be saved the loss of the time in finding out by bitter experience, its good would be unquestioned. An education which consists of signposts indicating the failure and the fallacies of the past doubtless would be very useful. It is not education just to possess the theories of a lot of professors. Speculation is very interesting, and sometimes profitable, but it is not education. To be learned in science today is merely to be aware of a hundred theories that have not been proved. And not to know what those theories are is to be &amp;quot;uneducated,&amp;quot; &amp;quot;ignorant,&amp;quot; and so forth. If knowledge of guesses is learning, then one may become learned by the simple expedient of making his own guesses. And by the same token he can dub the rest of the world &amp;quot;ignorant&amp;quot; because it does not know what his guesses are. But the best that education can do for a man is to put him in possession of his powers, give him control of the tools with which destiny has endowed him, and teach him how to think. The college renders its best service as an intellectual gymnasium, in which mental muscle is developed and the student strengthened to do what he can. To say, however, that mental gymnastics can be had only in college is not true, as every educator knows. A man&amp;#39;s real education begins after he has left school. True education is gained through the discipline of life.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;There are many kinds of knowledge, and it depends on what crowd you happen to be in, or how the fashions of the day happen to run, which kind of knowledge, is most respected at the moment. There are fashions in knowledge, just as there are in everything else. When some of us were lads, knowledge used to be limited to the Bible. There were certain men in the neighbourhood who knew the Book thoroughly, and they were looked up to and respected. Biblical knowledge was highly valued then. But nowadays it is doubtful whether deep acquaintance with the Bible would be sufficient to win a man a name for learning.&lt;/p&gt;\n\n&lt;p&gt;Knowledge, to my mind, is something that in the past somebody knew and left in a form which enables all who will to obtain it. If a man is born with normal human faculties, if he is equipped with enough ability to use the tools which we call &amp;quot;letters&amp;quot; in reading or writing, there is no knowledge within the possession of the race that he cannot have — if he wants it! The only reason why every man does not know everything that the human mind has ever learned is that no one has ever yet found it worth while to know that much. Men satisfy their minds more by finding out things for themselves than by heaping together the things which somebody else has found out. You can go out and gather knowledge all your life, and with all your gathering you will not catch up even with your own times. You may fill your head with all the &amp;quot;facts&amp;quot; of all the ages, and your head may be just an overloaded fact-box when you get through. The point is this: Great piles of knowledge in the head are not the same as mental activity. A man may be very learned and very useless. And then again, a man may be unlearned and very useful.&lt;/p&gt;\n\n&lt;p&gt;The object of education is not to fill a man&amp;#39;s mind with facts; it is to teach him how to use his mind in thinking. And it often happens that a man can think better if he is not hampered by the knowledge of the past.&lt;/p&gt;\n\n&lt;p&gt;It is a very human tendency to think that what mankind does not yet know no one can learn. And yet it must be perfectly clear to everyone that the past learning of mankind cannot be allowed to hinder our future learning. Mankind has not gone so very far when you measure its progress against the knowledge that is yet to be gained — the secrets that are yet to be learned.&lt;/p&gt;\n\n&lt;p&gt;One good way to hinder progress is to fill a man&amp;#39;s head with all the learning of the past; it makes him feel that because his head is full, there is nothing more to learn. Merely gathering knowledge may become the most useless work a man can do. What can you do to help and heal the world? That is the educational test. If a man can hold up his own end, he counts for one. If he can help ten or a hundred or a thousand other men hold up their ends, he counts for more. He may be quite rusty on many things that inhabit the realm of print, but he is a learned man just the same. When a man is master of his own sphere, whatever it may be, he has won his degree--he has entered the realm of wisdom.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The work which we describe as Studies in the Jewish Question, and which is variously described by antagonists as &amp;quot;the Jewish campaign,&amp;quot; &amp;quot;the attack on the Jews,&amp;quot; &amp;quot;the anti-Semitic pogrom,&amp;quot; and so forth, needs no explanation to those who have followed it. Its motives and purposes must be judged by the work itself. It is offered as a contribution to a question which deeply affects the country, a question which is racial at its source, and which concerns influences and ideals rather than persons. Our statements must be judged by candid readers who are intelligent enough to lay our words alongside life as they are able to observe it. If our word and their observation agree, the case is made. It is perfectly silly to begin to damn us before it has been shown that our statements are baseless or reckless. The first item to be considered is the truth of what we have set forth. And that is precisely the item which our critics choose to evade.&lt;/p&gt;\n\n&lt;p&gt;Readers of our articles will see at once that we are not actuated by any kind of prejudice, except it may be a prejudice in favor of the principles which have made our civilization. There had been observed in this country certain streams of influence which were causing a marked deterioration in our literature, amusements, and social conduct; business was departing from its old-time substantial soundness; a general letting down of standards was felt everywhere. It was not the robust coarseness of the white man, the rude indelicacy, say, of Shakespeare&amp;#39;s characters, but a nasty Orientalism which has insidiously affected every channel of expression--and to such an extent that it was time to challenge it. The fact that these influences are all traceable to one racial source is a fact to be reckoned with, not by us only, but by the intelligent people of the race in question. It is entirely creditable to them that steps have been taken by them to remove their protection from the more flagrant violators of American hospitality, but there is still room to discard outworn ideas of racial superiority maintained by economic or intellectually subversive warfare upon Christian society.&lt;/p&gt;\n\n&lt;p&gt;Our work does not pretend to say the last word on the Jew in America. It says only the word which describes his obvious present impress on the country. When that impress is changed, the report of it can be changed. For the present, then, the question is wholly in the Jews&amp;#39; hands. If they are as wise as they claim to be, they will labour to make Jews American, instead of labouring to make America Jewish. The genius of the United States of America is Christian in the broadest sense, and its destiny is to remain Christian. This carries no sectarian meaning with it, but relates to a basic principle which differs from other principles in that it provides for liberty with morality, and pledges society to a code of relations based on fundamental Christian conceptions of human rights and duties.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;As for prejudice or hatred against persons, that is neither American nor Christian. Our opposition is only to ideas, false ideas, which are sapping the moral stamina of the people. These ideas proceed from easily identified sources, they are promulgated by easily discoverable methods; and they are controlled by mere exposure. We have simply used the method of exposure. When people learn to identify the source and nature of the influence swirling around them, it is sufficient. Let the American people once understand that it is not natural degeneracy, but calculated subversion that afflicts us, and they are safe. The explanation is the cure.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This work was taken up without personal motives. When it reached a stage where we believed the American people could grasp the key, we let it rest for the time. Our enemies say that we began it for revenge and that we laid it down in fear. Time will show that our critics are merely dealing in evasion because they dare not tackle the main question. Time will also show that we are better friends to the Jews&amp;#39; best interests than are those who praise them to their faces and criticize them behind their backs.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "\"An able man is a man who can do things, and his ability to do things is dependent on what he has in him. What he has in him depends on what he started with and what he has done to increase and discipline it.\n\nAn educated man is not one whose memory is trained to carry a few dates in history — he is one who can accomplish things. A man who cannot think is not an educated man however many college degrees he may have acquired. Thinking is the hardest work any one can do — which is probably the reason why we have so few thinkers. There are two extremes to be avoided: one is the attitude of contempt toward education, the other is the tragic snobbery of assuming that marching through an educational system is a sure cure for ignorance and mediocrity. You cannot learn in any school what the world is going to do next year, but you can learn some of the things which the world has tried to do in former years, and where it failed and where it succeeded. If education consisted in warning the young student away from some of the false theories on which men have tried to build, so that he may be saved the loss of the time in finding out by bitter experience, its good would be unquestioned. An education which consists of signposts indicating the failure and the fallacies of the past doubtless would be very useful. It is not education just to possess the theories of a lot of professors. Speculation is very interesting, and sometimes profitable, but it is not education. To be learned in science today is merely to be aware of a hundred theories that have not been proved. And not to know what those theories are is to be \"uneducated,\" \"ignorant,\" and so forth. If knowledge of guesses is learning, then one may become learned by the simple expedient of making his own guesses. And by the same token he can dub the rest of the world \"ignorant\" because it does not know what his guesses are. But the best that education can do for a man is to put him in possession of his powers, give him control of the tools with which destiny has endowed him, and teach him how to think. The college renders its best service as an intellectual gymnasium, in which mental muscle is developed and the student strengthened to do what he can. To say, however, that mental gymnastics can be had only in college is not true, as every educator knows. A man's real education begins after he has left school. True education is gained through the discipline of life.\"\n\nThere are many kinds of knowledge, and it depends on what crowd you happen to be in, or how the fashions of the day happen to run, which kind of knowledge, is most respected at the moment. There are fashions in knowledge, just as there are in everything else. When some of us were lads, knowledge used to be limited to the Bible. There were certain men in the neighbourhood who knew the Book thoroughly, and they were looked up to and respected. Biblical knowledge was highly valued then. But nowadays it is doubtful whether deep acquaintance with the Bible would be sufficient to win a man a name for learning.\n\nKnowledge, to my mind, is something that in the past somebody knew and left in a form which enables all who will to obtain it. If a man is born with normal human faculties, if he is equipped with enough ability to use the tools which we call \"letters\" in reading or writing, there is no knowledge within the possession of the race that he cannot have — if he wants it! The only reason why every man does not know everything that the human mind has ever learned is that no one has ever yet found it worth while to know that much. Men satisfy their minds more by finding out things for themselves than by heaping together the things which somebody else has found out. You can go out and gather knowledge all your life, and with all your gathering you will not catch up even with your own times. You may fill your head with all the \"facts\" of all the ages, and your head may be just an overloaded fact-box when you get through. The point is this: Great piles of knowledge in the head are not the same as mental activity. A man may be very learned and very useless. And then again, a man may be unlearned and very useful.\n\nThe object of education is not to fill a man's mind with facts; it is to teach him how to use his mind in thinking. And it often happens that a man can think better if he is not hampered by the knowledge of the past.\n\nIt is a very human tendency to think that what mankind does not yet know no one can learn. And yet it must be perfectly clear to everyone that the past learning of mankind cannot be allowed to hinder our future learning. Mankind has not gone so very far when you measure its progress against the knowledge that is yet to be gained — the secrets that are yet to be learned.\n\nOne good way to hinder progress is to fill a man's head with all the learning of the past; it makes him feel that because his head is full, there is nothing more to learn. Merely gathering knowledge may become the most useless work a man can do. What can you do to help and heal the world? That is the educational test. If a man can hold up his own end, he counts for one. If he can help ten or a hundred or a thousand other men hold up their ends, he counts for more. He may be quite rusty on many things that inhabit the realm of print, but he is a learned man just the same. When a man is master of his own sphere, whatever it may be, he has won his degree--he has entered the realm of wisdom.\n\n*     *     * \n\nThe work which we describe as Studies in the Jewish Question, and which is variously described by antagonists as \"the Jewish campaign,\" \"the attack on the Jews,\" \"the anti-Semitic pogrom,\" and so forth, needs no explanation to those who have followed it. Its motives and purposes must be judged by the work itself. It is offered as a contribution to a question which deeply affects the country, a question which is racial at its source, and which concerns influences and ideals rather than persons. Our statements must be judged by candid readers who are intelligent enough to lay our words alongside life as they are able to observe it. If our word and their observation agree, the case is made. It is perfectly silly to begin to damn us before it has been shown that our statements are baseless or reckless. The first item to be considered is the truth of what we have set forth. And that is precisely the item which our critics choose to evade.\n\nReaders of our articles will see at once that we are not actuated by any kind of prejudice, except it may be a prejudice in favor of the principles which have made our civilization. There had been observed in this country certain streams of influence which were causing a marked deterioration in our literature, amusements, and social conduct; business was departing from its old-time substantial soundness; a general letting down of standards was felt everywhere. It was not the robust coarseness of the white man, the rude indelicacy, say, of Shakespeare's characters, but a nasty Orientalism which has insidiously affected every channel of expression--and to such an extent that it was time to challenge it. The fact that these influences are all traceable to one racial source is a fact to be reckoned with, not by us only, but by the intelligent people of the race in question. It is entirely creditable to them that steps have been taken by them to remove their protection from the more flagrant violators of American hospitality, but there is still room to discard outworn ideas of racial superiority maintained by economic or intellectually subversive warfare upon Christian society.\n\nOur work does not pretend to say the last word on the Jew in America. It says only the word which describes his obvious present impress on the country. When that impress is changed, the report of it can be changed. For the present, then, the question is wholly in the Jews' hands. If they are as wise as they claim to be, they will labour to make Jews American, instead of labouring to make America Jewish. The genius of the United States of America is Christian in the broadest sense, and its destiny is to remain Christian. This carries no sectarian meaning with it, but relates to a basic principle which differs from other principles in that it provides for liberty with morality, and pledges society to a code of relations based on fundamental Christian conceptions of human rights and duties.\n\n**As for prejudice or hatred against persons, that is neither American nor Christian. Our opposition is only to ideas, false ideas, which are sapping the moral stamina of the people. These ideas proceed from easily identified sources, they are promulgated by easily discoverable methods; and they are controlled by mere exposure. We have simply used the method of exposure. When people learn to identify the source and nature of the influence swirling around them, it is sufficient. Let the American people once understand that it is not natural degeneracy, but calculated subversion that afflicts us, and they are safe. The explanation is the cure.**\n\nThis work was taken up without personal motives. When it reached a stage where we believed the American people could grasp the key, we let it rest for the time. Our enemies say that we began it for revenge and that we laid it down in fear. Time will show that our critics are merely dealing in evasion because they dare not tackle the main question. Time will also show that we are better friends to the Jews' best interests than are those who praise them to their faces and criticize them behind their backs.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "6m1p3y", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "Brief excerpt from 'My Life and Work' by Henry Ford (a short book MDE fans would probably like)", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 12, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 3, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_6m1p3y", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/6m1p3y/brief_excerpt_from_my_life_and_work_by_henry_ford/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1499558057.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/6m1p3y/brief_excerpt_from_my_life_and_work_by_henry_ford/", "author_flair_text": "try to drift your car", "quarantine": false, "author": "HaHawk", "created_utc": 1499529257.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.99, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6m1p3y", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "djyse80", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Saad-Ali", "can_mod_post": false, "ups": 2, "parent_id": "t3_6m1p3y", "score": 2, "approved_by": null, "downs": 0, "body": "I am lost at words, This is absolutely new awakening. Thank You very much for posting excerpt. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am lost at words, This is absolutely new awakening. Thank You very much for posting excerpt. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6m1p3y/brief_excerpt_from_my_life_and_work_by_henry_ford/djyse80/", "subreddit_type": "public", "name": "t1_djyse80", "created": 1499587332.0, "author_flair_text": null, "created_utc": 1499558532.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6m1p3y", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6m1p3y", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "djzxjw2", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "HaHawk", "can_mod_post": false, "ups": 1, "parent_id": "t1_djzux8j", "score": 1, "approved_by": null, "downs": 0, "body": "Yeah, obviously the book is rather dated in many ways, but the core principles he talks about are inspiring and many of his ideas remain insightful and relevant to our circumstances today. He's also clearly not a \"normal\" person with regard to his worth ethic and sense of community. I don't think words like \"tired\" or \"bored\" existed in his mind lol", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, obviously the book is rather dated in many ways, but the core principles he talks about are inspiring and many of his ideas remain insightful and relevant to our circumstances today. He&amp;#39;s also clearly not a &amp;quot;normal&amp;quot; person with regard to his worth ethic and sense of community. I don&amp;#39;t think words like &amp;quot;tired&amp;quot; or &amp;quot;bored&amp;quot; existed in his mind lol&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6m1p3y/brief_excerpt_from_my_life_and_work_by_henry_ford/djzxjw2/", "subreddit_type": "public", "name": "t1_djzxjw2", "created": 1499660603.0, "author_flair_text": "try to drift your car", "created_utc": 1499631803.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "djzux8j", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "punxsatawneyphuck", "can_mod_post": false, "ups": 2, "parent_id": "t3_6m1p3y", "score": 2, "approved_by": null, "downs": 0, "body": "Henry ford was a great man.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Henry ford was a great man.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/6m1p3y/brief_excerpt_from_my_life_and_work_by_henry_ford/djzux8j/", "subreddit_type": "public", "name": "t1_djzux8j", "created": 1499657170.0, "author_flair_text": "marmaduke", "created_utc": 1499628370.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]