[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Saw it today, and villeneuve did a good job keeping it true to a sequel to Blade Runner, I was concerned it would just be an action packed shitshow like any other nostalgia cash-in these days (Mad Max is the only one I&amp;#39;ve seen that does this but actually works it extremely well).  But no, it&amp;#39;s very true to the pacing, methodical investigation, unfolding plot but I think takes it to the next level in some ways, and while it retreads a lot of the themes from the first one, it does advance them in some ways and introduce new elements and complications that I&amp;#39;ll get into, some deeper than others.  Visually it&amp;#39;s stunning and surprisingly diverse, going a lot of different directions aside from just neon slums to clean pure wealth we saw in the first one.  Definitely something fresh, considering today&amp;#39;s film landscape.  Worth a look see if you are at all interested in it.&lt;/p&gt;\n\n&lt;p&gt;(SPOILERS TIME)&lt;/p&gt;\n\n&lt;p&gt;Yeah it retreads a lot of the same territory as the predecessor of replicants being human or even more than human (a direct quote, lol), and only tenuously shallowly advances it by saying that the ability to give birth is another checkbox for replicants being humans, which yeah, sure, at this level of sophistication they are certainly a life form of some sort, though the implanted memories and no childhood make them somewhat different.  Any sort of emotional &amp;quot;processes&amp;quot; they go through aren&amp;#39;t too functionally different from any behavior manipulations most animals have, usually through hormones.&lt;/p&gt;\n\n&lt;p&gt;However I think one of the more interesting advancements it makes is with the AI girlfriend K has.  The movie doesn&amp;#39;t throw this one in your face and I imagine most people don&amp;#39;t really think much about it, and shallow analysis might just have you thinking it&amp;#39;s a device to getting K&amp;#39;s inner monologues without having to do a voice over, but I think it&amp;#39;s pretty clearly an advancement on the theme that the movie leaves somewhat to your own interpretation.  In my takeaway, while it seems like the behavior there was very humanlike, his interactions with her, which I&amp;#39;m sure are similar to the behavior programs replicants use, she seems real enough, and K for the most part does genuinely feel for this AI girl (I haven&amp;#39;t seen Her, btw), him talking to the Joi ad at the end and her calling him &amp;quot;Joe&amp;quot; I think drives home, at least to the character the shallowness of that relationship, or at least the programatic nature of it.  But like I said, our own behavior is regulated by mechanisms that many wouldn&amp;#39;t necessarily consider &amp;quot;you&amp;quot; so if we are to deny or grant replicants humanity status, who are we to deny AI as well?  &lt;/p&gt;\n\n&lt;p&gt;The sex scene with the AI/replicant prostitute overlay was actually interesting to me, since I&amp;#39;m not sure if they wanted it to be something endearing or absolutely horrifying.  To me, it was more the latter.  The idea of anyone&amp;#39;s body standing in to be used as a proxy is actual objectification (and I recognize everyone is objectified sometime or another, this isn&amp;#39;t an automatic evil, we are objectified as employees everyday).  I think it was a pretty good juxtaposition, in one way advancing the AI&amp;#39;s humanity and desire to be human, like a Pinocchio that tries to prove himself to her father by fucking him, but also just a totally fucked up premise&lt;/p&gt;\n\n&lt;p&gt;Also props to them STILL not outright saying if Deckard is a replicant or not, keeping it ambiguous, as far as I could tell.&lt;/p&gt;\n\n&lt;p&gt;Not sure I really understand the motivations by the end of the movie.  It seemed a bit weird for &amp;quot;seeing your daughter&amp;quot; as a final goal for the flick, but I guess it&amp;#39;s almost like a Children of Men style ending, where the replicant baby represents a turning point in history.  And outing her is a new chapter in the world.  I worry that the potential sequel they&amp;#39;re setting up would just be an all out war kind of against the nature of the general feel of the films.&lt;/p&gt;\n\n&lt;p&gt;Other notes:&lt;/p&gt;\n\n&lt;p&gt;All the settings were cool.  San Diego trash district, the irradiated city full of statues of pleasured women, the casino too (or whatever the story was for that being abandoned), the protein farms, the memory creation facility, LAPD station, lots of diversity that added a lot of depth.  I still think that K&amp;#39;s girlfriend is the standout since it obviously advances that question of humanity a step further, and is obviously something we&amp;#39;ll be facing sooner or later.&lt;/p&gt;\n\n&lt;p&gt;Not sure how they got Rachel&amp;#39;s eye color wrong.  Isn&amp;#39;t that in the DNA?  Could it have been corrupted?  That scene was a little dumb  and I dreaded every Jared Leto scene because of his over the top delivery.&lt;/p&gt;\n\n&lt;p&gt;I could go into other little plot holes or things that didn&amp;#39;t quite make sense&lt;/p&gt;\n\n&lt;p&gt;Lol at Deckard in the final fight scene just looking there like a sad sack&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Saw it today, and villeneuve did a good job keeping it true to a sequel to Blade Runner, I was concerned it would just be an action packed shitshow like any other nostalgia cash-in these days (Mad Max is the only one I've seen that does this but actually works it extremely well).  But no, it's very true to the pacing, methodical investigation, unfolding plot but I think takes it to the next level in some ways, and while it retreads a lot of the themes from the first one, it does advance them in some ways and introduce new elements and complications that I'll get into, some deeper than others.  Visually it's stunning and surprisingly diverse, going a lot of different directions aside from just neon slums to clean pure wealth we saw in the first one.  Definitely something fresh, considering today's film landscape.  Worth a look see if you are at all interested in it.\n\n\n(SPOILERS TIME)\n\nYeah it retreads a lot of the same territory as the predecessor of replicants being human or even more than human (a direct quote, lol), and only tenuously shallowly advances it by saying that the ability to give birth is another checkbox for replicants being humans, which yeah, sure, at this level of sophistication they are certainly a life form of some sort, though the implanted memories and no childhood make them somewhat different.  Any sort of emotional \"processes\" they go through aren't too functionally different from any behavior manipulations most animals have, usually through hormones.\n\nHowever I think one of the more interesting advancements it makes is with the AI girlfriend K has.  The movie doesn't throw this one in your face and I imagine most people don't really think much about it, and shallow analysis might just have you thinking it's a device to getting K's inner monologues without having to do a voice over, but I think it's pretty clearly an advancement on the theme that the movie leaves somewhat to your own interpretation.  In my takeaway, while it seems like the behavior there was very humanlike, his interactions with her, which I'm sure are similar to the behavior programs replicants use, she seems real enough, and K for the most part does genuinely feel for this AI girl (I haven't seen Her, btw), him talking to the Joi ad at the end and her calling him \"Joe\" I think drives home, at least to the character the shallowness of that relationship, or at least the programatic nature of it.  But like I said, our own behavior is regulated by mechanisms that many wouldn't necessarily consider \"you\" so if we are to deny or grant replicants humanity status, who are we to deny AI as well?  \n\nThe sex scene with the AI/replicant prostitute overlay was actually interesting to me, since I'm not sure if they wanted it to be something endearing or absolutely horrifying.  To me, it was more the latter.  The idea of anyone's body standing in to be used as a proxy is actual objectification (and I recognize everyone is objectified sometime or another, this isn't an automatic evil, we are objectified as employees everyday).  I think it was a pretty good juxtaposition, in one way advancing the AI's humanity and desire to be human, like a Pinocchio that tries to prove himself to her father by fucking him, but also just a totally fucked up premise\n\nAlso props to them STILL not outright saying if Deckard is a replicant or not, keeping it ambiguous, as far as I could tell.\n\nNot sure I really understand the motivations by the end of the movie.  It seemed a bit weird for \"seeing your daughter\" as a final goal for the flick, but I guess it's almost like a Children of Men style ending, where the replicant baby represents a turning point in history.  And outing her is a new chapter in the world.  I worry that the potential sequel they're setting up would just be an all out war kind of against the nature of the general feel of the films.\n\nOther notes:\n\nAll the settings were cool.  San Diego trash district, the irradiated city full of statues of pleasured women, the casino too (or whatever the story was for that being abandoned), the protein farms, the memory creation facility, LAPD station, lots of diversity that added a lot of depth.  I still think that K's girlfriend is the standout since it obviously advances that question of humanity a step further, and is obviously something we'll be facing sooner or later.\n\nNot sure how they got Rachel's eye color wrong.  Isn't that in the DNA?  Could it have been corrupted?  That scene was a little dumb  and I dreaded every Jared Leto scene because of his over the top delivery.\n\nI could go into other little plot holes or things that didn't quite make sense\n\nLol at Deckard in the final fight scene just looking there like a sad sack", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "74tl0j", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "Blade Runner 2049 was p good (no spoilers at the top part)", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 15, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 11, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": 1507362746.0, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_74tl0j", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/74tl0j/blade_runner_2049_was_p_good_no_spoilers_at_the/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1507390599.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/74tl0j/blade_runner_2049_was_p_good_no_spoilers_at_the/", "author_flair_text": "Now where could my pipe be?", "quarantine": false, "author": "CrownedCaribou", "created_utc": 1507361799.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.8, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_74tl0j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_74tl0j", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "do1591y", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Marbly", "can_mod_post": false, "ups": 3, "parent_id": "t1_do111uq", "score": 3, "approved_by": null, "downs": 0, "body": "I think it makes sense that K dies in the snow. The soundtrack at that point is identical to the one used during Roy Batty's death in the original. \n\nI might be reading into it a bit, but I think there's something symbolic about dying in the snow when you consider Batty's speech about memories being 'lost like tears in rain'. Batty died for selfish reasons and was forgotten, whereas K died for something meaningful and so his memories were frozen in time forever. \n\nThe film was essentially about K's search for meaning. He starts to question his job, he finds out his memories are not actually his, he discovers he is not actually the 'real boy' he suspected, and finally he loses his only real intimate relationship, which is itself  shallow and manufactured. Despite this, he ultimately chooses to sacrifice himself for a greater cause, since that is the 'human' thing to do'.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it makes sense that K dies in the snow. The soundtrack at that point is identical to the one used during Roy Batty&amp;#39;s death in the original. &lt;/p&gt;\n\n&lt;p&gt;I might be reading into it a bit, but I think there&amp;#39;s something symbolic about dying in the snow when you consider Batty&amp;#39;s speech about memories being &amp;#39;lost like tears in rain&amp;#39;. Batty died for selfish reasons and was forgotten, whereas K died for something meaningful and so his memories were frozen in time forever. &lt;/p&gt;\n\n&lt;p&gt;The film was essentially about K&amp;#39;s search for meaning. He starts to question his job, he finds out his memories are not actually his, he discovers he is not actually the &amp;#39;real boy&amp;#39; he suspected, and finally he loses his only real intimate relationship, which is itself  shallow and manufactured. Despite this, he ultimately chooses to sacrifice himself for a greater cause, since that is the &amp;#39;human&amp;#39; thing to do&amp;#39;.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/74tl0j/blade_runner_2049_was_p_good_no_spoilers_at_the/do1591y/", "subreddit_type": "public", "name": "t1_do1591y", "created": 1507404720.0, "author_flair_text": null, "created_utc": 1507375920.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_74tl0j", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "do2mnc2", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 2, "parent_id": "t1_do111uq", "score": 2, "approved_by": null, "downs": 0, "body": "man i’m really stoked there’s people who think K is actually the chosen one. the numales over in /r/movies are convinced he isn’t when the movie obviously made it ambiguous.\n\nit makes the ending with K much more poignant", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;man i’m really stoked there’s people who think K is actually the chosen one. the numales over in &lt;a href=\"/r/movies\"&gt;/r/movies&lt;/a&gt; are convinced he isn’t when the movie obviously made it ambiguous.&lt;/p&gt;\n\n&lt;p&gt;it makes the ending with K much more poignant&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/74tl0j/blade_runner_2049_was_p_good_no_spoilers_at_the/do2mnc2/", "subreddit_type": "public", "name": "t1_do2mnc2", "created": 1507491411.0, "author_flair_text": null, "created_utc": 1507462611.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "do111uq", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "milumact1", "can_mod_post": false, "ups": 3, "parent_id": "t3_74tl0j", "score": 3, "approved_by": null, "downs": 0, "body": "I'll leave this placeholder comment as I'm bout to sleep. But it seems pretty clear now that Deckard is confirmed to be a replicant specially designed to be paired with Rachel as alluded to in the original ending for the first film. And it seems K is still implicitly the son of Deckard, but that the memory girl is his twin sister. Also K is not necessarily dead at the end, the Wikipedia article says he just looks up at the snowfall, not dead. And with four sequels in the realm of possibility according to Riddley himself, I doubt they'd kill of Gosling's incredibly well-acted character so soon. TBH, and I may get flack for this, I think I had a deeper appreciation for K in this film than for Deckard in the original. But then again, the first film wasn't REALLY about Deckard, whereas 2049 focuses a lot on K exploring his own humanity.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll leave this placeholder comment as I&amp;#39;m bout to sleep. But it seems pretty clear now that Deckard is confirmed to be a replicant specially designed to be paired with Rachel as alluded to in the original ending for the first film. And it seems K is still implicitly the son of Deckard, but that the memory girl is his twin sister. Also K is not necessarily dead at the end, the Wikipedia article says he just looks up at the snowfall, not dead. And with four sequels in the realm of possibility according to Riddley himself, I doubt they&amp;#39;d kill of Gosling&amp;#39;s incredibly well-acted character so soon. TBH, and I may get flack for this, I think I had a deeper appreciation for K in this film than for Deckard in the original. But then again, the first film wasn&amp;#39;t REALLY about Deckard, whereas 2049 focuses a lot on K exploring his own humanity.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/74tl0j/blade_runner_2049_was_p_good_no_spoilers_at_the/do111uq/", "subreddit_type": "public", "name": "t1_do111uq", "created": 1507391675.0, "author_flair_text": null, "created_utc": 1507362875.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_74tl0j", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "do18sfo", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "struntus", "can_mod_post": false, "ups": 3, "parent_id": "t3_74tl0j", "score": 3, "approved_by": null, "downs": 0, "body": "I liked Leto's delivery. He was playing God, and while he was far from human, that was a positive when it came to deifying himself in order to explore Deckard and Rachel as Adam and Eve for a new humanity in a galactic Eden. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I liked Leto&amp;#39;s delivery. He was playing God, and while he was far from human, that was a positive when it came to deifying himself in order to explore Deckard and Rachel as Adam and Eve for a new humanity in a galactic Eden. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/74tl0j/blade_runner_2049_was_p_good_no_spoilers_at_the/do18sfo/", "subreddit_type": "public", "name": "t1_do18sfo", "created": 1507412371.0, "author_flair_text": null, "created_utc": 1507383571.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_74tl0j", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "do13ovr", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Victo92", "can_mod_post": false, "ups": 2, "parent_id": "t3_74tl0j", "score": 2, "approved_by": null, "downs": 0, "body": "Yeah I've liked it aswell, I've liked also the fact that the world of 2049 is algid and monochrome as the society that was already decaying in the original movie has eached it's final deadly stage. In all honestly, the overall aesthetic of the exterior shots reminded me more of Limbo than Blade Runner (but in a good way)", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I&amp;#39;ve liked it aswell, I&amp;#39;ve liked also the fact that the world of 2049 is algid and monochrome as the society that was already decaying in the original movie has eached it&amp;#39;s final deadly stage. In all honestly, the overall aesthetic of the exterior shots reminded me more of Limbo than Blade Runner (but in a good way)&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/74tl0j/blade_runner_2049_was_p_good_no_spoilers_at_the/do13ovr/", "subreddit_type": "public", "name": "t1_do13ovr", "created": 1507399971.0, "author_flair_text": null, "created_utc": 1507371171.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_74tl0j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_74tl0j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_74tl0j", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "do5m9j8", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "pabodie", "can_mod_post": false, "ups": 1, "parent_id": "t1_do5ekmg", "score": 1, "approved_by": null, "downs": 0, "body": "I went away assuming K was a twin and Stelline was the other. But no one else seems to think that, so I assume I missed something. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went away assuming K was a twin and Stelline was the other. But no one else seems to think that, so I assume I missed something. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/74tl0j/blade_runner_2049_was_p_good_no_spoilers_at_the/do5m9j8/", "subreddit_type": "public", "name": "t1_do5m9j8", "created": 1507637042.0, "author_flair_text": null, "created_utc": 1507608242.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "do5ekmg", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "CrownedCaribou", "can_mod_post": false, "ups": 1, "parent_id": "t1_do5cyju", "score": 1, "approved_by": null, "downs": 0, "body": "That there were two kids, I think he discovered two dna matches...which is I'm not sure how twins work, but the records were all fucked up, too, and plus maybe replicants can reproduce differently.  The fact that they have DNA at all is confusing, I guess they are just entirely human except without needing 18 years to mature?  Idk how them reproducing is any better for colonization then.\n\ndangit", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That there were two kids, I think he discovered two dna matches...which is I&amp;#39;m not sure how twins work, but the records were all fucked up, too, and plus maybe replicants can reproduce differently.  The fact that they have DNA at all is confusing, I guess they are just entirely human except without needing 18 years to mature?  Idk how them reproducing is any better for colonization then.&lt;/p&gt;\n\n&lt;p&gt;dangit&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/74tl0j/blade_runner_2049_was_p_good_no_spoilers_at_the/do5ekmg/", "subreddit_type": "public", "name": "t1_do5ekmg", "created": 1507628134.0, "author_flair_text": "Now where could my pipe be?", "created_utc": 1507599334.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "do5cyju", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "pabodie", "can_mod_post": false, "ups": 1, "parent_id": "t3_74tl0j", "score": 1, "approved_by": null, "downs": 0, "body": "I didn’t understand what was discovered on the DNA  microfiche. Any ideas?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn’t understand what was discovered on the DNA  microfiche. Any ideas?&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/74tl0j/blade_runner_2049_was_p_good_no_spoilers_at_the/do5cyju/", "subreddit_type": "public", "name": "t1_do5cyju", "created": 1507626362.0, "author_flair_text": null, "created_utc": 1507597562.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_74tl0j", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_74tl0j", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "do1lsnz", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Marbly", "can_mod_post": false, "ups": 1, "parent_id": "t1_do1jxfa", "score": 1, "approved_by": null, "downs": 0, "body": "I largely agree, although I think the reasoning behind Wallace's plan was that replicants are difficult/expensive to produce, whereas a reproducing batch of them could supply Wallace with a potentially infinite number of completely loyal soldiers/slaves. Throw in a God complex and off you go. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I largely agree, although I think the reasoning behind Wallace&amp;#39;s plan was that replicants are difficult/expensive to produce, whereas a reproducing batch of them could supply Wallace with a potentially infinite number of completely loyal soldiers/slaves. Throw in a God complex and off you go. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/74tl0j/blade_runner_2049_was_p_good_no_spoilers_at_the/do1lsnz/", "subreddit_type": "public", "name": "t1_do1lsnz", "created": 1507430260.0, "author_flair_text": null, "created_utc": 1507401460.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "do1jxfa", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "arealbigboss", "can_mod_post": false, "ups": 1, "parent_id": "t3_74tl0j", "score": 1, "approved_by": null, "downs": 0, "body": "I liked it a lot but i feel as though they jumped too far ahead and opened up a lot of plot holes with the whole breeding thing. This should have been the third movie of a trilogy. \n\nIn the first movie, Replicants couldn't even live past 4 years (besides Deckard and Rachel) and now they're living long AND breeding? Isn't breeding itself an extremely shitty idea? Why would Wallace want them to do that? If he needs a disposable labor force the last thing he should be wanting is for them to be having children and forming strong emotional bonds.  \n\nThe secret Replicant society thing was cool I guess but when she said that \"theres gonna be a revolution\" it was so cringy. It was like I was watching a movie made after the Occupy protests and it didn't fit with the lore at all. They should have just been a underground railroad type operation that smuggles replicants to the off-world colonies disguised as humans. I also feel like they focused more on Joe's virtual wife then they should have. It took up a lot of story time, but it was good.\n\nBesides some issues with the overall story the movie was awesome. I think the part when the massive hologram talks to KD is great. The movie really highlights how hedonistic and shitty humans are. Maybe Tyrell's \"more human than human\" race of superhuman replicants are meant to take over.\n\n\n\n", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I liked it a lot but i feel as though they jumped too far ahead and opened up a lot of plot holes with the whole breeding thing. This should have been the third movie of a trilogy. &lt;/p&gt;\n\n&lt;p&gt;In the first movie, Replicants couldn&amp;#39;t even live past 4 years (besides Deckard and Rachel) and now they&amp;#39;re living long AND breeding? Isn&amp;#39;t breeding itself an extremely shitty idea? Why would Wallace want them to do that? If he needs a disposable labor force the last thing he should be wanting is for them to be having children and forming strong emotional bonds.  &lt;/p&gt;\n\n&lt;p&gt;The secret Replicant society thing was cool I guess but when she said that &amp;quot;theres gonna be a revolution&amp;quot; it was so cringy. It was like I was watching a movie made after the Occupy protests and it didn&amp;#39;t fit with the lore at all. They should have just been a underground railroad type operation that smuggles replicants to the off-world colonies disguised as humans. I also feel like they focused more on Joe&amp;#39;s virtual wife then they should have. It took up a lot of story time, but it was good.&lt;/p&gt;\n\n&lt;p&gt;Besides some issues with the overall story the movie was awesome. I think the part when the massive hologram talks to KD is great. The movie really highlights how hedonistic and shitty humans are. Maybe Tyrell&amp;#39;s &amp;quot;more human than human&amp;quot; race of superhuman replicants are meant to take over.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/74tl0j/blade_runner_2049_was_p_good_no_spoilers_at_the/do1jxfa/", "subreddit_type": "public", "name": "t1_do1jxfa", "created": 1507427817.0, "author_flair_text": "soft pink butt", "created_utc": 1507399017.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]