[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys. I&amp;#39;m here to tell you about a guy I like to call &amp;quot;Fair Share Fred&amp;quot;. Now Fair Share Fred, he&amp;#39;s not like you and me. He&amp;#39;s enlightened. He&amp;#39;s smart. He&amp;#39;s got an IQ in the range where you kinda figure out that IQ doesn&amp;#39;t really measure intelligence anyways and is just an arbitrary number. &lt;/p&gt;\n\n&lt;p&gt;Despite being so smart, he&amp;#39;s not rich. He&amp;#39;s got a job, a good one, probably tech, that pays ok. But he doesn&amp;#39;t work too hard at it. His student loans and the high cost of living in one of the US trendy urban neighborhoods mean he&amp;#39;s not exactly building a lot of wealth. He&amp;#39;s got enough to get by comfortably and with no girlfriend and no plan on ever having kids(could you imagine how much CO2 even one child would produce over the course of his life? Lots. Thank him later for saving the planet.) but not enough that he&amp;#39;d ever be able to make that jump into the proverbial 1%. &lt;/p&gt;\n\n&lt;p&gt;Now you&amp;#39;ve probably seen Fred many times, but not in real life. No, Fred doesn&amp;#39;t get out much. He doesn&amp;#39;t have that many hobbies or interests. Except politics. BOOOOY does he LOOOOOVE politics. He somehow pops up in every Reddit threat, every Facebook feed, every Twitter reply whenever someone mentions politics. He readily donates to campaigns, patreons, etc of anyone who promotes his very enlightened way of thinking.&lt;/p&gt;\n\n&lt;p&gt;The thing about Fred here, he&amp;#39;s an empathetic guy. He&amp;#39;s got a lot of compassion. And that compassion combined with his Big Brained persona mean he&amp;#39;s got a lot of opinions on how we should change the world. See he&amp;#39;s figured out how to make the perfect Utopia. &lt;/p&gt;\n\n&lt;p&gt;First we need to raise taxes on everyone richer than Fred. Fred is living comfortably, but not so much that it would be fair to take more of his income. Fred sets the bar at what level of lifestyle is considered &amp;quot;excessive&amp;quot; somewhere around $15,000-30,000 more than he makes annually. &lt;/p&gt;\n\n&lt;p&gt;Then, we just take all that money from those greedy people not paying their fair share, and use it to give everyone Universal Healthcare, Free College Education, and y&amp;#39;know what? Toss in a lil&amp;#39; Universal Basic Income while you&amp;#39;re at it. That would make everything fair. Plus we should go ahead and forgive his student loans while we&amp;#39;re at it.&lt;/p&gt;\n\n&lt;p&gt;You see, Fair Share Fred has so much empathy for those who are worse off than him that he hasn&amp;#39;t got any to spare for those who might be a little richer. He doesn&amp;#39;t identify with the struggles of the rich and all their ambition, and work ethic, and productive habits. He doesn&amp;#39;t care about all those wealthy people who take huge risks with their money trying to change the world and end up bankrupt. He doesn&amp;#39;t understand the desire to be great, to do great things, to make a big impact on the world. Despite Fair Share Fred&amp;#39;s Big Brain and Heart of Gold, the world would never &lt;em&gt;allow&lt;/em&gt; him to be great. No, the world is too busy stealing all the success from the poor and giving it to those 1%ers. If Fair Share Fred is every gonna do something great, it&amp;#39;s going to be as part of a collective of like minded individuals who also lack ambition, work ethic, and productive habits. And lucky for him there&amp;#39;s MILLIONS of Freds out there. Millions of like minded, mediocre losers with their slave morality, their animosity towards the rich, the gifted, the elite. &lt;/p&gt;\n\n&lt;p&gt;Now if you ever encounter Fred, it&amp;#39;s very important to remember a few things. Fred take a lot of pride in his &lt;em&gt;intellect&lt;/em&gt;. He considers himself to be very &lt;em&gt;smart&lt;/em&gt; and very &lt;em&gt;informed&lt;/em&gt; despite evidence to the contrary. Saying stuff about how you make more than him and therefore are smarter will &lt;em&gt;really&lt;/em&gt; grind his gears. In his mind, excellence and intellect are not related. He is that guy who is just too smart to make more money.&lt;/p&gt;\n\n&lt;p&gt;The next thing about Fred is that he&amp;#39;s not really good with women. They keep friend zoning him for assholes, but he knows that someday they&amp;#39;ll get tired of those Jerks and wanna settle down with a guy like him. &lt;/p&gt;\n\n&lt;p&gt;The last and most important thing to remember about Fred is that he is a loser. His entire mentality is built around identifying with the poor, the sick, the dejected, and downtrodden. Make sure you let him know that he&amp;#39;s a loser and that he chooses to think that way every day. He could do anything he wants to, but doesn&amp;#39;t believe in himself or his abilities. He is weak and has no interest in becoming strong. Let him know that you know he thinks this way.&lt;/p&gt;\n\n&lt;p&gt;I hope you all can gain something of value from this story. I hope the next time you see Fred, you can know a little more about his perspective on life, his motives, his beliefs. And I hope you can call him out on it. Cause at the end of the day, most of us think like Fred through some portion of our lives. I know I did back when I was an Obama voting, Jon Stewart watching, college kid. Expose him to new narratives that help him understand that the only &amp;quot;Fair share&amp;quot; is keeping what you earn and having the ability to do what you want with it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey guys. I'm here to tell you about a guy I like to call \"Fair Share Fred\". Now Fair Share Fred, he's not like you and me. He's enlightened. He's smart. He's got an IQ in the range where you kinda figure out that IQ doesn't really measure intelligence anyways and is just an arbitrary number. \n\nDespite being so smart, he's not rich. He's got a job, a good one, probably tech, that pays ok. But he doesn't work too hard at it. His student loans and the high cost of living in one of the US trendy urban neighborhoods mean he's not exactly building a lot of wealth. He's got enough to get by comfortably and with no girlfriend and no plan on ever having kids(could you imagine how much CO2 even one child would produce over the course of his life? Lots. Thank him later for saving the planet.) but not enough that he'd ever be able to make that jump into the proverbial 1%. \n\nNow you've probably seen Fred many times, but not in real life. No, Fred doesn't get out much. He doesn't have that many hobbies or interests. Except politics. BOOOOY does he LOOOOOVE politics. He somehow pops up in every Reddit threat, every Facebook feed, every Twitter reply whenever someone mentions politics. He readily donates to campaigns, patreons, etc of anyone who promotes his very enlightened way of thinking.\n\nThe thing about Fred here, he's an empathetic guy. He's got a lot of compassion. And that compassion combined with his Big Brained persona mean he's got a lot of opinions on how we should change the world. See he's figured out how to make the perfect Utopia. \n\nFirst we need to raise taxes on everyone richer than Fred. Fred is living comfortably, but not so much that it would be fair to take more of his income. Fred sets the bar at what level of lifestyle is considered \"excessive\" somewhere around $15,000-30,000 more than he makes annually. \n\nThen, we just take all that money from those greedy people not paying their fair share, and use it to give everyone Universal Healthcare, Free College Education, and y'know what? Toss in a lil' Universal Basic Income while you're at it. That would make everything fair. Plus we should go ahead and forgive his student loans while we're at it.\n\nYou see, Fair Share Fred has so much empathy for those who are worse off than him that he hasn't got any to spare for those who might be a little richer. He doesn't identify with the struggles of the rich and all their ambition, and work ethic, and productive habits. He doesn't care about all those wealthy people who take huge risks with their money trying to change the world and end up bankrupt. He doesn't understand the desire to be great, to do great things, to make a big impact on the world. Despite Fair Share Fred's Big Brain and Heart of Gold, the world would never *allow* him to be great. No, the world is too busy stealing all the success from the poor and giving it to those 1%ers. If Fair Share Fred is every gonna do something great, it's going to be as part of a collective of like minded individuals who also lack ambition, work ethic, and productive habits. And lucky for him there's MILLIONS of Freds out there. Millions of like minded, mediocre losers with their slave morality, their animosity towards the rich, the gifted, the elite. \n\nNow if you ever encounter Fred, it's very important to remember a few things. Fred take a lot of pride in his *intellect*. He considers himself to be very *smart* and very *informed* despite evidence to the contrary. Saying stuff about how you make more than him and therefore are smarter will *really* grind his gears. In his mind, excellence and intellect are not related. He is that guy who is just too smart to make more money.\n\nThe next thing about Fred is that he's not really good with women. They keep friend zoning him for assholes, but he knows that someday they'll get tired of those Jerks and wanna settle down with a guy like him. \n\nThe last and most important thing to remember about Fred is that he is a loser. His entire mentality is built around identifying with the poor, the sick, the dejected, and downtrodden. Make sure you let him know that he's a loser and that he chooses to think that way every day. He could do anything he wants to, but doesn't believe in himself or his abilities. He is weak and has no interest in becoming strong. Let him know that you know he thinks this way.\n\nI hope you all can gain something of value from this story. I hope the next time you see Fred, you can know a little more about his perspective on life, his motives, his beliefs. And I hope you can call him out on it. Cause at the end of the day, most of us think like Fred through some portion of our lives. I know I did back when I was an Obama voting, Jon Stewart watching, college kid. Expose him to new narratives that help him understand that the only \"Fair share\" is keeping what you earn and having the ability to do what you want with it.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "7355i5", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "MDE Effort-post of The Week", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 1, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_7355i5", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/7355i5/mde_effortpost_of_the_week/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1506682866.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/7355i5/mde_effortpost_of_the_week/", "author_flair_text": "Honorary PoC", "quarantine": false, "author": "Poolooloo", "created_utc": 1506654066.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.87, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7355i5", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dno50zb", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "pisspoorpoet", "can_mod_post": false, "ups": 4, "parent_id": "t3_7355i5", "score": 4, "approved_by": null, "downs": 0, "body": "If you wanna be a winner in life you have to stop thinking about all the losers. Focus on yourself, focus on today, make the choices that a winner would make.  Success is the result of a continuous chain of right choices made in the right order. Start making the right choices today, and dont be like fred.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you wanna be a winner in life you have to stop thinking about all the losers. Focus on yourself, focus on today, make the choices that a winner would make.  Success is the result of a continuous chain of right choices made in the right order. Start making the right choices today, and dont be like fred.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7355i5/mde_effortpost_of_the_week/dno50zb/", "subreddit_type": "public", "name": "t1_dno50zb", "created": 1506717267.0, "author_flair_text": "ima BRRAaaaaaaaaaaaaaaPpPp!!! GOD &amp; General RWSS|Hawwck P-TuH!", "created_utc": 1506688467.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]