[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "subreddit_id": "t5_2vsta", "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We have to start taking a look at how our society structured and how that has wide-spread ramifications on how society functionally operates. First, when considering the ideal role of women in our society, we must consider how they differ from men, both physically, developmentally, and psychologically.  Women are instinctual followers, and as leaders rule accordingly by consensus. They also are more emotionally intelligent, meaning they make quicker and stronger bonds with people. Considered together, one understands why it is important to limit the number of romantic male partners in a woman&amp;#39;s life to as few as possible. It is for her psychological health, her marital contentedness, which translates into the health and contentedness of her family, eventual children, and on the macro level the tribe and eventually the nation. Women need to be mastered psychologically, as a reflection of their need to be mastered on the bio-physical level as the submissive sexual partner with the vagina, and as is known no servant can truly serve two masters. This is why women must remain virgins until marriage, not only for the man&amp;#39;s sake but primarily for her and her eventual children&amp;#39;s sake. Being a virgin is not enough though. The father&amp;#39;s influence must also be considered as a source of marital tension, given these truths of female psychology. A traditional marital system, such as our European ancestors subscribed to, our kings, our emperors, our wise men, in which men married pre-pubescent girls can be understood considering this.&lt;/p&gt;\n\n&lt;p&gt;Women also develop at a younger age than males. Once development is finished, then the person in made on could say, the form rounded off much as the personality, the value-system, etc. The husband who marries the pre-pubescent girl not only curbs the potentially pernicious influence of the father, but also is able to raise his wife, instilling her with his value-system, tailoring her to his personality at her most impressionable age. Even if the influence of the father is not necessarily pernicious, it still creates a barrier between the husband and wife, because female psychology keeps her binded to her first master. He had access to her in her most impressionable ages, he tailored her to his own personality selfishly, though she was meant for another. The father is the source of marital discontent, as the wife inevitably compares her second master to her first, and because of the impressionable age she was during the &amp;quot;courting&amp;quot; of her first master, the bond of the second master will never live up to the first, even if qualitatively he exceeds the standard set. This dynamic creates the foundation upon which infidelity and numerous other social ills are built. If the young girl was rather raised by her husband, knowing only one master, who is her teacher, who is the foundation of her moral system, her entire world-view, is akin to a god in her life upon which she always has as long as she remembers relied on for sustinence, and as she reaches the age of fertility becomes his lover, the first love of her life (the strongest bond in romantic life, never broken), then imagine how much good would come out of this. She is fortified psychologically, her mental and spiritual health fortifies her family, her children, her tribe. There will be less infidelity. There will be less STDs, less drug abuse, all manner of social ills will be cured or at least lessened through this one simple trick. This isn&amp;#39;t just about the tight pussy. It&amp;#39;s about the spiritual health of our nation, but primarily the spiritual health of our women. It&amp;#39;s for their sake and the sake of our children.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "We have to start taking a look at how our society structured and how that has wide-spread ramifications on how society functionally operates. First, when considering the ideal role of women in our society, we must consider how they differ from men, both physically, developmentally, and psychologically.  Women are instinctual followers, and as leaders rule accordingly by consensus. They also are more emotionally intelligent, meaning they make quicker and stronger bonds with people. Considered together, one understands why it is important to limit the number of romantic male partners in a woman's life to as few as possible. It is for her psychological health, her marital contentedness, which translates into the health and contentedness of her family, eventual children, and on the macro level the tribe and eventually the nation. Women need to be mastered psychologically, as a reflection of their need to be mastered on the bio-physical level as the submissive sexual partner with the vagina, and as is known no servant can truly serve two masters. This is why women must remain virgins until marriage, not only for the man's sake but primarily for her and her eventual children's sake. Being a virgin is not enough though. The father's influence must also be considered as a source of marital tension, given these truths of female psychology. A traditional marital system, such as our European ancestors subscribed to, our kings, our emperors, our wise men, in which men married pre-pubescent girls can be understood considering this.\n\nWomen also develop at a younger age than males. Once development is finished, then the person in made on could say, the form rounded off much as the personality, the value-system, etc. The husband who marries the pre-pubescent girl not only curbs the potentially pernicious influence of the father, but also is able to raise his wife, instilling her with his value-system, tailoring her to his personality at her most impressionable age. Even if the influence of the father is not necessarily pernicious, it still creates a barrier between the husband and wife, because female psychology keeps her binded to her first master. He had access to her in her most impressionable ages, he tailored her to his own personality selfishly, though she was meant for another. The father is the source of marital discontent, as the wife inevitably compares her second master to her first, and because of the impressionable age she was during the \"courting\" of her first master, the bond of the second master will never live up to the first, even if qualitatively he exceeds the standard set. This dynamic creates the foundation upon which infidelity and numerous other social ills are built. If the young girl was rather raised by her husband, knowing only one master, who is her teacher, who is the foundation of her moral system, her entire world-view, is akin to a god in her life upon which she always has as long as she remembers relied on for sustinence, and as she reaches the age of fertility becomes his lover, the first love of her life (the strongest bond in romantic life, never broken), then imagine how much good would come out of this. She is fortified psychologically, her mental and spiritual health fortifies her family, her children, her tribe. There will be less infidelity. There will be less STDs, less drug abuse, all manner of social ills will be cured or at least lessened through this one simple trick. This isn't just about the tight pussy. It's about the spiritual health of our nation, but primarily the spiritual health of our women. It's for their sake and the sake of our children.\n\n", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "7d26v6", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "author": "sherdickofnuttingham", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 17, "approved_by": null, "over_18": false, "removal_reason": null, "hidden": false, "num_comments": 1, "thumbnail": "self", "hide_score": false, "edited": 1510726700.0, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "media_embed": {}, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_7d26v6", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/7d26v6/show_me_a_perfectly_contented_wife_and_ill_show/", "subreddit_type": "public", "whitelist_status": "promo_adult_nsfw", "stickied": false, "created": 1510755287.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/7d26v6/show_me_a_perfectly_contented_wife_and_ill_show/", "author_flair_text": null, "quarantine": false, "title": "Show me a perfectly contented wife, and I'll show you the husband that raised her.", "created_utc": 1510726487.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.81, "mod_reports": [], "is_self": true, "visited": false, "num_reports": null, "is_video": false, "ups": 17}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7d26v6", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dpukoei", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Mrnewbhero", "can_mod_post": false, "ups": 8, "parent_id": "t3_7d26v6", "score": 8, "approved_by": null, "downs": 0, "body": "Post is too long but going off title, women are in a perpetual state of psychologically being in between child-like and adult. It’s pretty obvious that evolutionarily they were supposed to be wed/paired young so that they would be led and designed by their husbands (ie come to posses all the beliefs, ways of life, be attached etc of the husband) rather than being an entirely separate individual trying to co-exist and “respecting” their differences. This goes in line with the hierarchy of man, woman, and children. It’s not man/woman and children.", "edited": 1510735743.0, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Post is too long but going off title, women are in a perpetual state of psychologically being in between child-like and adult. It’s pretty obvious that evolutionarily they were supposed to be wed/paired young so that they would be led and designed by their husbands (ie come to posses all the beliefs, ways of life, be attached etc of the husband) rather than being an entirely separate individual trying to co-exist and “respecting” their differences. This goes in line with the hierarchy of man, woman, and children. It’s not man/woman and children.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7d26v6/show_me_a_perfectly_contented_wife_and_ill_show/dpukoei/", "num_reports": null, "name": "t1_dpukoei", "created": 1510763430.0, "author_flair_text": "I am atheist ergo homosexuality cannot be a net loss on society", "created_utc": 1510734630.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "after": null, "before": null}}]