[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;His hands were tugging hard on the edges of my shihakusho. They were insistent at my obi and I was shuddering under his touch. He growled softly into my neck and I practically swooned when his teeth clamped down on my pulse point. My hands were aching to slither down his bare shoulders and then across his abdomen. My breath was hot on his ear and I could see a few ruffles of orange hair flutter every time I drew in a weak gasp of air. My shihakusho was down to my waist now and I groaned when his big, strong, calloused, hands palmed my breasts. The nipples drew into taunt peaks and I felt my knees weaken considerably.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ichigo…&amp;quot; I gasped his name like it was a fucking plea. I could feel the insides of my legs growing sticky and wet. His mouth was still shifting around my neck and his bare chest was rubbing against my breasts. Soft, ginger, hair was tickling my stomach and I could hear begging whines escape my throat with each sinful pass he made with his tongue.&lt;/p&gt;\n\n&lt;p&gt;One of his hands was now digging into the front of my pants. He was touching my midnight curls with gusto, his fingers were probing me slickly, and I threw my head back when his pointer finger drew across the inside of my labia. I was shuddering underneath him and he chuckled.&lt;/p&gt;\n\n&lt;p&gt;There was a slight change in the aura of the room and suddenly, everything didn&amp;#39;t feel so good.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Shit,&amp;quot; I muttered, dropping my hands limply from his shoulders.&lt;/p&gt;\n\n&lt;p&gt;He kept laving my creamy skin and I growled low in my throat. &amp;quot;Ichigo…&amp;quot; I said quietly, my voice was commanding and slightly annoyed.&lt;/p&gt;\n\n&lt;p&gt;He murmured against my neck and then pressed another finger against my clit. I could feel my body going into flaming cartwheels but I knew I needed to stop him… again.&lt;/p&gt;\n\n&lt;p&gt;I put my hands on his chest and firmly pushed him back. He didn&amp;#39;t budge. I ground out his name and pushed him back once again. This time, his mouth detached from my shoulder but his hands didn&amp;#39;t move from inside my pants.&lt;/p&gt;\n\n&lt;p&gt;I glared at him and he glared back. His breathing was hard and so was mine; my breaths, however, had a bit of anger mixed inside of them.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What?&amp;quot; He demanded, his hands pressing with more insistence against my tender and wet center.&lt;/p&gt;\n\n&lt;p&gt;I narrowed my eyes and moved to wrap my fingers around the strong muscles of his forearms. Damn, one hundred and forty five years of being a Shinigami Captain had paid off significantly. I had to stop myself from running my hands all along his arms and then down onto his chest. I had to focus. I jerked his hands out of my pants and immediately wished I hadn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re—&amp;quot; My throat squeaked and I had to clear it. Ichigo took notice and quirked one of his eyebrows upward. I balled my hand into a fist and slammed it against his stomach. He coughed and glared at me.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re doing it again!&amp;quot; I told him hotly, which, I told myself, had absolutely nothing to do with him being half naked, me being half naked, and Ichigo&amp;#39;s erection pressing insistently against my loose pants.&lt;/p&gt;\n\n&lt;p&gt;His back stiffened for a minute and then he frowned, his head swung to the sides and then up and down. When his eyes came back to me I was hastily covering my breasts with my slack shihakusho. His hands reached up immediately to stop me and yanked the fabric back down. I was about to protest when his mouth came down on mine and silenced me.&lt;/p&gt;\n\n&lt;p&gt;He kissed me long and hard, his tongue dipped into grooves in my mouth I didn&amp;#39;t even really know I had. It&amp;#39;s really amazing that after nearly a century of kissing him he could still manage to surprise me. He rubbed against me and his lips tugged at mine. I whimpered against him. He was moving his lips irresistibly against mine. He was sliding, tugging, thrusting, and downright fucking my mouth. I moaned and quivered like gelatin but knew that this time I had to be adamant. We just couldn&amp;#39;t keep going on like this.&lt;/p&gt;\n\n&lt;p&gt;I broke the kiss—immediately wishing I hadn&amp;#39;t—and pushed my entire palm against his face, my fingers crisscrossed over his eyes and his mouth was stopped by my wrist. He gave off a strangled &amp;#39;mfph!&amp;#39; and I glowered.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ichigo!&amp;quot; I cried again, angrier this time, &amp;quot;No! I said no!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Rukia!&amp;quot; He shouted, pressing his waist hard against mine, I felt his rock-hard erection rub against me and nearly melted right then and there. &amp;quot;Come on, I just got back, I&amp;#39;ve been gone for a month, I spent all that time sleeping on the ground, eating crap, and chasing Hollows! I haven&amp;#39;t screwed you in weeks! I&amp;#39;m fucking desperate!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Then learn how to control your reiatsu!&amp;quot; I screamed back, pushing him away a bit. He wouldn&amp;#39;t move.&lt;/p&gt;\n\n&lt;p&gt;He narrowed his eyes and pursed his lips tightly.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ichigo!&amp;quot; I cried, desperately trying to get my message through his thick skull. &amp;quot;I am tired of getting snickers, weird hand gestures, and freaking dirty looks from every single person in the Soul Society each time we have sex!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;His mouth parted slightly but his frown deepened. In his eyes there was a stare of blank confusion. I growled and threw my hands up into the air, my eyes looked towards the ceiling, and I was frantically trying to control the angrily throbbing vein in my forehead.&lt;/p&gt;\n\n&lt;p&gt;I placed my hands on his shoulders and shook him hard. &amp;quot;You can&amp;#39;t control your spiritual pressure when we have sex! It goes everywhere! Mine too because you get me all hot and bothered!&amp;quot; I let out an exasperated sigh and shook my head rapidly. &amp;quot;Everyone in the Soul Society feels it, and trust me, they&amp;#39;ve felt it so many times I know they recognize it&amp;#39;s us! I bet they even get a whiff of it in Rukongai!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Ichigo&amp;#39;s mouth dropped and reached his hands down to my sides. &amp;quot;Well it&amp;#39;s not like I can help it!&amp;quot; He shouted, shaking me in return.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You could if you learned how to control your reiatsu!&amp;quot; I shot back, snorting slightly.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;ve been trying for the past century and a half!&amp;quot; He yelled and I glared darkly at him. &amp;quot;It&amp;#39;s not going to work! You know that I can&amp;#39;t keep things like that bottled up, especially when I&amp;#39;m fucking you!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My eyes were narrowed into tiny slits and my lips were pursed into a thin line. He was staring back at me with an equally stubborn expression. I raised a hand to my temple and pulled it over my eyes, nose, and mouth. I then tugged my fingers through my rumpled hair, running possible solutions through my head as quickly as I could. Ichigo was staring at me; discomfort was evident in his eyes. I looked down and saw that he still had a ramrod-straight erection. He was shifting from foot to foot and I could practically see him stripping off my clothes with his eyes.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Rukia…&amp;quot; he groaned, he was biting his lip, his eyes were dark and heady. His face was angled towards my chest and staring hungrily at my breasts. I knew he wanted to touch them. I swear, when we first started dating—and eventually screwing—it seemed like he couldn&amp;#39;t get enough of my pitifully small breasts. He still can&amp;#39;t and I have no idea why. When I asked him about it he just smirked, pushed me beneath him, and tore off my shirt.&lt;/p&gt;\n\n&lt;p&gt;How did such a shy virgin become such a sex fiend? I wondered helplessly.&lt;/p&gt;\n\n&lt;p&gt;I crossed my hands over my chest and rolled my eyes.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Step back.&amp;quot; I commanded softly.&lt;/p&gt;\n\n&lt;p&gt;He gave me a wary look and sighed, &amp;quot;Just do it.&amp;quot; I demanded. His eyes flashed dangerously and I thought vaguely of the double meaning of my words.&lt;/p&gt;\n\n&lt;p&gt;He turned and I climbed onto his back quickly. He groaned softly and I pressed a swift kiss to his neck.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What now?&amp;quot; He asked, his voice was weak and the muscles in his throat were tight.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Shunpo to the Spirit-Sealing Pit.&amp;quot; I told him softly. &amp;quot;You know, where I was prisoner for a while.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Ichigo turned his head to me swiftly and when he spoke his voice was indignant. &amp;quot;Why would you want to have sex there?&amp;quot; He demanded. &amp;quot;It&amp;#39;ll only make me think of people trying to kill you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I scoffed lightly and looped my hands over his shoulders. I ran my nails over his skin and then circled his nipples with my fingers. His breath hitched and he bent forward slightly. I grinned wickedly and soothed my open mouth and wet tongue all the way from his shoulder to his ear. I nipped his dangling lobe hard and he groaned. His hands tightened where they gripped the backs of my knees. I pressed my hips against him and ground my wet heat into him. I knew he could feel it even through the layers of clothing we were wearing.&lt;/p&gt;\n\n&lt;p&gt;I breathed hotly into his ear and whispered seductively, &amp;quot;Instead of that…&amp;quot; I began, knowing I would enjoy what would transpire between us within the next few minutes, &amp;quot;Think of me wearing a thin, white, see-through robe. It barely covers me. The tie is loose, the neck is low, and the hem is higher than it should be.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He groaned audibly and I snickered into his ear, licking the shell softly, &amp;quot;And don&amp;#39;t forget about my little red doggie collar—&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He was off before I could utter another word. He flash stepped across the entirety of the Soul Society in a manner of seconds. As we entered the Spirit-Sealing Pit I wondered briefly if anyone saw us.&lt;/p&gt;\n\n&lt;p&gt;Ah well, it didn&amp;#39;t really matter anyway. For now I would be content with good, old fashioned sex… without worrying about who would give us dirty grins in the morning.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "His hands were tugging hard on the edges of my shihakusho. They were insistent at my obi and I was shuddering under his touch. He growled softly into my neck and I practically swooned when his teeth clamped down on my pulse point. My hands were aching to slither down his bare shoulders and then across his abdomen. My breath was hot on his ear and I could see a few ruffles of orange hair flutter every time I drew in a weak gasp of air. My shihakusho was down to my waist now and I groaned when his big, strong, calloused, hands palmed my breasts. The nipples drew into taunt peaks and I felt my knees weaken considerably.\n\n\"Ichigo…\" I gasped his name like it was a fucking plea. I could feel the insides of my legs growing sticky and wet. His mouth was still shifting around my neck and his bare chest was rubbing against my breasts. Soft, ginger, hair was tickling my stomach and I could hear begging whines escape my throat with each sinful pass he made with his tongue.\n\nOne of his hands was now digging into the front of my pants. He was touching my midnight curls with gusto, his fingers were probing me slickly, and I threw my head back when his pointer finger drew across the inside of my labia. I was shuddering underneath him and he chuckled.\n\nThere was a slight change in the aura of the room and suddenly, everything didn't feel so good.\n\n\"Shit,\" I muttered, dropping my hands limply from his shoulders.\n\nHe kept laving my creamy skin and I growled low in my throat. \"Ichigo…\" I said quietly, my voice was commanding and slightly annoyed.\n\nHe murmured against my neck and then pressed another finger against my clit. I could feel my body going into flaming cartwheels but I knew I needed to stop him… again.\n\nI put my hands on his chest and firmly pushed him back. He didn't budge. I ground out his name and pushed him back once again. This time, his mouth detached from my shoulder but his hands didn't move from inside my pants.\n\nI glared at him and he glared back. His breathing was hard and so was mine; my breaths, however, had a bit of anger mixed inside of them.\n\n\"What?\" He demanded, his hands pressing with more insistence against my tender and wet center.\n\nI narrowed my eyes and moved to wrap my fingers around the strong muscles of his forearms. Damn, one hundred and forty five years of being a Shinigami Captain had paid off significantly. I had to stop myself from running my hands all along his arms and then down onto his chest. I had to focus. I jerked his hands out of my pants and immediately wished I hadn't.\n\n\"You're—\" My throat squeaked and I had to clear it. Ichigo took notice and quirked one of his eyebrows upward. I balled my hand into a fist and slammed it against his stomach. He coughed and glared at me.\n\n\"You're doing it again!\" I told him hotly, which, I told myself, had absolutely nothing to do with him being half naked, me being half naked, and Ichigo's erection pressing insistently against my loose pants.\n\nHis back stiffened for a minute and then he frowned, his head swung to the sides and then up and down. When his eyes came back to me I was hastily covering my breasts with my slack shihakusho. His hands reached up immediately to stop me and yanked the fabric back down. I was about to protest when his mouth came down on mine and silenced me.\n\nHe kissed me long and hard, his tongue dipped into grooves in my mouth I didn't even really know I had. It's really amazing that after nearly a century of kissing him he could still manage to surprise me. He rubbed against me and his lips tugged at mine. I whimpered against him. He was moving his lips irresistibly against mine. He was sliding, tugging, thrusting, and downright fucking my mouth. I moaned and quivered like gelatin but knew that this time I had to be adamant. We just couldn't keep going on like this.\n\nI broke the kiss—immediately wishing I hadn't—and pushed my entire palm against his face, my fingers crisscrossed over his eyes and his mouth was stopped by my wrist. He gave off a strangled 'mfph!' and I glowered.\n\n\"Ichigo!\" I cried again, angrier this time, \"No! I said no!\"\n\n\"Rukia!\" He shouted, pressing his waist hard against mine, I felt his rock-hard erection rub against me and nearly melted right then and there. \"Come on, I just got back, I've been gone for a month, I spent all that time sleeping on the ground, eating crap, and chasing Hollows! I haven't screwed you in weeks! I'm fucking desperate!\"\n\n\"Then learn how to control your reiatsu!\" I screamed back, pushing him away a bit. He wouldn't move.\n\nHe narrowed his eyes and pursed his lips tightly.\n\n\"Ichigo!\" I cried, desperately trying to get my message through his thick skull. \"I am tired of getting snickers, weird hand gestures, and freaking dirty looks from every single person in the Soul Society each time we have sex!\"\n\nHis mouth parted slightly but his frown deepened. In his eyes there was a stare of blank confusion. I growled and threw my hands up into the air, my eyes looked towards the ceiling, and I was frantically trying to control the angrily throbbing vein in my forehead.\n\nI placed my hands on his shoulders and shook him hard. \"You can't control your spiritual pressure when we have sex! It goes everywhere! Mine too because you get me all hot and bothered!\" I let out an exasperated sigh and shook my head rapidly. \"Everyone in the Soul Society feels it, and trust me, they've felt it so many times I know they recognize it's us! I bet they even get a whiff of it in Rukongai!\"\n\nIchigo's mouth dropped and reached his hands down to my sides. \"Well it's not like I can help it!\" He shouted, shaking me in return.\n\n\"You could if you learned how to control your reiatsu!\" I shot back, snorting slightly.\n\n\"I've been trying for the past century and a half!\" He yelled and I glared darkly at him. \"It's not going to work! You know that I can't keep things like that bottled up, especially when I'm fucking you!\"\n\nMy eyes were narrowed into tiny slits and my lips were pursed into a thin line. He was staring back at me with an equally stubborn expression. I raised a hand to my temple and pulled it over my eyes, nose, and mouth. I then tugged my fingers through my rumpled hair, running possible solutions through my head as quickly as I could. Ichigo was staring at me; discomfort was evident in his eyes. I looked down and saw that he still had a ramrod-straight erection. He was shifting from foot to foot and I could practically see him stripping off my clothes with his eyes.\n\n\"Rukia…\" he groaned, he was biting his lip, his eyes were dark and heady. His face was angled towards my chest and staring hungrily at my breasts. I knew he wanted to touch them. I swear, when we first started dating—and eventually screwing—it seemed like he couldn't get enough of my pitifully small breasts. He still can't and I have no idea why. When I asked him about it he just smirked, pushed me beneath him, and tore off my shirt.\n\nHow did such a shy virgin become such a sex fiend? I wondered helplessly.\n\nI crossed my hands over my chest and rolled my eyes.\n\n\"Step back.\" I commanded softly.\n\nHe gave me a wary look and sighed, \"Just do it.\" I demanded. His eyes flashed dangerously and I thought vaguely of the double meaning of my words.\n\nHe turned and I climbed onto his back quickly. He groaned softly and I pressed a swift kiss to his neck.\n\n\"What now?\" He asked, his voice was weak and the muscles in his throat were tight.\n\n\"Shunpo to the Spirit-Sealing Pit.\" I told him softly. \"You know, where I was prisoner for a while.\"\n\nIchigo turned his head to me swiftly and when he spoke his voice was indignant. \"Why would you want to have sex there?\" He demanded. \"It'll only make me think of people trying to kill you.\"\n\nI scoffed lightly and looped my hands over his shoulders. I ran my nails over his skin and then circled his nipples with my fingers. His breath hitched and he bent forward slightly. I grinned wickedly and soothed my open mouth and wet tongue all the way from his shoulder to his ear. I nipped his dangling lobe hard and he groaned. His hands tightened where they gripped the backs of my knees. I pressed my hips against him and ground my wet heat into him. I knew he could feel it even through the layers of clothing we were wearing.\n\nI breathed hotly into his ear and whispered seductively, \"Instead of that…\" I began, knowing I would enjoy what would transpire between us within the next few minutes, \"Think of me wearing a thin, white, see-through robe. It barely covers me. The tie is loose, the neck is low, and the hem is higher than it should be.\"\n\nHe groaned audibly and I snickered into his ear, licking the shell softly, \"And don't forget about my little red doggie collar—\"\n\nHe was off before I could utter another word. He flash stepped across the entirety of the Soul Society in a manner of seconds. As we entered the Spirit-Sealing Pit I wondered briefly if anyone saw us.\n\nAh well, it didn't really matter anyway. For now I would be content with good, old fashioned sex… without worrying about who would give us dirty grins in the morning.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "74yadr", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "God is dead and we have killed him. How shall we comfort ourselves, the murderers of all murderers? What was holiest and mightiest of all that the world has yet owned has bled to death under our knives: who will wipe this blood off us? What water is there for us to clean ourselves?", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 0, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_74yadr", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/74yadr/god_is_dead_and_we_have_killed_him_how_shall_we/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1507447611.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/74yadr/god_is_dead_and_we_have_killed_him_how_shall_we/", "author_flair_text": "when my field hockey wife asked me to marry her i said yes", "quarantine": false, "author": "MitchellTrutitsky", "created_utc": 1507418811.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.73, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [], "after": null, "before": null}}]