[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To be fair, you have to have a very wide butt to understand possy anal sex. The texture is extremely subtle, and without a solid grasp of the headboard most of the thrusts will go over a typical possy&amp;#39;s prostate. There&amp;#39;s also sticks&amp;#39; nihilistic outlook, which is deftly woven into their subculture - their personal philosophy draws heavily from Hispanic Soap operas, for instance. The allies understand this stuff; we have the emotional capacity to truly appreciate the depths of these neuroses, to realize that they&amp;#39;re not just healthy- they say something deep about SOCIETY. As a consequence bigots who dislike Sticks and Niggers truly ARE racists- of course they wouldn&amp;#39;t support, for instance, the Tocquevillism in Sticks&amp;#39; progressive catchphrase &amp;quot;BlackLivesMatter,&amp;quot; which itself is an intersectional reference to the constant rape of american urban wildlife I&amp;#39;m shaking right now just imagining one of those inbred neanderthals scratching their swastika tattoos in anger as Michelle Obama&amp;#39;s passion for school lunches unfolds itself on their child&amp;#39;s lunch trays. What fossils... how I pity them. 😂 And yes by the way, I DO have a Sticks and Niggers ribbon on my hybrid. And no, you cannot hear it. It&amp;#39;s for the blacks&amp;#39; eyes only- And even they have to demonstrate that they&amp;#39;re within 5 ideological points of my own (preferably outside) beforehand.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "To be fair, you have to have a very wide butt to understand possy anal sex. The texture is extremely subtle, and without a solid grasp of the headboard most of the thrusts will go over a typical possy's prostate. There's also sticks' nihilistic outlook, which is deftly woven into their subculture - their personal philosophy draws heavily from Hispanic Soap operas, for instance. The allies understand this stuff; we have the emotional capacity to truly appreciate the depths of these neuroses, to realize that they're not just healthy- they say something deep about SOCIETY. As a consequence bigots who dislike Sticks and Niggers truly ARE racists- of course they wouldn't support, for instance, the Tocquevillism in Sticks' progressive catchphrase \"BlackLivesMatter,\" which itself is an intersectional reference to the constant rape of american urban wildlife I'm shaking right now just imagining one of those inbred neanderthals scratching their swastika tattoos in anger as Michelle Obama's passion for school lunches unfolds itself on their child's lunch trays. What fossils... how I pity them. 😂 And yes by the way, I DO have a Sticks and Niggers ribbon on my hybrid. And no, you cannot hear it. It's for the blacks' eyes only- And even they have to demonstrate that they're within 5 ideological points of my own (preferably outside) beforehand.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "74u5z2", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "r slash ThErEaLsTiCkS", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 0, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_74u5z2", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/74u5z2/r_slash_therealsticks/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1507401423.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/74u5z2/r_slash_therealsticks/", "author_flair_text": "#TeamIsrael", "quarantine": false, "author": "EternalPropagation", "created_utc": 1507372623.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.77, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [], "after": null, "before": null}}]