[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.thelastpsychiatrist", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "subreddit_id": "t5_2vsta", "thumbnail_width": 140, "subreddit": "milliondollarextreme", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "7g4z4j", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "author": "ASKMEBOUTTHEBASEDGOD", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 5, "approved_by": null, "over_18": false, "removal_reason": null, "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/h_ZVodSlLw_kNH_U5TXm5fE0AhQxGVE0RFaOkvDO76g.jpg?s=ca2fb2a79f768ed594175033dd44a905", "width": 360, "height": 480}, "resolutions": [{"url": "https://i.redditmedia.com/h_ZVodSlLw_kNH_U5TXm5fE0AhQxGVE0RFaOkvDO76g.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=cb21f02c8ae411ac122e7fd8c4830082", "width": 108, "height": 144}, {"url": "https://i.redditmedia.com/h_ZVodSlLw_kNH_U5TXm5fE0AhQxGVE0RFaOkvDO76g.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=bba5c1620580b7747310a66fe1837d9d", "width": 216, "height": 288}, {"url": "https://i.redditmedia.com/h_ZVodSlLw_kNH_U5TXm5fE0AhQxGVE0RFaOkvDO76g.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=59faee20e372442638f5fe6b2390a8d2", "width": 320, "height": 426}], "variants": {}, "id": "QpJSIwPjtDl8EbXt12YVQNHROosOUHIQvnTCFUqmZMU"}], "enabled": false}, "num_comments": 1, "thumbnail": "https://b.thumbs.redditmedia.com/gaBnNNw7f9qUCe6mLaHFglrenQRJhTduf0eLDUzc8TQ.jpg", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "media_embed": {}, "post_hint": "link", "stickied": false, "can_gild": false, "thumbnail_height": 140, "parent_whitelist_status": "all_ads", "name": "t3_7g4z4j", "crosspost_parent": "t3_7flmob", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/7g4z4j/female_objectification_and_2_nonsolutions_demand/", "subreddit_type": "public", "whitelist_status": "all_ads", "crosspost_parent_list": [{"domain": "self.thelastpsychiatrist", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "subreddit_id": "t5_2zd20", "thumbnail_width": null, "subreddit": "thelastpsychiatrist", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To feed the desire of the young woman to remove the sense of obstacles to her pure enjoyment of life, so that she may hop and skip and jump into adulthood, an entire cottage industry of a corrupted version of the Lacanian concept of the gaze has appeared. Starting with &lt;a href=\"https://en.wikipedia.org/wiki/Laura_Mulvey\"&gt;Laura Mulvey&amp;#39;s exceptionally bad&lt;/a&gt; misreading of Lacan in her influential essay on the &amp;#39;male gaze&amp;#39; right until the pop-psychoanalysis found in every magazine and the woman section of every newspaper, a bizarre but highly desirable (for young women) version of reality is given air. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&amp;quot;&amp;quot;&amp;quot;The Male gaze&amp;quot;&amp;quot;&amp;quot;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In this fantastical (strictly speaking, this pseudo-Lacanian Mulveyian concept &lt;em&gt;is itself&lt;/em&gt; a Lacanian fantasy) world view, a stitching together of misandric feminism with the shallow common sense view of women as helpless creatures subjected to forces of society beyond their agency, and men as automaton predators intent on eating the life of women.  &lt;/p&gt;\n\n&lt;p&gt;Lacan would reject this view as an absurd and wilful rejection of the intersubjective nature of desire, sense of self, and the entry into the adult world of the social order. The desire to displace their own desire onto others. The desire for others to desire them. The desire for society to control this trembling and traumatic force of desire. All these various desires are aided by this fantasy of a simple relation of being the object of man, his look. &lt;/p&gt;\n\n&lt;p&gt;Is it not fascinating and revealing that the sources of the sense of being watched are in materials that the young women seek out: their gossip magazines, in drama TV shows, in chick lit. &lt;em&gt;Why do they not avoid it?&lt;/em&gt; This is, of course, rank hypocrisy. Desire is for the desire of the Other. A life of a teenager is to discover how to obtain the other&amp;#39;s attention. &lt;em&gt;What mask must I wear?&lt;/em&gt; The discovery that there is no Big Other with a consistent view of beauty and with a rulebook on desire is a late discovery, perhaps in the mid-20s. So until then their Mothers must guide them... perhaps with teaching them beauty and makeup techniques. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;We should and must objectify&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://realitysandwich.com/318605/desire-is-the-truth-of-it-jacques-lacan-and-wanting-wanting/\"&gt;Consider this&lt;/a&gt;: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Far from the desexualized stereotype that some critics place on him, Lacan wanted people to experience the true movement and fluidity of their desire.&lt;/p&gt;\n\n&lt;p&gt;“There is no sexual relationship,” he stated. We don’t ever really encounter each other during sex because there’s so much regulating the interaction, particularly our ideas of sex/gender/man/woman. By the time we get to the bedroom, it’s already too late to meet another human being. “One can no more speak of ‘woman’ than of ‘man’ without …invalidating in advance any conceptualization,” declared French feminist writer Helene Cixous. Lacan might agree and add, “Or speak of any sexual advance either.” In sex, we only meet each other, instead, as “partial objects.” That is, we encounter whatever aspect it is that we can handle. Objectification is not the same as dehumanization. Indeed, for Lacan, it is an intrinsic part of the sexual process. The question that needs to be answered isn’t “How do we not objectify?” but “Why would I want to do anything else?” Desire will lead you to releasing all the false objects of desire that you think will please you. Follow it, and you won’t ever see other people the same way again.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So we must and should be an object of the Other. Indeed, the only sensible meaning of the male gaze, at least outside of film theory, is something imagined within the girl&amp;#39;s mind (she could not possibly know what is going on in the man&amp;#39;s mind): &lt;em&gt;just what are they looking at? how are they considering me? what must I do...?&lt;/em&gt; This is why rape is the ultimate fantasy; it renders as a story a discovery of pure desire. &lt;/p&gt;\n\n&lt;p&gt;So what is objectionable about the fantasy of a male gaze is that it claims some entirely false insight into men and proclaims some mysterious extra power they have that women have no access. So the men are regarded as complete objects, knowing their own desires, who walk in the World at peace with themselves. &lt;em&gt;Lacan would have laughed.&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Master&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://thelastpsychiatrist.com/2013/05/dove.html\"&gt;Alone has an insight into the Dove ad&lt;/a&gt; that sustains the desire:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The con artists at Dove didn&amp;#39;t select these women to represent you because you are beautiful or ugly, any more than the street hustler selected you for your nice smile.   They were selected because they represent a psychological type that transcends age/race/class, it is characterized by a kind of psychological laziness: on the one hand, they don&amp;#39;t want to have to conform to society&amp;#39;s impossible standards, but on the other hand they don&amp;#39;t want the existential terror of NOT conforming to some kind of standard.  They want an objective bar to be changed to fit them-- they want &amp;quot;some other omnipotent entity&amp;quot; to change it so that it remains both entirely valid yet still true for them, so that others have to accept it, and if you have no idea what I&amp;#39;m talking about look at your GPA: you know, and I know, that if college graded you based on the actual number of correct answers you generated, no curve, then you would have gotten an R.  Somehow that R became an A.  The question is, why bother?  Why not either make grades rigorous and valid so we know exactly what they mean, or else do away with them entirely?  Because in either case society and your head would implode from the existential vacuum.  Instead, everyone has to get As AND the As have to be &amp;quot;valid&amp;quot; so you feel good enough to pay next year&amp;#39;s tuition, unfortunately leaving employers with no other choice but to look for other more reliable proxies of learning like race, gender, and physical appearance.  Oh.   Did you assume employers would be more influenced by the fixed grades than their own personal prejudices?   &amp;quot;Wait a second, I graduated 4.0 from State, and the guy you hired had a 3.2 from State-- the only reason you didn&amp;#39;t hire me is because I&amp;#39;m a woman!&amp;quot;  Ok, this is going to sound really, really weird:  yeah.  The part that&amp;#39;s going to really have you scratching your head is why did either of you need college when the job only requires a 9th grade education?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Dove assumes the role of the Master. The teenager in the role of the hysteric demands to know what is wanted from her (this is the structure of the hysteric: to believe and yet doubt the Master has the answer and to make efforts to discover the truth). Dove allows her to cover over the traumatic discovery that there is no and never was a grade to pass, but reassures her into thinking that there is some other Master figure who does know. &lt;em&gt;Life makes sense now.&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;So there is a penetration of the capitalist system into teenage girls&amp;#39; lives but not because of some problem of Ads showing naked bodies or as painting women as objects, but its ability to &lt;em&gt;sustain their desires&lt;/em&gt;. The enjoyment from the horror of  being overwhelmed by the shocking desire of the Other. &lt;a href=\"http://www.cosmopolitan.com/lifestyle/a13888197/the-girls-scouts-hug-article/\"&gt;The fearful and fantastical male&lt;/a&gt;.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "To feed the desire of the young woman to remove the sense of obstacles to her pure enjoyment of life, so that she may hop and skip and jump into adulthood, an entire cottage industry of a corrupted version of the Lacanian concept of the gaze has appeared. Starting with [Laura Mulvey's exceptionally bad](https://en.wikipedia.org/wiki/Laura_Mulvey) misreading of Lacan in her influential essay on the 'male gaze' right until the pop-psychoanalysis found in every magazine and the woman section of every newspaper, a bizarre but highly desirable (for young women) version of reality is given air. \n\n\n**\"\"\"The Male gaze\"\"\"**\n\nIn this fantastical (strictly speaking, this pseudo-Lacanian Mulveyian concept *is itself* a Lacanian fantasy) world view, a stitching together of misandric feminism with the shallow common sense view of women as helpless creatures subjected to forces of society beyond their agency, and men as automaton predators intent on eating the life of women.  \n\nLacan would reject this view as an absurd and wilful rejection of the intersubjective nature of desire, sense of self, and the entry into the adult world of the social order. The desire to displace their own desire onto others. The desire for others to desire them. The desire for society to control this trembling and traumatic force of desire. All these various desires are aided by this fantasy of a simple relation of being the object of man, his look. \n\nIs it not fascinating and revealing that the sources of the sense of being watched are in materials that the young women seek out: their gossip magazines, in drama TV shows, in chick lit. *Why do they not avoid it?* This is, of course, rank hypocrisy. Desire is for the desire of the Other. A life of a teenager is to discover how to obtain the other's attention. *What mask must I wear?* The discovery that there is no Big Other with a consistent view of beauty and with a rulebook on desire is a late discovery, perhaps in the mid-20s. So until then their Mothers must guide them... perhaps with teaching them beauty and makeup techniques. \n\n**We should and must objectify**\n\n[Consider this](http://realitysandwich.com/318605/desire-is-the-truth-of-it-jacques-lacan-and-wanting-wanting/): \n\n&gt; Far from the desexualized stereotype that some critics place on him, Lacan wanted people to experience the true movement and fluidity of their desire.\n&gt; \n&gt; “There is no sexual relationship,” he stated. We don’t ever really encounter each other during sex because there’s so much regulating the interaction, particularly our ideas of sex/gender/man/woman. By the time we get to the bedroom, it’s already too late to meet another human being. “One can no more speak of ‘woman’ than of ‘man’ without …invalidating in advance any conceptualization,” declared French feminist writer Helene Cixous. Lacan might agree and add, “Or speak of any sexual advance either.” In sex, we only meet each other, instead, as “partial objects.” That is, we encounter whatever aspect it is that we can handle. Objectification is not the same as dehumanization. Indeed, for Lacan, it is an intrinsic part of the sexual process. The question that needs to be answered isn’t “How do we not objectify?” but “Why would I want to do anything else?” Desire will lead you to releasing all the false objects of desire that you think will please you. Follow it, and you won’t ever see other people the same way again.\n\nSo we must and should be an object of the Other. Indeed, the only sensible meaning of the male gaze, at least outside of film theory, is something imagined within the girl's mind (she could not possibly know what is going on in the man's mind): *just what are they looking at? how are they considering me? what must I do...?* This is why rape is the ultimate fantasy; it renders as a story a discovery of pure desire. \n\nSo what is objectionable about the fantasy of a male gaze is that it claims some entirely false insight into men and proclaims some mysterious extra power they have that women have no access. So the men are regarded as complete objects, knowing their own desires, who walk in the World at peace with themselves. *Lacan would have laughed.* \n\n**The Master** \n\n[Alone has an insight into the Dove ad](https://thelastpsychiatrist.com/2013/05/dove.html) that sustains the desire:\n\n&gt; The con artists at Dove didn't select these women to represent you because you are beautiful or ugly, any more than the street hustler selected you for your nice smile.   They were selected because they represent a psychological type that transcends age/race/class, it is characterized by a kind of psychological laziness: on the one hand, they don't want to have to conform to society's impossible standards, but on the other hand they don't want the existential terror of NOT conforming to some kind of standard.  They want an objective bar to be changed to fit them-- they want \"some other omnipotent entity\" to change it so that it remains both entirely valid yet still true for them, so that others have to accept it, and if you have no idea what I'm talking about look at your GPA: you know, and I know, that if college graded you based on the actual number of correct answers you generated, no curve, then you would have gotten an R.  Somehow that R became an A.  The question is, why bother?  Why not either make grades rigorous and valid so we know exactly what they mean, or else do away with them entirely?  Because in either case society and your head would implode from the existential vacuum.  Instead, everyone has to get As AND the As have to be \"valid\" so you feel good enough to pay next year's tuition, unfortunately leaving employers with no other choice but to look for other more reliable proxies of learning like race, gender, and physical appearance.  Oh.   Did you assume employers would be more influenced by the fixed grades than their own personal prejudices?   \"Wait a second, I graduated 4.0 from State, and the guy you hired had a 3.2 from State-- the only reason you didn't hire me is because I'm a woman!\"  Ok, this is going to sound really, really weird:  yeah.  The part that's going to really have you scratching your head is why did either of you need college when the job only requires a 9th grade education?\n\nDove assumes the role of the Master. The teenager in the role of the hysteric demands to know what is wanted from her (this is the structure of the hysteric: to believe and yet doubt the Master has the answer and to make efforts to discover the truth). Dove allows her to cover over the traumatic discovery that there is no and never was a grade to pass, but reassures her into thinking that there is some other Master figure who does know. *Life makes sense now.* \n\nSo there is a penetration of the capitalist system into teenage girls' lives but not because of some problem of Ads showing naked bodies or as painting women as objects, but its ability to *sustain their desires*. The enjoyment from the horror of  being overwhelmed by the shocking desire of the Other. [The fearful and fantastical male](http://www.cosmopolitan.com/lifestyle/a13888197/the-girls-scouts-hug-article/).  ", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "7flmob", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "author": "tetsugakusei", "num_crossposts": 1, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 11, "approved_by": null, "over_18": false, "removal_reason": null, "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/h_ZVodSlLw_kNH_U5TXm5fE0AhQxGVE0RFaOkvDO76g.jpg?s=ca2fb2a79f768ed594175033dd44a905", "width": 360, "height": 480}, "resolutions": [{"url": "https://i.redditmedia.com/h_ZVodSlLw_kNH_U5TXm5fE0AhQxGVE0RFaOkvDO76g.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=cb21f02c8ae411ac122e7fd8c4830082", "width": 108, "height": 144}, {"url": "https://i.redditmedia.com/h_ZVodSlLw_kNH_U5TXm5fE0AhQxGVE0RFaOkvDO76g.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=bba5c1620580b7747310a66fe1837d9d", "width": 216, "height": 288}, {"url": "https://i.redditmedia.com/h_ZVodSlLw_kNH_U5TXm5fE0AhQxGVE0RFaOkvDO76g.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=59faee20e372442638f5fe6b2390a8d2", "width": 320, "height": 426}], "variants": {}, "id": "QpJSIwPjtDl8EbXt12YVQNHROosOUHIQvnTCFUqmZMU"}], "enabled": false}, "num_comments": 8, "thumbnail": "self", "hide_score": false, "edited": 1511689066.0, "link_flair_css_class": null, "author_flair_css_class": "developer", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "secure_media_embed": {}, "media_embed": {}, "post_hint": "self", "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": null, "name": "t3_7flmob", "spoiler": false, "permalink": "/r/thelastpsychiatrist/comments/7flmob/female_objectification_and_2_nonsolutions_demand/", "subreddit_type": "public", "whitelist_status": null, "stickied": false, "created": 1511712463.0, "url": "https://www.reddit.com/r/thelastpsychiatrist/comments/7flmob/female_objectification_and_2_nonsolutions_demand/", "author_flair_text": " It will shock you how much it never happened", "quarantine": false, "title": "Female objectification and 2 non-solutions: demand the imaginary other person stop or ask the imaginary Master to do something", "created_utc": 1511683663.0, "subreddit_name_prefixed": "r/thelastpsychiatrist", "distinguished": null, "media": null, "upvote_ratio": 0.83, "mod_reports": [], "is_self": true, "visited": false, "num_reports": null, "is_video": false, "ups": 11}], "created": 1511912417.0, "url": "https://www.reddit.com/r/thelastpsychiatrist/comments/7flmob/female_objectification_and_2_nonsolutions_demand/", "author_flair_text": null, "quarantine": false, "title": "Female objectification and 2 non-solutions: demand the imaginary other person stop or ask the imaginary Master to do something", "created_utc": 1511883617.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.86, "mod_reports": [], "is_self": false, "visited": false, "num_reports": null, "is_video": false, "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7g4z4j", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dqgvrb2", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "InSovietChicago", "can_mod_post": false, "ups": 1, "parent_id": "t3_7g4z4j", "score": 1, "approved_by": null, "downs": 0, "body": "Is this guy horny or something", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is this guy horny or something&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7g4z4j/female_objectification_and_2_nonsolutions_demand/dqgvrb2/", "num_reports": null, "name": "t1_dqgvrb2", "created": 1511926241.0, "author_flair_text": "HI Diddly Ho There Neighbor", "created_utc": 1511897441.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "after": null, "before": null}}]