[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Picture this, October 7th: D-Day.&lt;/p&gt;\n\n&lt;p&gt;McDonalds promises the smooth sticky embrace of the coveted Szechuan sauce, with its origins in essentially being an edible advertisement for 1998&amp;#39;s Mulan to glaze both fat tallow McNuggets and the taste buds of the intellectual aristocrats and prized fans of the ground-breaking TV show, Rick and Morty. As the enlightened children of Harmon piled into McDonalds locations across the United States, it would bring a great disturbance to the loyal and poised fans as few were selected to receive the Mecca of consumerist perfection and many were left in despair.&lt;/p&gt;\n\n&lt;p&gt;The fans were forced to spend $100&amp;#39;s of dollars to get &lt;a href=\"http://www.ebay.com/itm/McDonalds-Rick-Morty-SZECHUAN-Sauce-1oz-Packet-NEW-SEALED-/282687762807?hash=item41d180f177:g:RbsAAOSww%7ExZ26Zv\"&gt;a taste of the scarce nectar,&lt;/a&gt; perhaps just buying &lt;a href=\"http://www.ebay.com/itm/Rick-and-Morty-Szechuan-Sauce-Mcdonalds-Poster-602-1000-Limited-Run-Rare-Framed-/322812968804?hash=item4b2926ff64:g:xDcAAOSwV4BZ2VVK\"&gt;any advertisement of it at all.&lt;/a&gt; The faithful could no longer keep their cool under a betrayal like this, expressing their loathing for the hamburger merchants to their faces and boycotting their products on Twitter, vowing to go to Shoney&amp;#39;s instead. However, this was not enough. The anger was not dying down and retribution was a necessity, the folks needed someone to lead by action and make their plight known and solved. They needed a messiah; but not an Abrahamic one or anything because God&amp;#39;s not real lol.&lt;/p&gt;\n\n&lt;p&gt;Enter: The Szechuan Shooter. No official description on this guy, we&amp;#39;re going by estimates here. Mid 20&amp;#39;s, prematurely balding, 5&amp;#39;8, probably wearing some Marc Ecko graphic clothes and Walmart sneakers, and he probably has a few Arcade Fire tattoos somewhere on that delicate body. He comes equipped with a CZ 75 he was convinced to buy in his last open relationship just in case he wanted to off himself anytime, and a Mosin Nagant he was memed into getting by /k/. He shows up to McDonalds Hamburger University earlier in the day and scouts the hallow corporate walls and souls occupying the place, dead drops a pullstring bag with explosives and leaves for brunch to come back 2 hours later.&lt;/p&gt;\n\n&lt;p&gt;Later that day, bomb goes off, the aspiring wagecucks evacuate, only for the lot of &amp;#39;em to be picked off clean by our boy with a height advantage and the cloak of chaos. Once he makes a path for himself he storms the fort and declares his presence to be known for the unlucky few who chose to hide inside. &amp;quot;I TURNED MYSELF INTO A MARTYR MORTY, I&amp;#39;M SHOOTER RIIIIIICK!&amp;quot; he exclaimed while firing rounds into the ceiling. The students lure the shooter to them by screaming and scuttling around on the ground in reaction and he draws near, seeing their pathetic sniveling faces pleading to him and desolately apologizing for the sauce shortage made him cock a grin and exclaim &amp;quot;EXISTENCE IS MEANINGLESS MORTY, LIFE IS AN ILLUSION! WE&amp;#39;RE ALL GONNA DIE SOMEDAY! COME WATCH TV!&amp;quot; before turning their McMelons into McMush.&lt;/p&gt;\n\n&lt;p&gt;As our renegade continued to storm through the building peeling caps and spouting more nihilism-lite quotes he would make his way to the rooftop where he was confronted with dozens of SWAT snipers on the ground and in buildings adjacent from him. He would walk slowly toward the edge to take all of it in before sighing. &amp;quot;Well, looks like I fuckin&amp;#39; just... I-I screwed this universe big time Morty, g-gotta &lt;strong&gt;burp&lt;/strong&gt; gotta start over fresh.&amp;quot; as he pulled his pistol out and pretended it was a portal gun for a moment. He gave out one final and powerful cry, a swan song to complete his legacy. &amp;quot;WUBBA-LUBBA-DUB-DUB!&amp;quot; he shouted before braining himself.&lt;/p&gt;\n\n&lt;p&gt;Later that day, the police identified him and located his apartment roughly an hour away from the tragedy and they would find quite a sight. Various MENSA society certificates and atheist literature scattered on the floor, Funko Pop figurines obscuring almost an entire wall lined up on various shelves, promotional posters for the show and in anticipation of the sauce, and even gigantic industrial vats of replica Szechuan sauce from Binging With Babish videos. The shooter didn&amp;#39;t leave a traditional manifesto, the police managed to recover at least 3 composition notebooks alongside various weapons and ammunition, but in reality it was over 170 combined pages of Evil Morty theories and R&amp;amp;M tattoo sketches.&lt;/p&gt;\n\n&lt;p&gt;In response to the tragedy, McDonalds promised another run of &amp;lt;20 packets of the sauce per store, its CEO accidentally did a backflip off out of his penthouse apartment, and &lt;a href=\"/r/RickAndMorty\"&gt;/r/RickAndMorty&lt;/a&gt; would be legally recognized as a tax-exempt house of religious worship of the Trinity of Justin Roiland, Dan Harmon, and the Szechuan Shooter. Also God still isn&amp;#39;t real, just gotta rip that band-aid off now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Picture this, October 7th: D-Day.\n\nMcDonalds promises the smooth sticky embrace of the coveted Szechuan sauce, with its origins in essentially being an edible advertisement for 1998's Mulan to glaze both fat tallow McNuggets and the taste buds of the intellectual aristocrats and prized fans of the ground-breaking TV show, Rick and Morty. As the enlightened children of Harmon piled into McDonalds locations across the United States, it would bring a great disturbance to the loyal and poised fans as few were selected to receive the Mecca of consumerist perfection and many were left in despair.\n\nThe fans were forced to spend $100's of dollars to get [a taste of the scarce nectar,](http://www.ebay.com/itm/McDonalds-Rick-Morty-SZECHUAN-Sauce-1oz-Packet-NEW-SEALED-/282687762807?hash=item41d180f177:g:RbsAAOSww~xZ26Zv) perhaps just buying [any advertisement of it at all.](http://www.ebay.com/itm/Rick-and-Morty-Szechuan-Sauce-Mcdonalds-Poster-602-1000-Limited-Run-Rare-Framed-/322812968804?hash=item4b2926ff64:g:xDcAAOSwV4BZ2VVK) The faithful could no longer keep their cool under a betrayal like this, expressing their loathing for the hamburger merchants to their faces and boycotting their products on Twitter, vowing to go to Shoney's instead. However, this was not enough. The anger was not dying down and retribution was a necessity, the folks needed someone to lead by action and make their plight known and solved. They needed a messiah; but not an Abrahamic one or anything because God's not real lol.\n\nEnter: The Szechuan Shooter. No official description on this guy, we're going by estimates here. Mid 20's, prematurely balding, 5'8, probably wearing some Marc Ecko graphic clothes and Walmart sneakers, and he probably has a few Arcade Fire tattoos somewhere on that delicate body. He comes equipped with a CZ 75 he was convinced to buy in his last open relationship just in case he wanted to off himself anytime, and a Mosin Nagant he was memed into getting by /k/. He shows up to McDonalds Hamburger University earlier in the day and scouts the hallow corporate walls and souls occupying the place, dead drops a pullstring bag with explosives and leaves for brunch to come back 2 hours later.\n\nLater that day, bomb goes off, the aspiring wagecucks evacuate, only for the lot of 'em to be picked off clean by our boy with a height advantage and the cloak of chaos. Once he makes a path for himself he storms the fort and declares his presence to be known for the unlucky few who chose to hide inside. \"I TURNED MYSELF INTO A MARTYR MORTY, I'M SHOOTER RIIIIIICK!\" he exclaimed while firing rounds into the ceiling. The students lure the shooter to them by screaming and scuttling around on the ground in reaction and he draws near, seeing their pathetic sniveling faces pleading to him and desolately apologizing for the sauce shortage made him cock a grin and exclaim \"EXISTENCE IS MEANINGLESS MORTY, LIFE IS AN ILLUSION! WE'RE ALL GONNA DIE SOMEDAY! COME WATCH TV!\" before turning their McMelons into McMush.\n\nAs our renegade continued to storm through the building peeling caps and spouting more nihilism-lite quotes he would make his way to the rooftop where he was confronted with dozens of SWAT snipers on the ground and in buildings adjacent from him. He would walk slowly toward the edge to take all of it in before sighing. \"Well, looks like I fuckin' just... I-I screwed this universe big time Morty, g-gotta **burp** gotta start over fresh.\" as he pulled his pistol out and pretended it was a portal gun for a moment. He gave out one final and powerful cry, a swan song to complete his legacy. \"WUBBA-LUBBA-DUB-DUB!\" he shouted before braining himself.\n\nLater that day, the police identified him and located his apartment roughly an hour away from the tragedy and they would find quite a sight. Various MENSA society certificates and atheist literature scattered on the floor, Funko Pop figurines obscuring almost an entire wall lined up on various shelves, promotional posters for the show and in anticipation of the sauce, and even gigantic industrial vats of replica Szechuan sauce from Binging With Babish videos. The shooter didn't leave a traditional manifesto, the police managed to recover at least 3 composition notebooks alongside various weapons and ammunition, but in reality it was over 170 combined pages of Evil Morty theories and R&amp;M tattoo sketches.\n\nIn response to the tragedy, McDonalds promised another run of &lt;20 packets of the sauce per store, its CEO accidentally did a backflip off out of his penthouse apartment, and /r/RickAndMorty would be legally recognized as a tax-exempt house of religious worship of the Trinity of Justin Roiland, Dan Harmon, and the Szechuan Shooter. Also God still isn't real, just gotta rip that band-aid off now.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "75b8az", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "My Paddock-sona: The Szechuan Shooter", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 23, "approved_by": null, "over_18": false, "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/bxew94yu0E_1jpe0o4Zmy60DNDEXeCAQmonWInUSJbg.jpg?s=ab1d29a4e8b93c11482b403c05d516f4", "width": 791, "height": 1000}, "resolutions": [{"url": "https://i.redditmedia.com/bxew94yu0E_1jpe0o4Zmy60DNDEXeCAQmonWInUSJbg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=b0e97073c76ca98bd4617aecca137486", "width": 108, "height": 136}, {"url": "https://i.redditmedia.com/bxew94yu0E_1jpe0o4Zmy60DNDEXeCAQmonWInUSJbg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=1201abadb84f496d2f12ae644824441b", "width": 216, "height": 273}, {"url": "https://i.redditmedia.com/bxew94yu0E_1jpe0o4Zmy60DNDEXeCAQmonWInUSJbg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=4adb9cc9aeb8577c68819ae2bdfae894", "width": 320, "height": 404}, {"url": "https://i.redditmedia.com/bxew94yu0E_1jpe0o4Zmy60DNDEXeCAQmonWInUSJbg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=614daa865b6db8bb8d86e53a841550f0", "width": 640, "height": 809}], "variants": {}, "id": "26xWlRu0QHgsXjC1oePPyDS5UuFKxfbLaDc6vHZxekk"}], "enabled": false}, "num_comments": 0, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "post_hint": "self", "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_75b8az", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/75b8az/my_paddocksona_the_szechuan_shooter/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1507603741.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/75b8az/my_paddocksona_the_szechuan_shooter/", "author_flair_text": "Murdoch Murdoch is the Rick &amp; Morty of the Alt-Right", "quarantine": false, "author": "alleymen", "created_utc": 1507574941.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.88, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 23}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [], "after": null, "before": null}}]