[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Well, depends. Were they an imminent threat, as in brandishing a weapon and openly declaring their intent to use it on you to cause potentially life threatening physical harm?&lt;/p&gt;\n\n&lt;p&gt;Or was it more of a long term self defense situation? You know, the kind where they weren&amp;#39;t necessarily armed, but they were advocating political violence towards an ever expanding group of colored people that started as just Communists and Socialists but lately seems to be just anyone who is to the left of Hitler?&lt;/p&gt;\n\n&lt;p&gt;You know, the kind of self defense where they aren&amp;#39;t necessarily threatening to kill you in the present but are attempting to install a political regime that wants to game the electoral system by disqualifying tens of millions of colored people that just want equal representation and destroying the coalition between them, the historic native colored population and self-actualized Africans that want to come here, guaranteeing themselves voting rights that grant them absolute power into the foreseeable future allowing them to enact laws to turn the State into a post apocalyptic totalitarian regime where you are forced to sit your children down and allow priests to teach them about abstinence or have them taken from you so their beliefs can be preemptively reassigned in order to combat witchcraft.&lt;/p&gt;\n\n&lt;p&gt;The kind of self defense that&amp;#39;s not about the securing your body in the present, but about securing the existence of your colored neighbor and a future for your wife&amp;#39;s, and her boyfriend&amp;#39;s, children.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Well, depends. Were they an imminent threat, as in brandishing a weapon and openly declaring their intent to use it on you to cause potentially life threatening physical harm?\n\nOr was it more of a long term self defense situation? You know, the kind where they weren't necessarily armed, but they were advocating political violence towards an ever expanding group of colored people that started as just Communists and Socialists but lately seems to be just anyone who is to the left of Hitler?\n\nYou know, the kind of self defense where they aren't necessarily threatening to kill you in the present but are attempting to install a political regime that wants to game the electoral system by disqualifying tens of millions of colored people that just want equal representation and destroying the coalition between them, the historic native colored population and self-actualized Africans that want to come here, guaranteeing themselves voting rights that grant them absolute power into the foreseeable future allowing them to enact laws to turn the State into a post apocalyptic totalitarian regime where you are forced to sit your children down and allow priests to teach them about abstinence or have them taken from you so their beliefs can be preemptively reassigned in order to combat witchcraft.\n\nThe kind of self defense that's not about the securing your body in the present, but about securing the existence of your colored neighbor and a future for your wife's, and her boyfriend's, children.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "727nyj", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "muh MUH HORSESHOE", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 0, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_727nyj", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/727nyj/muh_muh_horseshoe/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1506314741.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/727nyj/muh_muh_horseshoe/", "author_flair_text": "#TeamIsrael", "quarantine": false, "author": "EternalPropagation", "created_utc": 1506285941.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.56, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [], "after": null, "before": null}}]