[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "subreddit_id": "t5_2vsta", "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The oft-repeated Jewish claim that anti-semitism is simply an irrational hatred of Jews based solely on their Jewishness seems a pretty wild accusation on the face of it, and one that can’t be logically and reasonably defended without indicting all Gentiles on charges of insane and unjustifiable hatefulness.&lt;/p&gt;\n\n&lt;p&gt;What possible reason could there be for people to hold such an irrational and preposterous hatred for people of a particular group, especially if that group had never done anything to earn their ire? \nTo reasonable people these claims would appear to have very little merit, unless you want to make a case for Gentiles being hateful lunatics hell-bent on displaying enmity towards the poor, innocent little Jew.&lt;/p&gt;\n\n&lt;p&gt;This concept flies in the face of all reason and logic. What purpose would Gentiles have for hating Jewish people only because they are Jews? It makes absolutely no sense. And yet, despite the sheer and utter lunacy of the claim, it is made frequently, with Gentiles usually assumed to be the guilty party.&lt;/p&gt;\n\n&lt;p&gt;Over the years, historians have made several attempts to explain so-called anti-semitism by claiming it was due to Jewish economic success or due to their complicity in the death of Jesus Christ. &lt;/p&gt;\n\n&lt;p&gt;Some believe it is because of their “chosenness” and many other reasons. Personally, I believe that these aren’t reasons at all, but excuses that those of the Jewish persuasion come up with to keep people from figuring out exactly what “anti-semitism” really is.&lt;/p&gt;\n\n&lt;p&gt;And what is it, exactly?&lt;/p&gt;\n\n&lt;p&gt;Although this may earn me a few more enemies, I have to be honest and say what I know to be true.&lt;/p&gt;\n\n&lt;p&gt;Anti-semitism is not an irrational hatred of Jews by Gentiles. It’s a rational and reasonable response to Jewish supremacist behaviour in their host countries.&lt;/p&gt;\n\n&lt;p&gt;Is it so hard to believe that when you behave in destructive ways you are going to earn the enmity of the people you live among? Jews have been expelled from over 79 countries over a period of about 1,700 years, according to historians.\nDoes it make any sense that they would be expelled for no other reason than their Jewish ness, or does it seem likely that some of the responsibility for the expulsions should be placed squarely on their shoulders?&lt;/p&gt;\n\n&lt;p&gt;If you move into a new neighbourhood and your new neighbours take an intense disliking to you, it might be that you have moved into an area where the people are not very friendly. However, if you have moved 80 times or more over the period of a lifetime and always incur the hostility of your neighbours, I think it would be safe to assume that the problem rests with you.&lt;/p&gt;\n\n&lt;p&gt;Another example might be a man arrested, tried and convicted of a crime which he swears he didn’t commit.\nIt might be that a person could be wrongly convicted, no criminal justice system is perfect. However, is it likely that you will believe that a man has been convicted 79 times and that he’s innocent in every single case? Of course not. It defies all logic and reason.&lt;/p&gt;\n\n&lt;p&gt;Therefore, why would it be reasonable to assume that Jewish persecution in 79 or more countries over a period of close to 2000 years was the fault of the host country and not due to anything the Jews may have done? &lt;/p&gt;\n\n&lt;p&gt;It is an almost laughable concept and one no rational person would accept it.&lt;/p&gt;\n\n&lt;p&gt;Over the years, in every society, Jews have behaved in essentially the same way. They seek to degrade the culture, they engage in less than honest business practices, including usury, they push for social engineering by way of radical movements, they gain control of the majority of the wealth and they have an almost complete monopoly on the media and the dissemination of news.&lt;/p&gt;\n\n&lt;p&gt;That’s the only way they’ve been able to get away with it for so long. They control what we see, hear and read. No wonder they’ve been able to shield themselves for so long in our society, always operating under the radar, but as usual, they are once again overplaying their hand until there is a backlash against them, giving them another opportunity to claim perpetual victimhood status and blame Gentiles for their predicament.&lt;/p&gt;\n\n&lt;p&gt;Isn’t the very definition of insanity to do the same thing over and over again and expect a different result? Obviously they don’t pay attention to history and seek to amend their behaviour, or they would stop doing what they’re doing to prevent further “persecution.” However, it seems likely that they are simply incapable of changing their behaviour and so, like it is wont to do, history repeats itself and the Jews end up winning the enmity of the non-Jewish population.&lt;/p&gt;\n\n&lt;p&gt;Today in America is no different. Once again they control the majority of wealth in this country and they have a monopoly on the media and the dissemination of news. They attempt to degrade our culture with their disproportionate representation in the pornography industry, their defilement of art and literature, their perverse celebration of deviancy, violence, graphic sex and foul language on television and in the movies we pay to see.&lt;/p&gt;\n\n&lt;p&gt;They seek to destroy traditional marriage and the nuclear family by way of the radical homosexual movement and the feminist movement and propagandize and brainwash us to accept them both.&lt;/p&gt;\n\n&lt;p&gt;They are committed to attempting genocide against those of us who are of white European descent through wide open immigration laws, encouraging an influx of third worlders while actively discouraging immigrants from Europe, as well as the encouragement of racial integration and miscegenation. They push multiculturalism and diversity on us, brainwashing us all into believing both of those things are good for us, then they try to deplete our numbers through the advocacy of birth control, abortion and euthanasia.&lt;/p&gt;\n\n&lt;p&gt;They use their control of the media to mock and defame the majority religion in this country and have worked tirelessly to have it removed from our schools and from the public square. They deliberately dumb down our educational system in order to create a generation of functional illiterates who will be too stupid and too malleable to fight against those who seek to destroy them.&lt;/p&gt;\n\n&lt;p&gt;They use the “Holocaust” to engender a collective guilt in us and to manipulate us into not recognizing or ignoring their nefarious machinations.&lt;/p&gt;\n\n&lt;p&gt;And for those of us smart enough to recognize it, they advocate for hate crime legislation that has very little to do with actual hate crimes per se, but are merely an effective way to silence their critics, under penalty of legal prosecution.&lt;/p&gt;\n\n&lt;p&gt;They commit “false flag” operations in order to convince a trusting and gullible population that it’s in their best interests to go to war in the middle east, not to fight for the best interests of America and its people, but for the best interests of Jews and Israel. They control our congress and our president and they will bring down the American empire by way of endless war, the exact same thing that caused the sun to eventually set on the British Empire.&lt;/p&gt;\n\n&lt;p&gt;As we speak, young American men and women are dying overseas in a war for Israel. The treasonous Neo-Cons in the Bush administration have conspired with the Israeli lobby to entangle America in a war that can’t be won and has no benefit for the USA or her citizens.&lt;/p&gt;\n\n&lt;p&gt;Despite their desperate attempts to hide the true rationale for the war from the American people, and their collusion in covering up another “false flag” operation that served as a catalyst for the current middle east conflict, they have not succeeded, and more and more citizens are speaking out against the travesty in Iraq and their fervent hope that there will be no war with Iran.&lt;/p&gt;\n\n&lt;p&gt;Is it reasonable to expect that the people who know what’s happening, and are quite aware of who is responsible for it, will keep silent and not alert the rest of the people in an attempt to warn them of the eventual outcome if the Jewish supremacist agenda is realized?&lt;/p&gt;\n\n&lt;p&gt;Does it make sense that rational people who understand what’s going on and know which group is behind it would remain kindly disposed towards their enemy?&lt;/p&gt;\n\n&lt;p&gt;Of course not. If Jews feel put upon and discriminated against and hated, perhaps they should at least be honest enough to stop blaming it on unreasonable and irrational hatred on the part of Gentiles and instead, examine Jewish behaviour throughout history to see a long line of nefarious, underhanded and contemptuous behaviour that would explain and excuse the animus directed their way.&lt;/p&gt;\n\n&lt;p&gt;What did they expect to happen in Germany prior to the war, when the German people, who were still struggling to survive under the extremely punitive terms of the Treaty of Versailles, were dealt another blow when the Jews declared economic war against Germany, causing her collapse and forcing even greater hardship on the citizens who lost everything they had, only to see it snatched up by Jews who acquired it at a mere fraction of its former value?&lt;/p&gt;\n\n&lt;p&gt;Does anti-semitism seem a legitimate response to the horror that was perpetrated on the people of the former Soviet Union in the name of Communism? It seems a perfectly justifiable response to hate the Jews with every fibre of your being when you have been deprived of the fruits of your labour, intentionally starved and sent to Gulags to face impossible odds against long term survival.&lt;/p&gt;\n\n&lt;p&gt;How could the Russian people not hold great anger and hostility towards the people who inflicted this horror on them? And unlike the Jewish suffering in the “Holocaust,” there are not a host of centres and museums devoted to their suffering, nor are there a myriad of books, television programs or movies. Their suffering has never been truly acknowledged and no remorse expressed by the people responsible for it.&lt;/p&gt;\n\n&lt;p&gt;I shudder to think of the backlash and anger directed at Jewish supremacists when the true extent of their duplicity and treachery is exposed for all to see.&lt;/p&gt;\n\n&lt;p&gt;And if it is, will there be the usual cries of anti-semitism directed at those who wish seek to hold them responsible? Since that is the case almost every time they are criticised for their trickery and disloyalty, I will predict that the answer is a definite yes.&lt;/p&gt;\n\n&lt;p&gt;Jews have, throughout history, behaved in ways that are damaging to their host countries and due to that, it would seem perfectly reasonable for many people to hold some animosity towards the Jewish community, especially in light of the human misery the Zionists among them have caused and continue to cause.&lt;/p&gt;\n\n&lt;p&gt;Anti-semitism doesn’t exist, in reality, at least not in the way they claim. No one hates Jews simply because they are Jewish any more than people hate the black race simply because of the hue of their skin. They are hated by many because their behaviour, both past and present, has been egregious, heinous and has usually entailed a large degree of callous disregard towards human suffering.&lt;/p&gt;\n\n&lt;p&gt;If Jews are hated, it’s because they have laboured long and hard to earn that hate.&lt;/p&gt;\n\n&lt;p&gt;Jews need to stop laying the blame for their perceived persecution at the foot of the Gentile and be honest enough to admit that they behaved in ways that created less than charitable feelings towards them by the citizens of their host countries. It’s a sane and healthy reaction to hate those who hurt you and seek to destroy you.&lt;/p&gt;\n\n&lt;p&gt;It seems ironic to me that Jews would constantly make claims of anti-semitism against their detractors, when there is ample and easily obtained empirical evidence of their Talmud-inspired hatred of Gentiles and Christians, and yet they are never called on the carpet to answer to the charges of anti-Gentilism. Why is it always assumed that the hatred flows one way, and that only one group is ever completely guilty while the other is only ever completely innocent?&lt;/p&gt;\n\n&lt;p&gt;Invoking their past suffering is no longer going to work, especially as their lies, exaggerations and complete fabrications with regard to the Holocaust become widely known. Eventually, they will push Gentiles too far by overplaying their hand yet again, and when that happens, and the response is to expel them, or worse, they will, of course, fall back on their standard excuse for everything, their suffering and victimhood at the hands of Gentiles.&lt;/p&gt;\n\n&lt;p&gt;But no one will buy it this time.&lt;/p&gt;\n\n&lt;p&gt;The Jews themselves have removed all meaning from being called an anti-semite. It has been so overused that it no longer creates the sting it used to when it’s hurled in your direction, because now you really understand it. It’s not about actual hatred aimed at Jews for no reason, it’s simply a smear tactic to silence those who expose them for what they are.&lt;/p&gt;\n\n&lt;p&gt;They will continue to fling it at their detractors in an attempt to muzzle them, because they can’t allow their duplicity and treachery to be exposed for all to see.&lt;/p&gt;\n\n&lt;p&gt;So if someone wants to label me an anti-semite because I see what’s going on and will not be silent about it, they can go ahead and hurl whatever invective they wish to throw in my direction. If exposing Jewish supremacist perfidy for the evil that it is makes me an anti-semite, then I will embrace it.&lt;/p&gt;\n\n&lt;p&gt;I will continue to work tirelessly to expose their anti-Gentilism and hatred towards non-Jews and rest easily in the knowledge that I have done my best to expose the greatest threat we face as a people.&lt;/p&gt;\n\n&lt;p&gt;It’s not Islamic terrorists we need to fear, despite the hysterical fear-mongering.&lt;/p&gt;\n\n&lt;p&gt;Jewish supremacy is the enemy.&lt;/p&gt;\n\n&lt;p&gt;It always has been.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The oft-repeated Jewish claim that anti-semitism is simply an irrational hatred of Jews based solely on their Jewishness seems a pretty wild accusation on the face of it, and one that can’t be logically and reasonably defended without indicting all Gentiles on charges of insane and unjustifiable hatefulness.\n\n\n\nWhat possible reason could there be for people to hold such an irrational and preposterous hatred for people of a particular group, especially if that group had never done anything to earn their ire? \nTo reasonable people these claims would appear to have very little merit, unless you want to make a case for Gentiles being hateful lunatics hell-bent on displaying enmity towards the poor, innocent little Jew.\n\nThis concept flies in the face of all reason and logic. What purpose would Gentiles have for hating Jewish people only because they are Jews? It makes absolutely no sense. And yet, despite the sheer and utter lunacy of the claim, it is made frequently, with Gentiles usually assumed to be the guilty party.\n\nOver the years, historians have made several attempts to explain so-called anti-semitism by claiming it was due to Jewish economic success or due to their complicity in the death of Jesus Christ. \n\nSome believe it is because of their “chosenness” and many other reasons. Personally, I believe that these aren’t reasons at all, but excuses that those of the Jewish persuasion come up with to keep people from figuring out exactly what “anti-semitism” really is.\n\nAnd what is it, exactly?\n\nAlthough this may earn me a few more enemies, I have to be honest and say what I know to be true.\n\nAnti-semitism is not an irrational hatred of Jews by Gentiles. It’s a rational and reasonable response to Jewish supremacist behaviour in their host countries.\n\nIs it so hard to believe that when you behave in destructive ways you are going to earn the enmity of the people you live among? Jews have been expelled from over 79 countries over a period of about 1,700 years, according to historians.\nDoes it make any sense that they would be expelled for no other reason than their Jewish ness, or does it seem likely that some of the responsibility for the expulsions should be placed squarely on their shoulders?\n\nIf you move into a new neighbourhood and your new neighbours take an intense disliking to you, it might be that you have moved into an area where the people are not very friendly. However, if you have moved 80 times or more over the period of a lifetime and always incur the hostility of your neighbours, I think it would be safe to assume that the problem rests with you.\n\nAnother example might be a man arrested, tried and convicted of a crime which he swears he didn’t commit.\nIt might be that a person could be wrongly convicted, no criminal justice system is perfect. However, is it likely that you will believe that a man has been convicted 79 times and that he’s innocent in every single case? Of course not. It defies all logic and reason.\n\nTherefore, why would it be reasonable to assume that Jewish persecution in 79 or more countries over a period of close to 2000 years was the fault of the host country and not due to anything the Jews may have done? \n\nIt is an almost laughable concept and one no rational person would accept it.\n\nOver the years, in every society, Jews have behaved in essentially the same way. They seek to degrade the culture, they engage in less than honest business practices, including usury, they push for social engineering by way of radical movements, they gain control of the majority of the wealth and they have an almost complete monopoly on the media and the dissemination of news.\n\nThat’s the only way they’ve been able to get away with it for so long. They control what we see, hear and read. No wonder they’ve been able to shield themselves for so long in our society, always operating under the radar, but as usual, they are once again overplaying their hand until there is a backlash against them, giving them another opportunity to claim perpetual victimhood status and blame Gentiles for their predicament.\n\nIsn’t the very definition of insanity to do the same thing over and over again and expect a different result? Obviously they don’t pay attention to history and seek to amend their behaviour, or they would stop doing what they’re doing to prevent further “persecution.” However, it seems likely that they are simply incapable of changing their behaviour and so, like it is wont to do, history repeats itself and the Jews end up winning the enmity of the non-Jewish population.\n\nToday in America is no different. Once again they control the majority of wealth in this country and they have a monopoly on the media and the dissemination of news. They attempt to degrade our culture with their disproportionate representation in the pornography industry, their defilement of art and literature, their perverse celebration of deviancy, violence, graphic sex and foul language on television and in the movies we pay to see.\n\nThey seek to destroy traditional marriage and the nuclear family by way of the radical homosexual movement and the feminist movement and propagandize and brainwash us to accept them both.\n\nThey are committed to attempting genocide against those of us who are of white European descent through wide open immigration laws, encouraging an influx of third worlders while actively discouraging immigrants from Europe, as well as the encouragement of racial integration and miscegenation. They push multiculturalism and diversity on us, brainwashing us all into believing both of those things are good for us, then they try to deplete our numbers through the advocacy of birth control, abortion and euthanasia.\n\nThey use their control of the media to mock and defame the majority religion in this country and have worked tirelessly to have it removed from our schools and from the public square. They deliberately dumb down our educational system in order to create a generation of functional illiterates who will be too stupid and too malleable to fight against those who seek to destroy them.\n\nThey use the “Holocaust” to engender a collective guilt in us and to manipulate us into not recognizing or ignoring their nefarious machinations.\n\nAnd for those of us smart enough to recognize it, they advocate for hate crime legislation that has very little to do with actual hate crimes per se, but are merely an effective way to silence their critics, under penalty of legal prosecution.\n\nThey commit “false flag” operations in order to convince a trusting and gullible population that it’s in their best interests to go to war in the middle east, not to fight for the best interests of America and its people, but for the best interests of Jews and Israel. They control our congress and our president and they will bring down the American empire by way of endless war, the exact same thing that caused the sun to eventually set on the British Empire.\n\nAs we speak, young American men and women are dying overseas in a war for Israel. The treasonous Neo-Cons in the Bush administration have conspired with the Israeli lobby to entangle America in a war that can’t be won and has no benefit for the USA or her citizens.\n\nDespite their desperate attempts to hide the true rationale for the war from the American people, and their collusion in covering up another “false flag” operation that served as a catalyst for the current middle east conflict, they have not succeeded, and more and more citizens are speaking out against the travesty in Iraq and their fervent hope that there will be no war with Iran.\n\nIs it reasonable to expect that the people who know what’s happening, and are quite aware of who is responsible for it, will keep silent and not alert the rest of the people in an attempt to warn them of the eventual outcome if the Jewish supremacist agenda is realized?\n\nDoes it make sense that rational people who understand what’s going on and know which group is behind it would remain kindly disposed towards their enemy?\n\nOf course not. If Jews feel put upon and discriminated against and hated, perhaps they should at least be honest enough to stop blaming it on unreasonable and irrational hatred on the part of Gentiles and instead, examine Jewish behaviour throughout history to see a long line of nefarious, underhanded and contemptuous behaviour that would explain and excuse the animus directed their way.\n\nWhat did they expect to happen in Germany prior to the war, when the German people, who were still struggling to survive under the extremely punitive terms of the Treaty of Versailles, were dealt another blow when the Jews declared economic war against Germany, causing her collapse and forcing even greater hardship on the citizens who lost everything they had, only to see it snatched up by Jews who acquired it at a mere fraction of its former value?\n\nDoes anti-semitism seem a legitimate response to the horror that was perpetrated on the people of the former Soviet Union in the name of Communism? It seems a perfectly justifiable response to hate the Jews with every fibre of your being when you have been deprived of the fruits of your labour, intentionally starved and sent to Gulags to face impossible odds against long term survival.\n\nHow could the Russian people not hold great anger and hostility towards the people who inflicted this horror on them? And unlike the Jewish suffering in the “Holocaust,” there are not a host of centres and museums devoted to their suffering, nor are there a myriad of books, television programs or movies. Their suffering has never been truly acknowledged and no remorse expressed by the people responsible for it.\n\nI shudder to think of the backlash and anger directed at Jewish supremacists when the true extent of their duplicity and treachery is exposed for all to see.\n\nAnd if it is, will there be the usual cries of anti-semitism directed at those who wish seek to hold them responsible? Since that is the case almost every time they are criticised for their trickery and disloyalty, I will predict that the answer is a definite yes.\n\nJews have, throughout history, behaved in ways that are damaging to their host countries and due to that, it would seem perfectly reasonable for many people to hold some animosity towards the Jewish community, especially in light of the human misery the Zionists among them have caused and continue to cause.\n\nAnti-semitism doesn’t exist, in reality, at least not in the way they claim. No one hates Jews simply because they are Jewish any more than people hate the black race simply because of the hue of their skin. They are hated by many because their behaviour, both past and present, has been egregious, heinous and has usually entailed a large degree of callous disregard towards human suffering.\n\nIf Jews are hated, it’s because they have laboured long and hard to earn that hate.\n\nJews need to stop laying the blame for their perceived persecution at the foot of the Gentile and be honest enough to admit that they behaved in ways that created less than charitable feelings towards them by the citizens of their host countries. It’s a sane and healthy reaction to hate those who hurt you and seek to destroy you.\n\nIt seems ironic to me that Jews would constantly make claims of anti-semitism against their detractors, when there is ample and easily obtained empirical evidence of their Talmud-inspired hatred of Gentiles and Christians, and yet they are never called on the carpet to answer to the charges of anti-Gentilism. Why is it always assumed that the hatred flows one way, and that only one group is ever completely guilty while the other is only ever completely innocent?\n\nInvoking their past suffering is no longer going to work, especially as their lies, exaggerations and complete fabrications with regard to the Holocaust become widely known. Eventually, they will push Gentiles too far by overplaying their hand yet again, and when that happens, and the response is to expel them, or worse, they will, of course, fall back on their standard excuse for everything, their suffering and victimhood at the hands of Gentiles.\n\nBut no one will buy it this time.\n\nThe Jews themselves have removed all meaning from being called an anti-semite. It has been so overused that it no longer creates the sting it used to when it’s hurled in your direction, because now you really understand it. It’s not about actual hatred aimed at Jews for no reason, it’s simply a smear tactic to silence those who expose them for what they are.\n\nThey will continue to fling it at their detractors in an attempt to muzzle them, because they can’t allow their duplicity and treachery to be exposed for all to see.\n\nSo if someone wants to label me an anti-semite because I see what’s going on and will not be silent about it, they can go ahead and hurl whatever invective they wish to throw in my direction. If exposing Jewish supremacist perfidy for the evil that it is makes me an anti-semite, then I will embrace it.\n\nI will continue to work tirelessly to expose their anti-Gentilism and hatred towards non-Jews and rest easily in the knowledge that I have done my best to expose the greatest threat we face as a people.\n\nIt’s not Islamic terrorists we need to fear, despite the hysterical fear-mongering.\n\nJewish supremacy is the enemy.\n\nIt always has been.", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "7if4km", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "author": "jenniferlovehugetits", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 4, "approved_by": null, "over_18": false, "removal_reason": null, "hidden": false, "num_comments": 1, "thumbnail": "self", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "media_embed": {}, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_7if4km", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/7if4km/jayne_gardner_explains_antisemitism/", "subreddit_type": "public", "whitelist_status": "all_ads", "stickied": false, "created": 1512770478.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/7if4km/jayne_gardner_explains_antisemitism/", "author_flair_text": null, "quarantine": false, "title": "Jayne Gardner explains anti-semitism", "created_utc": 1512741678.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.75, "mod_reports": [], "is_self": true, "visited": false, "num_reports": null, "is_video": false, "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [], "after": null, "before": null}}]