[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "subreddit_id": "t5_2vsta", "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Traitor,&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve really cashed in, haven&amp;#39;t you? I know you won&amp;#39;t be, but you really should be ashamed of yourself. I hope that you know that you are 100 times worse than the jews you&amp;#39;ve surrounded yourself with. You couldn&amp;#39;t handle the mental stress that comes along with white nationalism, so you took the easy way out. But what is so disgusting about you is that rather than just leave you dcided to devote your time to undermining your own race. Now you are traveling around Eastern Europe looking for a white racial awareness wherever you can find it, because you know there is no racism from whites for you to fight here. I can only imagine the mental hoops you have to jump through, the cognitive dissonance that you must emply on a daily basis.&lt;/p&gt;\n\n&lt;p&gt;If your book is meant to be an argument against racism or &amp;quot;hate,&amp;quot; you&amp;#39;ve failed. But that&amp;#39;s not your failt because no logical arguments exist and none of them hold up to even a small amount of critical thinking. But I&amp;#39;m sure you haven&amp;#39;t been doing too much of that lately. Do you realize that the only argument you have, the only point you make, is that it is wrong to go around with so much hate in your heart? And do you realize that this is based soley on emotion, not facts? I mean really what is the point of your book? If we took out the last few chapters, it would actually make the case for white nationalism, not against it. I won&amp;#39;t even go into your allegedly blaming yourself for your brother&amp;#39;s death or your comments on the leftist protestors, which are so ridiculous that I literally guffawed.&lt;/p&gt;\n\n&lt;p&gt;One of the unforgivable sins is to know the truth and then deny it. I&amp;#39;m unable to understand how you are able to live with yourself. Have fun beating a dead horse.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;𝓓𝔂𝓵𝓪𝓷&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Traitor,\n\nYou've really cashed in, haven't you? I know you won't be, but you really should be ashamed of yourself. I hope that you know that you are 100 times worse than the jews you've surrounded yourself with. You couldn't handle the mental stress that comes along with white nationalism, so you took the easy way out. But what is so disgusting about you is that rather than just leave you dcided to devote your time to undermining your own race. Now you are traveling around Eastern Europe looking for a white racial awareness wherever you can find it, because you know there is no racism from whites for you to fight here. I can only imagine the mental hoops you have to jump through, the cognitive dissonance that you must emply on a daily basis.\n\nIf your book is meant to be an argument against racism or \"hate,\" you've failed. But that's not your failt because no logical arguments exist and none of them hold up to even a small amount of critical thinking. But I'm sure you haven't been doing too much of that lately. Do you realize that the only argument you have, the only point you make, is that it is wrong to go around with so much hate in your heart? And do you realize that this is based soley on emotion, not facts? I mean really what is the point of your book? If we took out the last few chapters, it would actually make the case for white nationalism, not against it. I won't even go into your allegedly blaming yourself for your brother's death or your comments on the leftist protestors, which are so ridiculous that I literally guffawed.\n\nOne of the unforgivable sins is to know the truth and then deny it. I'm unable to understand how you are able to live with yourself. Have fun beating a dead horse.\n\n_𝓓𝔂𝓵𝓪𝓷_", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "7k48wv", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "author": "TimeYouNeverGetBack", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 4, "approved_by": null, "over_18": false, "removal_reason": null, "hidden": false, "num_comments": 0, "thumbnail": "self", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "media_embed": {}, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_7k48wv", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/7k48wv/mde_book_review_of_the_month/", "subreddit_type": "public", "whitelist_status": "all_ads", "stickied": false, "created": 1513417356.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/7k48wv/mde_book_review_of_the_month/", "author_flair_text": "God's Lonely Post-O∞1 Cyber-CHUD in a Snekskin Jacket", "quarantine": false, "title": "MDE book review of the month", "created_utc": 1513388556.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.7, "mod_reports": [], "is_self": true, "visited": false, "num_reports": null, "is_video": false, "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [], "after": null, "before": null}}]