[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;reposted, automod took it down because I linked a previous milliondollarextreme thread.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m 15, and my GPA has turned from 3.6+ to a 2.4. I got two awards in the past for earning the highest score on standardized testing, and I am officially &amp;quot;excelling,&amp;quot; in Science, Math, and English. I used to take IQ tests for kicks starting at 11 and always ended up 113-128. Now, some of this is how my Algebra II teacher grades assignments (currently 50% with him)*** but it feels like exactly like what another user posted a few days ago.&lt;/p&gt;\n\n&lt;p&gt;***To quote him: No extra credit. Until now, because over half of his kids have Ds or below and (((they))) are wondering why.&lt;/p&gt;\n\n&lt;p&gt;My diet is very carb and meat heavy. Dairy is minimal (breakfast); vegetables and fruit are scarce (dinner). My lunch is very small or just non-existent. During school I take a few bags of county-lunch bags and most of the times eat everything in there. There&amp;#39;s literally only 2 food items, a big item and a small item (banana/honeydew, chips/pineapple cup, you get it).&lt;/p&gt;\n\n&lt;p&gt;Exercise has been very little over the past 2 years. After 8th grade the only PE you get is by yourself or 2 hours per week during school hours. Before that it was an hour everyday. My latest mile time (3 laps around the campus) was 7:38. I&amp;#39;ve started to adopt an easy method of doing pushups or lifting my airsoft rifle (10 lbs. loaded) when I&amp;#39;m bored.&lt;/p&gt;\n\n&lt;p&gt;My sleep schedule I think has the most trouble. I usually stay up until 2300-0100 because that&amp;#39;s the only time I feel completely comfortable in the house, literally no one to bother me and it&amp;#39;s all quiet-like. Unfortunately, I wake up for school 0600-0630. Classes start at 8. On the weekends I stay up until I go to sleep on principle or until I&amp;#39;m tired, and it&amp;#39;s normally 9 hours of sleep, then 1-2 hours of just staying in bed.&lt;/p&gt;\n\n&lt;p&gt;My hobbies consist of airsoft. I&amp;#39;m getting better and better with the barrels/backspin aspect of the replicas, I just recently made my own modifications and made it work. I do play video games but I really don&amp;#39;t like calling that a &amp;quot;hobby.&amp;quot; Sitting in front of a screen yelling at your friends for an artificial competition isn&amp;#39;t that much of a hobby. Lately I&amp;#39;ve been getting into more strategical games like Wargame: Red Dragon and solo games such as STALKER.&lt;/p&gt;\n\n&lt;p&gt;So is there any good out of this?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m more sociable, that&amp;#39;s about it. For some reason the suicidal kid in our group at school has been talking to me more. I&amp;#39;ve been turned down by one girl this year, but I&amp;#39;m planning on asking out this little freshman to the dance in October, she hangs out with the most chickenshit betas I&amp;#39;ve ever seen in my life, figure I can take her in.&lt;/p&gt;\n\n&lt;p&gt;[went back to this thread](automod is gay) and some are saying to find something I like and integrate it back in. For years I played loads of GTA, Fallout, and &amp;quot;basic&amp;quot; shooters such as Team Fortress and modded Call Of Duty. However, I don&amp;#39;t want to go back to those days of draining myself. Nowadays I browse /k/, airsoft, weekendgunnit, YouTube gun channels, and Hitman speedruns; occasionally playing video games with my friends. My mother also keeps pushing me to do work with relatives/friends after I said I wanted to get into trade work. Little does she know, I&amp;#39;m getting my ass out when I turn 18 with a diploma and enlisting, hopefully after some laser eye surgery. Do 4 years to beat my father and get enough money to start somewhere.&lt;/p&gt;\n\n&lt;p&gt;help a young lad out&lt;/p&gt;\n\n&lt;p&gt;edit: also, heavily considering going to church. there&amp;#39;s one in walking distance. sunday school 0900 and worship services 1030+. worth it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "reposted, automod took it down because I linked a previous milliondollarextreme thread.\n\nSo I'm 15, and my GPA has turned from 3.6+ to a 2.4. I got two awards in the past for earning the highest score on standardized testing, and I am officially \"excelling,\" in Science, Math, and English. I used to take IQ tests for kicks starting at 11 and always ended up 113-128. Now, some of this is how my Algebra II teacher grades assignments (currently 50% with him)*** but it feels like exactly like what another user posted a few days ago.\n\n***To quote him: No extra credit. Until now, because over half of his kids have Ds or below and (((they))) are wondering why.\n\nMy diet is very carb and meat heavy. Dairy is minimal (breakfast); vegetables and fruit are scarce (dinner). My lunch is very small or just non-existent. During school I take a few bags of county-lunch bags and most of the times eat everything in there. There's literally only 2 food items, a big item and a small item (banana/honeydew, chips/pineapple cup, you get it).\n\nExercise has been very little over the past 2 years. After 8th grade the only PE you get is by yourself or 2 hours per week during school hours. Before that it was an hour everyday. My latest mile time (3 laps around the campus) was 7:38. I've started to adopt an easy method of doing pushups or lifting my airsoft rifle (10 lbs. loaded) when I'm bored.\n\nMy sleep schedule I think has the most trouble. I usually stay up until 2300-0100 because that's the only time I feel completely comfortable in the house, literally no one to bother me and it's all quiet-like. Unfortunately, I wake up for school 0600-0630. Classes start at 8. On the weekends I stay up until I go to sleep on principle or until I'm tired, and it's normally 9 hours of sleep, then 1-2 hours of just staying in bed.\n\nMy hobbies consist of airsoft. I'm getting better and better with the barrels/backspin aspect of the replicas, I just recently made my own modifications and made it work. I do play video games but I really don't like calling that a \"hobby.\" Sitting in front of a screen yelling at your friends for an artificial competition isn't that much of a hobby. Lately I've been getting into more strategical games like Wargame: Red Dragon and solo games such as STALKER.\n\nSo is there any good out of this?\n\nI'm more sociable, that's about it. For some reason the suicidal kid in our group at school has been talking to me more. I've been turned down by one girl this year, but I'm planning on asking out this little freshman to the dance in October, she hangs out with the most chickenshit betas I've ever seen in my life, figure I can take her in.\n\n[went back to this thread](automod is gay) and some are saying to find something I like and integrate it back in. For years I played loads of GTA, Fallout, and \"basic\" shooters such as Team Fortress and modded Call Of Duty. However, I don't want to go back to those days of draining myself. Nowadays I browse /k/, airsoft, weekendgunnit, YouTube gun channels, and Hitman speedruns; occasionally playing video games with my friends. My mother also keeps pushing me to do work with relatives/friends after I said I wanted to get into trade work. Little does she know, I'm getting my ass out when I turn 18 with a diploma and enlisting, hopefully after some laser eye surgery. Do 4 years to beat my father and get enough money to start somewhere.\n\nhelp a young lad out\n\nedit: also, heavily considering going to church. there's one in walking distance. sunday school 0900 and worship services 1030+. worth it?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "72p2u8", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "I'm also turning dumber- take 2", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 6, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_72p2u8", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/72p2u8/im_also_turning_dumber_take_2/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1506504895.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/72p2u8/im_also_turning_dumber_take_2/", "author_flair_text": "are traps gay? lets ask MDE", "quarantine": false, "author": "theweef", "created_utc": 1506476095.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.5, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_72p2u8", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dnkaxdl", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "OG-IdeasMan", "can_mod_post": false, "ups": 1, "parent_id": "t3_72p2u8", "score": 1, "approved_by": null, "downs": 0, "body": "you gotta put in work now. its no longer basic enough to just show up and get an A. you gotta work on your assignments and study", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you gotta put in work now. its no longer basic enough to just show up and get an A. you gotta work on your assignments and study&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/72p2u8/im_also_turning_dumber_take_2/dnkaxdl/", "subreddit_type": "public", "name": "t1_dnkaxdl", "created": 1506509843.0, "author_flair_text": "Avoid the 3 P's", "created_utc": 1506481043.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_72p2u8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_72p2u8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_72p2u8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_72p2u8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_72p2u8", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dnm43bm", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "the_shiniest_dratini", "can_mod_post": false, "ups": 1, "parent_id": "t1_dnlr3vf", "score": 1, "approved_by": null, "downs": 0, "body": "Try to see if anyone in your area is giving away a weight set on Craigslist.  They're a pain to move when changing houses, etc. so a lot of people just give them away because they're usually kept outside and need to be cleaned anyways.  \n\nIf you don't have room at your house for a set you can sign up with your local YMCA.  The rates are reasonable and their equipment is usually at least passable (they usually have everything you need).  Also, try to do some research on workout routines and diets that work for you.  I started lifting at your age and it has defined the person I am today.  It improved my self esteem and social life almost immediately.\n\nThe Student Leadership committee sounds good.  Follow through with that.\n\nFeel free to bounce any ideas off me in the future.  Here to help.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try to see if anyone in your area is giving away a weight set on Craigslist.  They&amp;#39;re a pain to move when changing houses, etc. so a lot of people just give them away because they&amp;#39;re usually kept outside and need to be cleaned anyways.  &lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t have room at your house for a set you can sign up with your local YMCA.  The rates are reasonable and their equipment is usually at least passable (they usually have everything you need).  Also, try to do some research on workout routines and diets that work for you.  I started lifting at your age and it has defined the person I am today.  It improved my self esteem and social life almost immediately.&lt;/p&gt;\n\n&lt;p&gt;The Student Leadership committee sounds good.  Follow through with that.&lt;/p&gt;\n\n&lt;p&gt;Feel free to bounce any ideas off me in the future.  Here to help.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/72p2u8/im_also_turning_dumber_take_2/dnm43bm/", "subreddit_type": "public", "name": "t1_dnm43bm", "created": 1506602447.0, "author_flair_text": null, "created_utc": 1506573647.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 4, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dnlr3vf", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "theweef", "can_mod_post": false, "ups": 1, "parent_id": "t1_dnli76c", "score": 1, "approved_by": null, "downs": 0, "body": "I'm not setting objectives toward airsoft (other than reasons above), I'm using it as a tool for gaining that mindset. You win or lose, no in between. Granted, that logic can be applied to school- fail or pass. I went into my garage and dug up my stepfather's dumbbell set- sadly it's only 15 pounds each arm (7.5 pounds each bar), was expecting a little more. I'll see about asking my mother about going to the gym on Mondays (no school). I also found out about a \"Student Leadership Committee\" at school, I applied for that. Talking to you has helped a ton, it feels like I just needed a push.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not setting objectives toward airsoft (other than reasons above), I&amp;#39;m using it as a tool for gaining that mindset. You win or lose, no in between. Granted, that logic can be applied to school- fail or pass. I went into my garage and dug up my stepfather&amp;#39;s dumbbell set- sadly it&amp;#39;s only 15 pounds each arm (7.5 pounds each bar), was expecting a little more. I&amp;#39;ll see about asking my mother about going to the gym on Mondays (no school). I also found out about a &amp;quot;Student Leadership Committee&amp;quot; at school, I applied for that. Talking to you has helped a ton, it feels like I just needed a push.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/72p2u8/im_also_turning_dumber_take_2/dnlr3vf/", "subreddit_type": "public", "name": "t1_dnlr3vf", "created": 1506584545.0, "author_flair_text": "are traps gay? lets ask MDE", "created_utc": 1506555745.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dnli76c", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "the_shiniest_dratini", "can_mod_post": false, "ups": 1, "parent_id": "t1_dnkvbb4", "score": 1, "approved_by": null, "downs": 0, "body": "Why are you tying your desire to cultivate an objective-based mindset to something like airsoft?  You should really just apply that energy towards marking achievable waypoints in your education and fitness to improve yourself through more meaningful endeavors.  Aren't you suffering from a decline in your mental acuity?  You could get a head start on your PT reqs for enlisting and cultivate the kind of mind that the Armed Forces want for specialized positions.  \n\nI'll say again that the airsoft seems like a waste of funds and energy that would be better spent elsewhere.  It sounds like a waste of time to me and there doesn't seem to be any substantial logic behind your choice to structure your life and future around it.  It produces no tangible benefit.  I understand that you probably have friends involved in it and that it is something that you enjoy but it is not something that a \"winner\" would organize their life around.  To draw an analog: I enjoyed many different toys when I was a child but now they sit on a shelf because I have more important things to do with myself.  That's my outside perspective.  \n\nIf you're looking for a healthy community try joining a charity organization like an animal rescue group or a food bank.  That way, you are providing a benefit to society while surrounding yourself with positive people.  Church doesn't really play in my book.  It seems like fluff.", "edited": 1506545635.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why are you tying your desire to cultivate an objective-based mindset to something like airsoft?  You should really just apply that energy towards marking achievable waypoints in your education and fitness to improve yourself through more meaningful endeavors.  Aren&amp;#39;t you suffering from a decline in your mental acuity?  You could get a head start on your PT reqs for enlisting and cultivate the kind of mind that the Armed Forces want for specialized positions.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll say again that the airsoft seems like a waste of funds and energy that would be better spent elsewhere.  It sounds like a waste of time to me and there doesn&amp;#39;t seem to be any substantial logic behind your choice to structure your life and future around it.  It produces no tangible benefit.  I understand that you probably have friends involved in it and that it is something that you enjoy but it is not something that a &amp;quot;winner&amp;quot; would organize their life around.  To draw an analog: I enjoyed many different toys when I was a child but now they sit on a shelf because I have more important things to do with myself.  That&amp;#39;s my outside perspective.  &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re looking for a healthy community try joining a charity organization like an animal rescue group or a food bank.  That way, you are providing a benefit to society while surrounding yourself with positive people.  Church doesn&amp;#39;t really play in my book.  It seems like fluff.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/72p2u8/im_also_turning_dumber_take_2/dnli76c/", "subreddit_type": "public", "name": "t1_dnli76c", "created": 1506574036.0, "author_flair_text": null, "created_utc": 1506545236.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dnkvbb4", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "theweef", "can_mod_post": false, "ups": 1, "parent_id": "t1_dnkd7vh", "score": 1, "approved_by": null, "downs": 0, "body": "Seeing how I can work next year, I can start saving. I want to continue my airsoft hobby (go to larger, national events with minimum age requirements, more organization, etc.) and get more used to an objective-based mindset. I'm starting to research more and more into the enlisting aspect of the Army and I've taken the practice ASVAB online once. I want laser eye surgery so I won't need glasses ever again, but I'll then need to wait until I'm 19 (1+ year wait on enlisting). All my life I haven't had what I would call \"good,\" people. Family is bad, friends aren't great, and Vegas itself doesn't have a lot of good people. I figure church can make up for that and give me something to do over the weekend. Not that I need a spiritual upbringing or I want to go full-out Christian, but I more want to join for the community aspect. Similar to airsofting, those guys are the best friends I've ever made and I formed better relationships in under a year with them than my other friends throughout my whole life. ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seeing how I can work next year, I can start saving. I want to continue my airsoft hobby (go to larger, national events with minimum age requirements, more organization, etc.) and get more used to an objective-based mindset. I&amp;#39;m starting to research more and more into the enlisting aspect of the Army and I&amp;#39;ve taken the practice ASVAB online once. I want laser eye surgery so I won&amp;#39;t need glasses ever again, but I&amp;#39;ll then need to wait until I&amp;#39;m 19 (1+ year wait on enlisting). All my life I haven&amp;#39;t had what I would call &amp;quot;good,&amp;quot; people. Family is bad, friends aren&amp;#39;t great, and Vegas itself doesn&amp;#39;t have a lot of good people. I figure church can make up for that and give me something to do over the weekend. Not that I need a spiritual upbringing or I want to go full-out Christian, but I more want to join for the community aspect. Similar to airsofting, those guys are the best friends I&amp;#39;ve ever made and I formed better relationships in under a year with them than my other friends throughout my whole life. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/72p2u8/im_also_turning_dumber_take_2/dnkvbb4/", "subreddit_type": "public", "name": "t1_dnkvbb4", "created": 1506550426.0, "author_flair_text": "are traps gay? lets ask MDE", "created_utc": 1506521626.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dnkd7vh", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "the_shiniest_dratini", "can_mod_post": false, "ups": 1, "parent_id": "t3_72p2u8", "score": 1, "approved_by": null, "downs": 0, "body": "Add lifting to your hobbies (real lifting, not push-ups and lifting your 10 lb airsoft gun).  Get your full 8+ hours of sleep every night.  You're losing a ton of essential vitamins and minerals in your lack of fruits and vegetables, so I would at least add a multivitamin to the mix if you're strapped for cash.  You need all that at your age.\n\nUnless you've had a real, controlled IQ test administered by a professional then those scores are unreliable (most psychologists have such training, and even more children's psychologists).  I'm going to assume you weren't taking professionally administered IQ tests for kicks and that you are referring to some stuff online so I wouldn't put too much weight on those scores.  Either way, it's immaterial if you're not doing the work.  You really just have to show up and fill out the worksheets, do your homework, and read what's assigned.  This is the easiest level of schooling.\n\nThe airsoft sounds like a real dead end but if it makes you happy I guess go for it.  You seem to have organized your interests around it, though, which is kind of troublesome (whiling away your free time on airsoft videos and Hitman speed-runs sounds pretty mind-numbing).  It seems like it's your lifestyle.  Airsoft seems like a children's hobby and I doubt you're looking for advice on how to be a better child.  \n\nDoes the airsoft have anything to do with your plans to enlist?  Have you taken the ASVAB yet?  Why do you need laser eye surgery?  How are you going to fund that?\n\nI don't see the appeal of church.  Why are you asking about this?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Add lifting to your hobbies (real lifting, not push-ups and lifting your 10 lb airsoft gun).  Get your full 8+ hours of sleep every night.  You&amp;#39;re losing a ton of essential vitamins and minerals in your lack of fruits and vegetables, so I would at least add a multivitamin to the mix if you&amp;#39;re strapped for cash.  You need all that at your age.&lt;/p&gt;\n\n&lt;p&gt;Unless you&amp;#39;ve had a real, controlled IQ test administered by a professional then those scores are unreliable (most psychologists have such training, and even more children&amp;#39;s psychologists).  I&amp;#39;m going to assume you weren&amp;#39;t taking professionally administered IQ tests for kicks and that you are referring to some stuff online so I wouldn&amp;#39;t put too much weight on those scores.  Either way, it&amp;#39;s immaterial if you&amp;#39;re not doing the work.  You really just have to show up and fill out the worksheets, do your homework, and read what&amp;#39;s assigned.  This is the easiest level of schooling.&lt;/p&gt;\n\n&lt;p&gt;The airsoft sounds like a real dead end but if it makes you happy I guess go for it.  You seem to have organized your interests around it, though, which is kind of troublesome (whiling away your free time on airsoft videos and Hitman speed-runs sounds pretty mind-numbing).  It seems like it&amp;#39;s your lifestyle.  Airsoft seems like a children&amp;#39;s hobby and I doubt you&amp;#39;re looking for advice on how to be a better child.  &lt;/p&gt;\n\n&lt;p&gt;Does the airsoft have anything to do with your plans to enlist?  Have you taken the ASVAB yet?  Why do you need laser eye surgery?  How are you going to fund that?&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t see the appeal of church.  Why are you asking about this?&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/72p2u8/im_also_turning_dumber_take_2/dnkd7vh/", "subreddit_type": "public", "name": "t1_dnkd7vh", "created": 1506513073.0, "author_flair_text": null, "created_utc": 1506484273.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]