[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I wasn&amp;#39;t the guy invited to all the parties that happened almost every week in my high school. I&amp;#39;d hear of a party itself then ask around about it for a few days in order to maybe find someone that would invite me, but was always met with a &amp;quot;you probably wouldn&amp;#39;t like it&amp;quot;, or &amp;quot;there are going to be a lot of people there that you don&amp;#39;t know&amp;quot;. I took these little sentences as evidence that I wasn&amp;#39;t wanted, and, attempting to not look desperate, always decided not to push any further. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not like I was never invited to ANY parties. I had been at the smaller ones occasionally and always had fun doing my special party tricks that I practiced at home in my free time. I had a feeling I stopped being invited to parties solely &lt;em&gt;because&lt;/em&gt; of these party tricks; specifically ones that I always thought would be funny but usually just grossed people out. \nI&amp;#39;m just not very self-aware when I&amp;#39;m drunk and around a lot of people who I want to impress. &lt;/p&gt;\n\n&lt;p&gt;My most famous party trick, which was eventually posted to Instagram and received ~50k views, was when I did a handstand, grabbed a joint with both of my bare feet and smoked it to completion by using only the kegel-force of my asshole; I did this in about 30 seconds. The video is really grainy and it&amp;#39;s just me doing a handstand in a dark backyard with my legs twisted all funny, puffing on a joint with my shaven pulsating donut-hole (I had planned and practiced this party trick many times before the party actually started, so I decided to shave my hole to make the act easier and more sanitary). Dudes are standing around me with one hand holding a beer and the other hand in their pocket looking sort of unimpressed and the girls have their hands over their mouths and some are crying and looking away and back again in brief intervals. Once I finish the joint I get back on my feet and sort of just stand there waiting for applause or something but the dude behind the camera just says &amp;quot;that was fucking weird bro&amp;quot; and shuts it off. It&amp;#39;s not in the video but I ran back to my car with smoke billowing out of my asshole.&lt;/p&gt;\n\n&lt;p&gt;Other ones I&amp;#39;ve done are: stretching my scrotum over my penis and super-gluing it to my pubis so that it looks like I just have a hairy blob attached to my torso, tying my foreskin shut and pissing so it fills up like a water balloon, touching my elbow to my asshole, popping a boner and pissing so it arcs over my head and into a bottle that I place behind me, and more but you get the idea. &lt;/p&gt;\n\n&lt;p&gt;As my senior year of high school approached I really wanted to go to one of the BIG parties, have fun, smoke some pot drink some beer, and go with the flow. I thought to myself, &amp;quot;this time if I go I&amp;#39;ll just behave like everyone else, I won&amp;#39;t try to stand out or do any party tricks, I&amp;#39;ll just drink some alcohol and maybe try and get that skinny girl with the ugly face and huge forehead to reluctantly suck me off behind a bush or something&amp;quot;. When I heard that there was a Prom Night Party in the works at this rich kid Harrison&amp;#39;s house just down the block from me I decided that I would force my way in, no matter what, and try to have as much fun as possible. I was hopeful that at least one good thing would come out of my high school career, if I could just go and act like everyone else something good was bound to happen.&lt;/p&gt;\n\n&lt;p&gt;So instead of asking to be invited I just went. Everyone was dressed up because it was prom night but I showed up in jeans and a t-shirt and walked right into the rich kid&amp;#39;s brick mansion. I stood out but I didn&amp;#39;t really care that much. I went to the nearest cooler I could find, grabbed a beer, and sat down on one of the nice leather couches next to some bare-foot girls (I always thought it was gross how girls seemed to constantly walk barefoot in school and in public even, exclusively girls do this). As I finished the beer I was starting to think once again about all the Party Tricks I could do. There was no way I was going to actually do one, I thought, but they were fun to think about. As people walked around with all sorts of things in their hands I kept making up new cool tricks that I could do to impress people. I realized I was being a little bit delusional and that it was because alcohol effects me harshly, but I grabbed another 3 beers and downed them with little hesitation.&lt;/p&gt;\n\n&lt;p&gt;I got up and started walking around, almost in a daze of sorts. I was officially out to impress. I walked around eyeing things that I could use to do a cool party trick in front of all of these cool well dressed popular kids. I made my way into the living room where most of the people were dancing and drinking and talking and what not. There was a cooler in the corner of the room that a cute girl was walking towards. She grabbed a bottle of beer out of the cooler. &lt;/p&gt;\n\n&lt;p&gt;Without hesitation I quickly walked over to her, grabbed the bottle of beer out of her hand, loudly screamed &amp;quot;hey lemme get that for you miss!&amp;quot; so everyone would hear, pulled my pants down, and shoved the cap-end into my asshole. I then twisted the cap inside of my asshole in an attempt to open it, but that&amp;#39;s where things went horribly wrong. &lt;/p&gt;\n\n&lt;p&gt;The sharp aluminum cap of the blue Budweiser beer bottle didn&amp;#39;t budge one bit, and it rotated inside of my asshole making a complete O-shaped cut on my delicate poop-chute tissue. At that point everyone in my general vicinity was looking at me with absolute horror painted on their faces. I stood completely motionless in a half bent over position like a dog taking a shit, my eyes and veins popping out of my head from the intense pain that I was experiencing. Blood dripped from my anus and slid down the beer bottle like condensation. The laughs and words from the crowd of people were no more, and the music playing behind them became a surreal symphony of electronic doops and beeps; the entire feel of the room shifted completely.&lt;/p&gt;\n\n&lt;p&gt;At that point I just wanted to get the hell out of there and get myself to an emergency room as soon as possible, but the horror-show was far from over. I quickly removed the beer bottle from my asshole and when I did I felt something inside my bowels buckle and squirm. I felt what I can only describe as a knot being untangled right above my belly button. I then felt an immense pressure coming from the tissue surrounding my anus and before I knew it my intestines were shooting out of my ass like one of those spring-loaded prank peanut jars with the snakes inside. I made a very long breathy moan as my intestinal walls flipped inside out and went spiraling onto the floor. There was a wet ripping sound emanating from my rear. There was no pain anymore just absolute horror at what was going on. &lt;/p&gt;\n\n&lt;p&gt;The once white carpet beneath me was now a sickly yellow color as the bile from the caverns of my guts seeped out like goo from a sea-slug. The heat from my intestines made the air temperature a few degrees higher and the entire area smelled like Velveeta cheese. The circle of people around me had gotten much more spacious as they moved back and away from me. I was so weak that I could barely say anything but I kept muttering &amp;quot;call 911, call 911, call 911&amp;quot; but it sound more like &amp;quot;caw nigh wa wa, caw nigh wa wa, caw nigh wa wa&amp;quot;. I became even more dismayed when everyone around me seemed not to care about my health, they were just standing there with thousand yard stares. I had maintained my dog-shitting squat position because I was afraid to move.&lt;/p&gt;\n\n&lt;p&gt;Finally the rich kid Harrison stood at the stairs and started screaming &amp;quot;everyone get out! Get out!&amp;quot; and he got on his phone to call an ambulance. Most people left but some people stayed and got their phones out, taking pictures of me with the flash on. I couldn&amp;#39;t do anything but stand there, pale and sweating, stuck like a statue as some laughed and some cried. It was at that moment I realized I had once again embarrassed myself in front of my peers. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a feeling that I can&amp;#39;t easily describe, when you ruin a party and your bowels are completely outside of your body.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I wasn't the guy invited to all the parties that happened almost every week in my high school. I'd hear of a party itself then ask around about it for a few days in order to maybe find someone that would invite me, but was always met with a \"you probably wouldn't like it\", or \"there are going to be a lot of people there that you don't know\". I took these little sentences as evidence that I wasn't wanted, and, attempting to not look desperate, always decided not to push any further. \n\nIt's not like I was never invited to ANY parties. I had been at the smaller ones occasionally and always had fun doing my special party tricks that I practiced at home in my free time. I had a feeling I stopped being invited to parties solely *because* of these party tricks; specifically ones that I always thought would be funny but usually just grossed people out. \nI'm just not very self-aware when I'm drunk and around a lot of people who I want to impress. \n\nMy most famous party trick, which was eventually posted to Instagram and received ~50k views, was when I did a handstand, grabbed a joint with both of my bare feet and smoked it to completion by using only the kegel-force of my asshole; I did this in about 30 seconds. The video is really grainy and it's just me doing a handstand in a dark backyard with my legs twisted all funny, puffing on a joint with my shaven pulsating donut-hole (I had planned and practiced this party trick many times before the party actually started, so I decided to shave my hole to make the act easier and more sanitary). Dudes are standing around me with one hand holding a beer and the other hand in their pocket looking sort of unimpressed and the girls have their hands over their mouths and some are crying and looking away and back again in brief intervals. Once I finish the joint I get back on my feet and sort of just stand there waiting for applause or something but the dude behind the camera just says \"that was fucking weird bro\" and shuts it off. It's not in the video but I ran back to my car with smoke billowing out of my asshole.\n\nOther ones I've done are: stretching my scrotum over my penis and super-gluing it to my pubis so that it looks like I just have a hairy blob attached to my torso, tying my foreskin shut and pissing so it fills up like a water balloon, touching my elbow to my asshole, popping a boner and pissing so it arcs over my head and into a bottle that I place behind me, and more but you get the idea. \n\nAs my senior year of high school approached I really wanted to go to one of the BIG parties, have fun, smoke some pot drink some beer, and go with the flow. I thought to myself, \"this time if I go I'll just behave like everyone else, I won't try to stand out or do any party tricks, I'll just drink some alcohol and maybe try and get that skinny girl with the ugly face and huge forehead to reluctantly suck me off behind a bush or something\". When I heard that there was a Prom Night Party in the works at this rich kid Harrison's house just down the block from me I decided that I would force my way in, no matter what, and try to have as much fun as possible. I was hopeful that at least one good thing would come out of my high school career, if I could just go and act like everyone else something good was bound to happen.\n\nSo instead of asking to be invited I just went. Everyone was dressed up because it was prom night but I showed up in jeans and a t-shirt and walked right into the rich kid's brick mansion. I stood out but I didn't really care that much. I went to the nearest cooler I could find, grabbed a beer, and sat down on one of the nice leather couches next to some bare-foot girls (I always thought it was gross how girls seemed to constantly walk barefoot in school and in public even, exclusively girls do this). As I finished the beer I was starting to think once again about all the Party Tricks I could do. There was no way I was going to actually do one, I thought, but they were fun to think about. As people walked around with all sorts of things in their hands I kept making up new cool tricks that I could do to impress people. I realized I was being a little bit delusional and that it was because alcohol effects me harshly, but I grabbed another 3 beers and downed them with little hesitation.\n\nI got up and started walking around, almost in a daze of sorts. I was officially out to impress. I walked around eyeing things that I could use to do a cool party trick in front of all of these cool well dressed popular kids. I made my way into the living room where most of the people were dancing and drinking and talking and what not. There was a cooler in the corner of the room that a cute girl was walking towards. She grabbed a bottle of beer out of the cooler. \n\nWithout hesitation I quickly walked over to her, grabbed the bottle of beer out of her hand, loudly screamed \"hey lemme get that for you miss!\" so everyone would hear, pulled my pants down, and shoved the cap-end into my asshole. I then twisted the cap inside of my asshole in an attempt to open it, but that's where things went horribly wrong. \n\nThe sharp aluminum cap of the blue Budweiser beer bottle didn't budge one bit, and it rotated inside of my asshole making a complete O-shaped cut on my delicate poop-chute tissue. At that point everyone in my general vicinity was looking at me with absolute horror painted on their faces. I stood completely motionless in a half bent over position like a dog taking a shit, my eyes and veins popping out of my head from the intense pain that I was experiencing. Blood dripped from my anus and slid down the beer bottle like condensation. The laughs and words from the crowd of people were no more, and the music playing behind them became a surreal symphony of electronic doops and beeps; the entire feel of the room shifted completely.\n\nAt that point I just wanted to get the hell out of there and get myself to an emergency room as soon as possible, but the horror-show was far from over. I quickly removed the beer bottle from my asshole and when I did I felt something inside my bowels buckle and squirm. I felt what I can only describe as a knot being untangled right above my belly button. I then felt an immense pressure coming from the tissue surrounding my anus and before I knew it my intestines were shooting out of my ass like one of those spring-loaded prank peanut jars with the snakes inside. I made a very long breathy moan as my intestinal walls flipped inside out and went spiraling onto the floor. There was a wet ripping sound emanating from my rear. There was no pain anymore just absolute horror at what was going on. \n\nThe once white carpet beneath me was now a sickly yellow color as the bile from the caverns of my guts seeped out like goo from a sea-slug. The heat from my intestines made the air temperature a few degrees higher and the entire area smelled like Velveeta cheese. The circle of people around me had gotten much more spacious as they moved back and away from me. I was so weak that I could barely say anything but I kept muttering \"call 911, call 911, call 911\" but it sound more like \"caw nigh wa wa, caw nigh wa wa, caw nigh wa wa\". I became even more dismayed when everyone around me seemed not to care about my health, they were just standing there with thousand yard stares. I had maintained my dog-shitting squat position because I was afraid to move.\n\nFinally the rich kid Harrison stood at the stairs and started screaming \"everyone get out! Get out!\" and he got on his phone to call an ambulance. Most people left but some people stayed and got their phones out, taking pictures of me with the flash on. I couldn't do anything but stand there, pale and sweating, stuck like a statue as some laughed and some cried. It was at that moment I realized I had once again embarrassed myself in front of my peers. \n\nThere's a feeling that I can't easily describe, when you ruin a party and your bowels are completely outside of your body.\n\n\n\n\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "78cis3", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "The Final Party Trick - A Party Story", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 49, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 8, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": 1508808922.0, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_78cis3", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/78cis3/the_final_party_trick_a_party_story/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1508837479.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/78cis3/the_final_party_trick_a_party_story/", "author_flair_text": "READ UNABOMBER'S MANIFESTO", "quarantine": false, "author": "Psychedelican", "created_utc": 1508808679.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.93, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 49}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_78cis3", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dosv43l", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Thepotatohaslanded", "can_mod_post": false, "ups": 15, "parent_id": "t3_78cis3", "score": 15, "approved_by": null, "downs": 0, "body": "Only real mde fans will read the whole thing", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Only real mde fans will read the whole thing&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/78cis3/the_final_party_trick_a_party_story/dosv43l/", "subreddit_type": "public", "name": "t1_dosv43l", "created": 1508841991.0, "author_flair_text": "[MDE reference] ", "created_utc": 1508813191.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_78cis3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_78cis3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_78cis3", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dosxksk", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "BlossomedProfanity", "can_mod_post": false, "ups": 7, "parent_id": "t1_dosxf6o", "score": 7, "approved_by": null, "downs": 0, "body": "no problem man i love this new avant garde humour stuff my professor at yale always talked about how cool it was but he said that the people who make it often have some sort of political motive behind it but i dont think you would be like a trump supporter or anything so it should be fine", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;no problem man i love this new avant garde humour stuff my professor at yale always talked about how cool it was but he said that the people who make it often have some sort of political motive behind it but i dont think you would be like a trump supporter or anything so it should be fine&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/78cis3/the_final_party_trick_a_party_story/dosxksk/", "subreddit_type": "public", "name": "t1_dosxksk", "created": 1508844911.0, "author_flair_text": null, "created_utc": 1508816111.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dosxf6o", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Psychedelican", "can_mod_post": false, "ups": 6, "parent_id": "t1_dosxd1z", "score": 6, "approved_by": null, "downs": 0, "body": "ye use it just give me credit boyo and it's cool thx for askin bud", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ye use it just give me credit boyo and it&amp;#39;s cool thx for askin bud&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/78cis3/the_final_party_trick_a_party_story/dosxf6o/", "subreddit_type": "public", "name": "t1_dosxf6o", "created": 1508844705.0, "author_flair_text": "READ UNABOMBER'S MANIFESTO", "created_utc": 1508815905.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_78cis3", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dotgvq6", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Graugluck", "can_mod_post": false, "ups": 4, "parent_id": "t1_dosxd1z", "score": 4, "approved_by": null, "downs": 0, "body": "You can always tell Psychadelican's writing because always talk about his elastic foreskin. Ehlers danlos? ", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can always tell Psychadelican&amp;#39;s writing because always talk about his elastic foreskin. Ehlers danlos? &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/78cis3/the_final_party_trick_a_party_story/dotgvq6/", "subreddit_type": "public", "name": "t1_dotgvq6", "created": 1508883093.0, "author_flair_text": "peaceful nuclear explosion", "created_utc": 1508854293.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dosxd1z", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "BlossomedProfanity", "can_mod_post": false, "ups": 9, "parent_id": "t3_78cis3", "score": 9, "approved_by": null, "downs": 0, "body": "hello i do not know if you made this but i would like to copy and paste this onto my facebook shitposting page if you are ok with this please give me a thumbs up and i will post it with credit to your reddit account", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hello i do not know if you made this but i would like to copy and paste this onto my facebook shitposting page if you are ok with this please give me a thumbs up and i will post it with credit to your reddit account&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/78cis3/the_final_party_trick_a_party_story/dosxd1z/", "subreddit_type": "public", "name": "t1_dosxd1z", "created": 1508844633.0, "author_flair_text": null, "created_utc": 1508815833.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_78cis3", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dosxjx1", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "NeedEvolution", "can_mod_post": false, "ups": 3, "parent_id": "t3_78cis3", "score": 3, "approved_by": null, "downs": 0, "body": "I love this. This is good music.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love this. This is good music.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/78cis3/the_final_party_trick_a_party_story/dosxjx1/", "subreddit_type": "public", "name": "t1_dosxjx1", "created": 1508844880.0, "author_flair_text": null, "created_utc": 1508816080.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_78cis3", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dot8v8i", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "CrownedCaribou", "can_mod_post": false, "ups": 2, "parent_id": "t3_78cis3", "score": 2, "approved_by": null, "downs": 0, "body": "Hey Psych you ever catch that video of that dude sticking a glass jar up his ass and it shatters?  He's just calmly trying to pick the glass shards out as it bleeds a bright red, GREAT stuff", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey Psych you ever catch that video of that dude sticking a glass jar up his ass and it shatters?  He&amp;#39;s just calmly trying to pick the glass shards out as it bleeds a bright red, GREAT stuff&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/78cis3/the_final_party_trick_a_party_story/dot8v8i/", "subreddit_type": "public", "name": "t1_dot8v8i", "created": 1508869882.0, "author_flair_text": "Now where could my pipe be?", "created_utc": 1508841082.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_78cis3", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dot7zac", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "depehb", "can_mod_post": false, "ups": 1, "parent_id": "t3_78cis3", "score": 1, "approved_by": null, "downs": 0, "body": "lol", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/78cis3/the_final_party_trick_a_party_story/dot7zac/", "subreddit_type": "public", "name": "t1_dot7zac", "created": 1508867440.0, "author_flair_text": null, "created_utc": 1508838640.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]