[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Keep em coming guys, really liking these posts&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Keep em coming guys, really liking these posts", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "7b9emq", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "Wow haha stupid wojacks sure are funny", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 0, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 2, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_7b9emq", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/7b9emq/wow_haha_stupid_wojacks_sure_are_funny/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1510042550.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/7b9emq/wow_haha_stupid_wojacks_sure_are_funny/", "author_flair_text": null, "quarantine": false, "author": "Alroni", "created_utc": 1510013750.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.45, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7b9emq", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dphakic", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Teeth_Paste", "can_mod_post": false, "ups": 5, "parent_id": "t3_7b9emq", "score": 5, "approved_by": null, "downs": 0, "body": "Shut up **pussy**\n\n*slams you into a locker*", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shut up &lt;strong&gt;pussy&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;slams you into a locker&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7b9emq/wow_haha_stupid_wojacks_sure_are_funny/dphakic/", "subreddit_type": "public", "name": "t1_dphakic", "created": 1510102141.0, "author_flair_text": "💊𝔽𝕌ℝℙ𝕀𝕃𝕃", "created_utc": 1510073341.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7b9emq", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dpgnjc7", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "psyduck117", "can_mod_post": false, "ups": -1, "parent_id": "t3_7b9emq", "score": -1, "approved_by": null, "downs": 0, "body": "Your mother jerks off pigs. She gets down on her knees and crawls through the pigpiss mud slop and snuggles up to the pig, her fingers tracing along it's belly until she finds it's cock. She begins tugging and stroking as her twat moistens, her breasts swelling and her nipples begin to stick out like erasers on a fresh #2 pencil. She grunts with satisfaction as the pig begins eagerly thrusting into her hand, her grip now tightening to maintain control of the pig's greasy corkscrew cock. She lowers her head to watch the cock work in her hand, groans with satisfaction and begins working her clit with her other muddy hand, her hips gyrating with the rhythm of the pig's thrusting. \"Oh fucking jesus god yes..\" she gasps. She changes positions, still maintaining control of the feverishly thrusting cock as the pig's squealing intensifies. She leans forward and with her lips almost touching the pig's ear, she whispers your name and begins to shudder. She turns her attention again to the pigs swollen member rocking in her hand. She presses it between her hand and her face, the pig thrusting it against her cheeks as she drools. With a massive grunt and a high pitched squeal, the pig's balls explode, beginning a massive shower of hot, sour pig jizz. You mother cups one hand under the fountain of steaming genetic material gathering it in her hand as the thrusting comes to an end. The pig shudders and begins to walk to the trough of slop in the corner of it's pen, but your mother tackles it to the ground. She lifts it's tail and smears the handful of pig load into the pig's own fetid butthole, turning flakes of crusty pig shit into a pigshit-pigjizz mud slop on the pigs ass. Now she tilts her head to the sky and screams your name, not once, not twice, but three times. She slams her face full force into the pig's butthole and it's wreath of shitsemen pudding, her tongue machine gun flicking the rim and then burying itself to the hilt inside the pig's hot colon. Your mother works her tongue around the inside of the pigs ass, and then as a few incoherent syllables escaped her now brown lips, spurts of female ejaculate spurt from her pulsating cunt. Exhausted, she collapses in the mud, rolls over onto her back, and lights a cigarette. She takes one long drag, looks again to the sky, and speaks your name one last time before she drifts off to sleep. That's your mom. Your mom does that.\n\n", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your mother jerks off pigs. She gets down on her knees and crawls through the pigpiss mud slop and snuggles up to the pig, her fingers tracing along it&amp;#39;s belly until she finds it&amp;#39;s cock. She begins tugging and stroking as her twat moistens, her breasts swelling and her nipples begin to stick out like erasers on a fresh #2 pencil. She grunts with satisfaction as the pig begins eagerly thrusting into her hand, her grip now tightening to maintain control of the pig&amp;#39;s greasy corkscrew cock. She lowers her head to watch the cock work in her hand, groans with satisfaction and begins working her clit with her other muddy hand, her hips gyrating with the rhythm of the pig&amp;#39;s thrusting. &amp;quot;Oh fucking jesus god yes..&amp;quot; she gasps. She changes positions, still maintaining control of the feverishly thrusting cock as the pig&amp;#39;s squealing intensifies. She leans forward and with her lips almost touching the pig&amp;#39;s ear, she whispers your name and begins to shudder. She turns her attention again to the pigs swollen member rocking in her hand. She presses it between her hand and her face, the pig thrusting it against her cheeks as she drools. With a massive grunt and a high pitched squeal, the pig&amp;#39;s balls explode, beginning a massive shower of hot, sour pig jizz. You mother cups one hand under the fountain of steaming genetic material gathering it in her hand as the thrusting comes to an end. The pig shudders and begins to walk to the trough of slop in the corner of it&amp;#39;s pen, but your mother tackles it to the ground. She lifts it&amp;#39;s tail and smears the handful of pig load into the pig&amp;#39;s own fetid butthole, turning flakes of crusty pig shit into a pigshit-pigjizz mud slop on the pigs ass. Now she tilts her head to the sky and screams your name, not once, not twice, but three times. She slams her face full force into the pig&amp;#39;s butthole and it&amp;#39;s wreath of shitsemen pudding, her tongue machine gun flicking the rim and then burying itself to the hilt inside the pig&amp;#39;s hot colon. Your mother works her tongue around the inside of the pigs ass, and then as a few incoherent syllables escaped her now brown lips, spurts of female ejaculate spurt from her pulsating cunt. Exhausted, she collapses in the mud, rolls over onto her back, and lights a cigarette. She takes one long drag, looks again to the sky, and speaks your name one last time before she drifts off to sleep. That&amp;#39;s your mom. Your mom does that.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7b9emq/wow_haha_stupid_wojacks_sure_are_funny/dpgnjc7/", "subreddit_type": "public", "name": "t1_dpgnjc7", "created": 1510061123.0, "author_flair_text": "&lt;3 /u/GottenGot", "created_utc": 1510032323.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]