[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "subreddit_id": "t5_2vsta", "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Obviously tough times are coming ahead. 70-90% of Americans are completely retarded. They don&amp;#39;t lend legitimacy too information that hasn&amp;#39;t been distorted by jews and the only thing that&amp;#39;s important to them in life is the materials they consume which they use to form their identity. You a coke or pepsi guy? Ford or Chevy? Facebook or twitter? Netflix or hulu? What kind of beer do you like? What sports do you watch? &amp;quot;I wear red flannel shirts, bought a nice new grill and drink beer because that&amp;#39;s a caricature of a masculine man in our culture, and because I don&amp;#39;t know how to act like one I have to project that masculinity through the materials I consume. Maybe then I won&amp;#39;t hate myself.&amp;quot; Our sense of identity as a people isn&amp;#39;t shaped by our beliefs anymore, it&amp;#39;s not shaped by history, our ancestors, christianity. None of the foundational concepts of the western world. White people? Good luck. It&amp;#39;s gonna be South Africa all over again and no one&amp;#39;s going to talk about it, no one in the media, none of your professors, not your favorite sadboi soundcloud rapper, just like South Africa. Any white who&amp;#39;s not a pozzed ass drone living in a city is fair game in post-white America. &lt;/p&gt;\n\n&lt;p&gt;Now here&amp;#39;s where we get to the important part, what are people like me and you doing about it? Making comments and liking pictures on a tiny subreddit? GAY. Tweeting insults at people we think are responsible? GAY. Listening to obscure podcasts because you finally found some semblance of someone who thinks like you? GAY.&lt;/p&gt;\n\n&lt;p&gt;Modernity has tricked us into &amp;quot;resisting&amp;quot; the powers that be through the channels that modernity created, which are GAY and you aren&amp;#39;t doing anything but wasting your own valuable time. &lt;/p&gt;\n\n&lt;p&gt;When your ancestors had a problem with a group of people ruining their society, they grouped together and set off on horses or on foot, carrying torches and weapons. And they burnt those motherfucker&amp;#39;s houses down and beat the shit out of a lot of people, but guess what, because of that those people knew their place. That&amp;#39;s the only reason the Muslims in India aren&amp;#39;t popping the fuck off, because they know the Indian people would form mobs and burn them to the ground while the government watched. &lt;/p&gt;\n\n&lt;p&gt;No fucking grill, or sweet pair of boots, or shitty beer would ever motivate someone to that extent. No atomized, isolated, anti-community culture would ever band together like that. The Last Man would let his culture be destroyed, because what culture does he have? The only thing he has to define himself are meaningless material goods. But the honorable man, the divine man, the man who knows what&amp;#39;s at stake, he would invoke the greatest evil he could muster within himself to resurrect his people from the ash heaps of history.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No tree, it is said, can grow to heaven unless it has its roots in hell&amp;quot; - Jung&lt;/p&gt;\n\n&lt;p&gt;You know what wouldn&amp;#39;t be gay? Going and volunteering for our brothers and sisters struggling with opioid addiction, who have had their families torn apart, their lives degraded and ended and their lineage destroyed because some twisted bastard wants to see your entire civilization destroyed and make a buck while he does it. You know what wouldn&amp;#39;t be gay? Burning a journalists house down. Trashing a humanities/social sciences department. Vandalizing the NYT or CNN corporate office. Putting up a banner with some nice edge over a highway. &lt;/p&gt;\n\n&lt;p&gt;Of course, I am not advocating for you guys to do these things as that would break reddit&amp;#39;s rules, but I&amp;#39;m just saying, it wouldn&amp;#39;t be gay. It would have an impact. It would instill fear into the hearts of those who have been gleefully instilling fear into ours for so long. &lt;/p&gt;\n\n&lt;p&gt;And yes, I know thinking people will care is gay, but all I&amp;#39;m saying is if you ever want to grab history by the shorthairs of its jew balls, you can really make em scream. It doesn&amp;#39;t take talent, luck, or having a rich family. All it takes is you deciding you have the will to exert what you&amp;#39;re capable of on the rest of the world. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Obviously tough times are coming ahead. 70-90% of Americans are completely retarded. They don't lend legitimacy too information that hasn't been distorted by jews and the only thing that's important to them in life is the materials they consume which they use to form their identity. You a coke or pepsi guy? Ford or Chevy? Facebook or twitter? Netflix or hulu? What kind of beer do you like? What sports do you watch? \"I wear red flannel shirts, bought a nice new grill and drink beer because that's a caricature of a masculine man in our culture, and because I don't know how to act like one I have to project that masculinity through the materials I consume. Maybe then I won't hate myself.\" Our sense of identity as a people isn't shaped by our beliefs anymore, it's not shaped by history, our ancestors, christianity. None of the foundational concepts of the western world. White people? Good luck. It's gonna be South Africa all over again and no one's going to talk about it, no one in the media, none of your professors, not your favorite sadboi soundcloud rapper, just like South Africa. Any white who's not a pozzed ass drone living in a city is fair game in post-white America. \n\nNow here's where we get to the important part, what are people like me and you doing about it? Making comments and liking pictures on a tiny subreddit? GAY. Tweeting insults at people we think are responsible? GAY. Listening to obscure podcasts because you finally found some semblance of someone who thinks like you? GAY.\n\nModernity has tricked us into \"resisting\" the powers that be through the channels that modernity created, which are GAY and you aren't doing anything but wasting your own valuable time. \n\n\nWhen your ancestors had a problem with a group of people ruining their society, they grouped together and set off on horses or on foot, carrying torches and weapons. And they burnt those motherfucker's houses down and beat the shit out of a lot of people, but guess what, because of that those people knew their place. That's the only reason the Muslims in India aren't popping the fuck off, because they know the Indian people would form mobs and burn them to the ground while the government watched. \n\nNo fucking grill, or sweet pair of boots, or shitty beer would ever motivate someone to that extent. No atomized, isolated, anti-community culture would ever band together like that. The Last Man would let his culture be destroyed, because what culture does he have? The only thing he has to define himself are meaningless material goods. But the honorable man, the divine man, the man who knows what's at stake, he would invoke the greatest evil he could muster within himself to resurrect his people from the ash heaps of history.\n\n\"No tree, it is said, can grow to heaven unless it has its roots in hell\" - Jung\n\nYou know what wouldn't be gay? Going and volunteering for our brothers and sisters struggling with opioid addiction, who have had their families torn apart, their lives degraded and ended and their lineage destroyed because some twisted bastard wants to see your entire civilization destroyed and make a buck while he does it. You know what wouldn't be gay? Burning a journalists house down. Trashing a humanities/social sciences department. Vandalizing the NYT or CNN corporate office. Putting up a banner with some nice edge over a highway. \n\nOf course, I am not advocating for you guys to do these things as that would break reddit's rules, but I'm just saying, it wouldn't be gay. It would have an impact. It would instill fear into the hearts of those who have been gleefully instilling fear into ours for so long. \n\nAnd yes, I know thinking people will care is gay, but all I'm saying is if you ever want to grab history by the shorthairs of its jew balls, you can really make em scream. It doesn't take talent, luck, or having a rich family. All it takes is you deciding you have the will to exert what you're capable of on the rest of the world. ", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "7gzn0h", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "author": "comeondantheman", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 18, "approved_by": null, "over_18": false, "removal_reason": null, "hidden": false, "num_comments": 12, "thumbnail": "self", "hide_score": false, "edited": 1512177405.0, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "media_embed": {}, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_7gzn0h", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/7gzn0h/saving_the_world_in_the_21st_century_without/", "subreddit_type": "public", "whitelist_status": "promo_adult_nsfw", "stickied": false, "created": 1512206015.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/7gzn0h/saving_the_world_in_the_21st_century_without/", "author_flair_text": null, "quarantine": false, "title": "Saving the world in the 21st century without being gay", "created_utc": 1512177215.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.95, "mod_reports": [], "is_self": true, "visited": false, "num_reports": null, "is_video": false, "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7gzn0h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7gzn0h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7gzn0h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7gzn0h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7gzn0h", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dqn360u", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "RedneckPapist", "can_mod_post": false, "ups": 1, "parent_id": "t1_dqn2zrc", "score": 1, "approved_by": null, "downs": 0, "body": "Take your time", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take your time&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7gzn0h/saving_the_world_in_the_21st_century_without/dqn360u/", "num_reports": null, "name": "t1_dqn360u", "created": 1512211396.0, "author_flair_text": null, "created_utc": 1512182596.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dqn2zrc", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "comeondantheman", "can_mod_post": false, "ups": 1, "parent_id": "t1_dqn20oq", "score": 1, "approved_by": null, "downs": 0, "body": "I'm at work and you deserve a well thought out reply so give me 2 hours and I'll respond. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m at work and you deserve a well thought out reply so give me 2 hours and I&amp;#39;ll respond. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7gzn0h/saving_the_world_in_the_21st_century_without/dqn2zrc/", "num_reports": null, "name": "t1_dqn2zrc", "created": 1512211167.0, "author_flair_text": null, "created_utc": 1512182367.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dqn20oq", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "RedneckPapist", "can_mod_post": false, "ups": 3, "parent_id": "t1_dqn15br", "score": 3, "approved_by": null, "downs": 0, "body": "Thanks man, I appreciate it. I'm not saying there's a moral reason not to, I'm saying that I don't think it would work. As it stands in the US whites are probably around 50% of the population and I'd guess at least half of them are 100% \"colourblind\" materialistic idiots who don't care about anything that doesn't directly pump dopamine or whatever straight into their brains. So let's say 25% of the population cares about us, on some level(that's including cuckservatives, so the mean age is gonna be pretty high). If everyone in that demographic rose up then sure maybe we'd have a chance, but who has power in society? Indians make the most per capita, whites are like third. We all know about our (((greatest ally))) and their influence. We'd maybe have parts of the military but they're unlikely to revolt and there are a lot of foreigners (hispanics) in there, not to mention Obama's wave of faggoty appointments. Any state we create would fare as well internationally as Assad's Syria/Gaddafi's Libya has, get ready for French jets bombing Appalachia. I don't see direct action working without pretty large external disruptions, if you're winning a guerrilla war you don't suddenly try to transition to a traditional industrial army. Didn't work for the South(kind of), didn't work for the Vietnamese(our bombers annihilated them every time they came out in the open), the Byzantines(not that they were ever Guerrilla fighters) or Saddam or anyone else like that. \n\n\nThe path forward that I'm trying to get on is equal parts Alinsky and Klan(?): Subvert the existing system to as greatest a degree as possible while creating parallel power structures that can't easily be destroyed by the existing system. The former slows permanent degeneration, the latter waits until the existing system is overwhelmed by something else to even the playing field for any traditional violent confrontations. Maybe I'm wrong but optics and psychological warfare (mostly the latter) is what's got us this far, the past fifty years of neonazi/klan/whatever random autism hasn't accomplished much other than keeping a fragment alive. Idk just my thoughts on it.", "edited": 1512181888.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks man, I appreciate it. I&amp;#39;m not saying there&amp;#39;s a moral reason not to, I&amp;#39;m saying that I don&amp;#39;t think it would work. As it stands in the US whites are probably around 50% of the population and I&amp;#39;d guess at least half of them are 100% &amp;quot;colourblind&amp;quot; materialistic idiots who don&amp;#39;t care about anything that doesn&amp;#39;t directly pump dopamine or whatever straight into their brains. So let&amp;#39;s say 25% of the population cares about us, on some level(that&amp;#39;s including cuckservatives, so the mean age is gonna be pretty high). If everyone in that demographic rose up then sure maybe we&amp;#39;d have a chance, but who has power in society? Indians make the most per capita, whites are like third. We all know about our (((greatest ally))) and their influence. We&amp;#39;d maybe have parts of the military but they&amp;#39;re unlikely to revolt and there are a lot of foreigners (hispanics) in there, not to mention Obama&amp;#39;s wave of faggoty appointments. Any state we create would fare as well internationally as Assad&amp;#39;s Syria/Gaddafi&amp;#39;s Libya has, get ready for French jets bombing Appalachia. I don&amp;#39;t see direct action working without pretty large external disruptions, if you&amp;#39;re winning a guerrilla war you don&amp;#39;t suddenly try to transition to a traditional industrial army. Didn&amp;#39;t work for the South(kind of), didn&amp;#39;t work for the Vietnamese(our bombers annihilated them every time they came out in the open), the Byzantines(not that they were ever Guerrilla fighters) or Saddam or anyone else like that. &lt;/p&gt;\n\n&lt;p&gt;The path forward that I&amp;#39;m trying to get on is equal parts Alinsky and Klan(?): Subvert the existing system to as greatest a degree as possible while creating parallel power structures that can&amp;#39;t easily be destroyed by the existing system. The former slows permanent degeneration, the latter waits until the existing system is overwhelmed by something else to even the playing field for any traditional violent confrontations. Maybe I&amp;#39;m wrong but optics and psychological warfare (mostly the latter) is what&amp;#39;s got us this far, the past fifty years of neonazi/klan/whatever random autism hasn&amp;#39;t accomplished much other than keeping a fragment alive. Idk just my thoughts on it.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7gzn0h/saving_the_world_in_the_21st_century_without/dqn20oq/", "num_reports": null, "name": "t1_dqn20oq", "created": 1512209927.0, "author_flair_text": null, "created_utc": 1512181127.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dqn15br", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "comeondantheman", "can_mod_post": false, "ups": 5, "parent_id": "t1_dqn0vt9", "score": 5, "approved_by": null, "downs": 0, "body": "I see your username a lot around here and I always like your posts, so don't take this the wrong way but that's completely retarded. I can guarantee you that the people who made our country the way it is didn't limit their actions to subvert our nation based on arbitrary standards of legality. You're essentially taking all the effective actions off the table because there's legal risk. Look at history dude, the ones who make it never hinder themselves by what's legal. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see your username a lot around here and I always like your posts, so don&amp;#39;t take this the wrong way but that&amp;#39;s completely retarded. I can guarantee you that the people who made our country the way it is didn&amp;#39;t limit their actions to subvert our nation based on arbitrary standards of legality. You&amp;#39;re essentially taking all the effective actions off the table because there&amp;#39;s legal risk. Look at history dude, the ones who make it never hinder themselves by what&amp;#39;s legal. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7gzn0h/saving_the_world_in_the_21st_century_without/dqn15br/", "num_reports": null, "name": "t1_dqn15br", "created": 1512208794.0, "author_flair_text": null, "created_utc": 1512179994.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7gzn0h", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dqn5fpv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Poolooloo", "can_mod_post": false, "ups": 1, "parent_id": "t1_dqn0vt9", "score": 1, "approved_by": null, "downs": 0, "body": "Just put “it’s ok to be white” posters up all over", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just put “it’s ok to be white” posters up all over&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7gzn0h/saving_the_world_in_the_21st_century_without/dqn5fpv/", "num_reports": null, "name": "t1_dqn5fpv", "created": 1512214399.0, "author_flair_text": null, "created_utc": 1512185599.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dqn0vt9", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "RedneckPapist", "can_mod_post": false, "ups": 2, "parent_id": "t3_7gzn0h", "score": 2, "approved_by": null, "downs": 0, "body": "Good post, but doing illegal shit isn't practical. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good post, but doing illegal shit isn&amp;#39;t practical. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7gzn0h/saving_the_world_in_the_21st_century_without/dqn0vt9/", "num_reports": null, "name": "t1_dqn0vt9", "created": 1512208449.0, "author_flair_text": null, "created_utc": 1512179649.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7gzn0h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7gzn0h", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dqo5mw2", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "comeondantheman", "can_mod_post": false, "ups": 2, "parent_id": "t1_dqneci6", "score": 2, "approved_by": null, "downs": 0, "body": "I'm going on a ski trip soon. I'm doing a roadtrip with a couple buddies, should be a nice to time to unwind and refresh the mind. I love being in the mountains. Camping is truly a great activity though, you're right. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going on a ski trip soon. I&amp;#39;m doing a roadtrip with a couple buddies, should be a nice to time to unwind and refresh the mind. I love being in the mountains. Camping is truly a great activity though, you&amp;#39;re right. &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7gzn0h/saving_the_world_in_the_21st_century_without/dqo5mw2/", "num_reports": null, "name": "t1_dqo5mw2", "created": 1512275648.0, "author_flair_text": null, "created_utc": 1512246848.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dqneci6", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "ups": 1, "parent_id": "t3_7gzn0h", "score": 1, "approved_by": null, "downs": 0, "body": "i know the weather isn't the best right now, but go camping. get some good gear and just camp.\n\nall i can do is go camping and clean up where i stay.. if i have some time maybe do some functional landscaping. it may be destroying or saving a piece of land but yea.. it's taboo to do damage in regard to keeping things the way most people like it and i dislike that very much myself, so i just go outside and camp.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i know the weather isn&amp;#39;t the best right now, but go camping. get some good gear and just camp.&lt;/p&gt;\n\n&lt;p&gt;all i can do is go camping and clean up where i stay.. if i have some time maybe do some functional landscaping. it may be destroying or saving a piece of land but yea.. it&amp;#39;s taboo to do damage in regard to keeping things the way most people like it and i dislike that very much myself, so i just go outside and camp.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": false, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7gzn0h/saving_the_world_in_the_21st_century_without/dqneci6/", "num_reports": null, "name": "t1_dqneci6", "created": 1512230190.0, "author_flair_text": null, "created_utc": 1512201390.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7gzn0h", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dqnwg43", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "ImWithMurdocChan", "can_mod_post": false, "ups": 1, "parent_id": "t3_7gzn0h", "score": 1, "approved_by": null, "downs": 0, "body": "Everyone's too comfortable, you have to go out there and destroy infrastructure, transportation, blow up bridges, take down power substations, destroy entire fields of crops if you can, anything to disrupt normal day to day life as well as the economy to plunge the country into the revolution that will take us out of the fall of rome.  Unironically.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone&amp;#39;s too comfortable, you have to go out there and destroy infrastructure, transportation, blow up bridges, take down power substations, destroy entire fields of crops if you can, anything to disrupt normal day to day life as well as the economy to plunge the country into the revolution that will take us out of the fall of rome.  Unironically.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7gzn0h/saving_the_world_in_the_21st_century_without/dqnwg43/", "num_reports": null, "name": "t1_dqnwg43", "created": 1512265198.0, "author_flair_text": "9/11 didn't happen at all, the towers are in the hologram", "created_utc": 1512236398.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7gzn0h", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dqmzorg", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "kconstantine", "can_mod_post": false, "ups": 0, "parent_id": "t3_7gzn0h", "score": 0, "approved_by": null, "downs": 0, "body": "big post\n\nsmall brain", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;big post&lt;/p&gt;\n\n&lt;p&gt;small brain&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7gzn0h/saving_the_world_in_the_21st_century_without/dqmzorg/", "num_reports": null, "name": "t1_dqmzorg", "created": 1512206904.0, "author_flair_text": "tell your mom you love her", "created_utc": 1512178104.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7gzn0h", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7gzn0h", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dqo5ovo", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "comeondantheman", "can_mod_post": false, "ups": 3, "parent_id": "t1_dqnuivg", "score": 3, "approved_by": null, "downs": 0, "body": "How has any true change ever been enacted? Do you think people played by the rules to attain the power and influence they have in our society? ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How has any true change ever been enacted? Do you think people played by the rules to attain the power and influence they have in our society? &lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7gzn0h/saving_the_world_in_the_21st_century_without/dqo5ovo/", "num_reports": null, "name": "t1_dqo5ovo", "created": 1512275708.0, "author_flair_text": null, "created_utc": 1512246908.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dqnuivg", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "xXxP3ck3rPolish3rxXx", "can_mod_post": false, "ups": -1, "parent_id": "t3_7gzn0h", "score": -1, "approved_by": null, "downs": 0, "body": "\"You know what wouldn't be gay? Wasting your time with lost causes and getting yourself arrested for some goy bullshit that doesn't create any impact at all other than give credibility for more victimhood to the group you were trying to attack.\"", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;You know what wouldn&amp;#39;t be gay? Wasting your time with lost causes and getting yourself arrested for some goy bullshit that doesn&amp;#39;t create any impact at all other than give credibility for more victimhood to the group you were trying to attack.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "subreddit_type": "public", "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7gzn0h/saving_the_world_in_the_21st_century_without/dqnuivg/", "num_reports": null, "name": "t1_dqnuivg", "created": 1512262887.0, "author_flair_text": null, "created_utc": 1512234087.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "after": null, "before": null}}]