[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "subreddit_id": "t5_2vsta", "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I was at The Roasted Beanis today getting the best soy latte in Portland when I kid you not, some psycho hillbilly with a gun on his hip walked in and stood in line behind me! I did a double take and started grilling him on why he felt the need to bring that inside the store, and you should&amp;#39;ve seen how red he turned! Now I&amp;#39;m not gonna lie- I was kind of intimidated, but not enough to stay quiet (those who know me well will affirm that I can actually get quite testy before my afternoon soy boost). He ofc didn&amp;#39;t have a good answer for why he needed it, which made me wonder if maybe he was a Nazi or something, but then the barista called me up and I had to order. I quietly informed her that the man behind me was armed, but she said there was nothing she could do about it. Fucking America 😤😤😤&lt;/p&gt;\n\n&lt;p&gt;Anyways it was without a doubt one of the scariest moments of my life, but I&amp;#39;m glad I stood up to him and made him question carrying that thing around in public. My PayPal is below just in case any gun owners want to throw me a donation for the emotional labour. Hate that my perception of The Roasted Beanis has changed this much in just one trip! No longer feels as safe.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I was at The Roasted Beanis today getting the best soy latte in Portland when I kid you not, some psycho hillbilly with a gun on his hip walked in and stood in line behind me! I did a double take and started grilling him on why he felt the need to bring that inside the store, and you should've seen how red he turned! Now I'm not gonna lie- I was kind of intimidated, but not enough to stay quiet (those who know me well will affirm that I can actually get quite testy before my afternoon soy boost). He ofc didn't have a good answer for why he needed it, which made me wonder if maybe he was a Nazi or something, but then the barista called me up and I had to order. I quietly informed her that the man behind me was armed, but she said there was nothing she could do about it. Fucking America 😤😤😤\n\nAnyways it was without a doubt one of the scariest moments of my life, but I'm glad I stood up to him and made him question carrying that thing around in public. My PayPal is below just in case any gun owners want to throw me a donation for the emotional labour. Hate that my perception of The Roasted Beanis has changed this much in just one trip! No longer feels as safe.\n", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "7k8mcf", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "author": "RocketBoyKim", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 10, "approved_by": null, "over_18": false, "removal_reason": null, "hidden": false, "num_comments": 0, "thumbnail": "self", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "media_embed": {}, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_7k8mcf", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/7k8mcf/ok_guys_girls_and_nonbinary_folks_its_story_time/", "subreddit_type": "public", "whitelist_status": "all_ads", "stickied": false, "created": 1513477904.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/7k8mcf/ok_guys_girls_and_nonbinary_folks_its_story_time/", "author_flair_text": "Shops at ROSS", "quarantine": false, "title": "Ok guys, girls, and non-binary folks, it's story time!", "created_utc": 1513449104.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.99, "mod_reports": [], "is_self": true, "visited": false, "num_reports": null, "is_video": false, "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [], "after": null, "before": null}}]