[{"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t3", "data": {"domain": "self.milliondollarextreme", "approved_at_utc": null, "banned_by": null, "media_embed": {}, "thumbnail_width": null, "subreddit": "milliondollarextreme", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As commissioned by Gilgulim, you asked for this.&lt;/p&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;p&gt;The year is 2070, 27 years after the Great Purge, 38 years after the Zuccening. In 2032, Mark Zuckerberg became president of the United States, and with access to top secret tech became the first transhuman, morphing xim into an immortal being known as Zuckerborg. Along with xim came policy changes: Snapchat chips installed into newborn babies&amp;#39; brains to record and share their every action, permanent Facebook accounts assigned to newborns in place of birth certificates, state mandated homosexuality (nullified only via bar mitzvah) and circumcision. 11 years later in 2053 a rogue far right terrorist group known &amp;quot;Million Dollar Extreme&amp;quot; sought out the great reckoning of this jester planet. A shaky, most blesséd pact was made between them and a tribe of furry cultists, and an eldritch ritual took place. A grand pyre was constructed, and into it they burned hundreds of thousands of vile images of the 2018 World Cup mascot Zabivaka. This put Russian President Vladimir Putin into a trance like state, the very putridity of the incantation forcing him to immediately fire every nuclear weapon in the Russian arsenal at the United States. Foreseeing the imminent destruction, Zuckerborg fled to Europe and established The Hive, where xe and the Bogdanoffs and their legion of Bogdabots would engage in an eternal stalemate of a war, forever and ever. In the remains of the continental US lay it&amp;#39;s surviving populace. Scattered, tiered megacities consisting of Excelciites and the underground depth-grovelers. Vast bio-domes home to the ascended, reptilian tribes of draconic folk. An insectoid under-race lurked and plagued all semblances of civilization that remained. Mutated groups of ethnic separatists form militant hordes that roam the badlands, and scattered in throughout the many wastelands are the crusading remnants of the furry alliance, deformed into bestial and anthropomorphic shapes, marked to purify the West. Our story begins with a fellowship of six of these very wanderers, patrolling around the ruins of Williamsburg, BKLYN...&lt;/p&gt;\n\n&lt;p&gt;Styrgos, the group&amp;#39;s canine 100% ALPHA, cast his dull eyes across the desolate landscape, then spoke to the companion at his side, &amp;quot;I haven&amp;#39;t seen the sun in full for months. I can only wonder if it&amp;#39;s from the Purge or some other source.&amp;quot; Oscar, the company&amp;#39;s workhorse, simply shrugged, &amp;quot;All the sky is but another neghole to be pozz&amp;#39;d, brother.&amp;quot; Styrgos hummed to himself and returned to the camp. The alchemist, York, sat at the fire brewing Zippy Water™ to sustain  them through tomorrow&amp;#39;s struggles. Brother Gabriel prayed beside him, and across sat Oliver listening to his favorite slumjams (if we&amp;#39;re talking music or just beats overall). Yale sat in the commander&amp;#39;s tent looking over a map,  and as Styrgos approached pointed at a structure illustrated on it, &amp;quot;The bio-dome is only 17 miles away, to our north, we will reach it tomorrow should we go uninterrupted.&amp;quot; Styrgos clasped him around the shoulder, &amp;quot;We must succeed, the very future of our people depend on it. If we fail, all our work, the Great Purge, all our years of valiant effort and endurance will be for naught.&amp;quot; Their most holy duties had led them to find that a Zuckerborg informant was hiding in a Draconic settling in the North, passing on valuable insights of the American wastelands to The Hive. If it was not rooted out, Zuckerborg would almost certainly begin recolonization of the wastelands to little resistance, perhaps even granting him the edge needed to break through the Bogdabot legions. Yale shuddered slightly at the thought, but regained his composure and moved out of the tent, and Styrgos gave the order to rest until dawn. That night, like every other night, the lads siphoned from each other the strength they needed to push on, to maintain their fortitude even for just one day more. And tomorrow would be a dire day indeed.&lt;/p&gt;\n\n&lt;p&gt;...&lt;/p&gt;\n\n&lt;p&gt;York handed the boys their Zippy Water™ portions that had fermented over night, and they packed up camp and returned to their orderly march. Vital to their survival was this brew, like sweet nectar to the gentlest of butterflies or the mightiest of beehives. It drew from them the ability to exceed their natural capabilities, meaning that despite their small numbers they could match the strength of armies. As a result, York was an essential and irreplaceable member of their team, and Styrgos slowed his pace so that the two walked abreast. While much praise and protection was afforded to York due to his vital role, there was a suspicion that Styrgos could not quell, that kept him entranced in a mire of thought amidst their long marches. &amp;quot;York, my friend, I have been meaning to ask you,&amp;quot; York beamed at his leader, &amp;quot;it is obvious to us all that you are a rat, but, assure me: how can I be sure you are not a well... a (((rat)))?&amp;quot; Styrgos visualized the ((()))&amp;#39;s by cupping his hands into a C shape and, opening towards each other, moved them incrementally thrice. Oscar and Brother Gabriel murmured carefully with each other, and Oliver was taken aback at the accusation, &amp;quot;Choose your words carefully, big guy, this is our &lt;em&gt;alchemist&lt;/em&gt; you&amp;#39;re talking to.&amp;quot; York ignored them and affirmed his commander, &amp;quot;Captain, I&amp;#39;m not going to travel with you for months at a time, just to stab you in the back. If I truly had subversive intentions, I would have acted on them long ago.&amp;quot; Styrgos looked at him for a moment more and, satisfied, moved back to his position on point. He had not truly cared about what the answer would be, he was simply happy to have finally asked the question. &lt;/p&gt;\n\n&lt;p&gt;The day dragged on, and as they entered a narrow gulch at around midday, and much to the delight of the fellowship, the bio-dome had come into sight at the canyons end. Oscar stopped in his tracks, his ears twitching. &amp;quot;What troubles you, son?&amp;quot; Brother Gabriel inquired, but was quickly met with his shushing. After a few moments passed, Oscar whispered, &amp;quot;Something assails my ears.&amp;quot; They all paused and, after a short while, the sound became undeniably apparent. It was a rhythmic roar from all sides that faded into being, at first sounding like a wild stampede, but soon it seemed more like chanting. As it got closer, they were able to finally pick out the words, &amp;quot;SHE AIN&amp;#39;T NOTHIN&amp;#39; BUT A HOOCHIE MAMA (HOOD RAT HOOD RAT HOOCHIE MAMA)&amp;quot; being shouted over and over again. Yale gasped, &amp;quot;Tha Black Pantherz? This far north!? But how?&amp;quot; Styrgos ignored his questions and ordered the men into a defensive ring, preparing for an attack on all sides. &amp;quot;Keep your flasks close, lads, we will need all the strength we can muster,&amp;quot; and within mere minutes, Tha Pantherz were upon them. They poured over the valley walls like a great flood and filed in on all sides, surrounding them and halting mere feet from their formation. Toward the opening of the gulch where the group had been heading, a partition formed that allowed a larger one to walk through, clearly the leader. Styrgos attempted to engage diplomatically, &amp;quot;We seek no harm here, only safe passage. Allow us through or suffer at the mercy of our self defense.&amp;quot; Tha Pantherz cackled at his demands, and the leader called out &amp;quot;Silly ass mohfugga, there&amp;#39;s thousands of us and only six of you, you think you can REALLY compete? Ayo boyz! Grease these fools!&amp;quot; On that command, the horde attempted to converge on them, Oscar held them at bay with his spear, Oliver and Yale stabbed and hewed as the Pantherz beat upon their shields, and Styrgos and Brother Gabriel heaved line after line into the air with their mighty two-handers. York stood in the center of the ring and, as the assaults took their toll on the defenders, handed out Zippy Water™ to restore and enhance their strength. Pantherz fell by the dozens, but the waves were endless, and even with the Zippy Water&amp;#39;s™ aid the crusaders soon felt fatigue. Brother Gabriel was caught with a Panther blade on his side, and was forced to retreat into the center while Styrgos took his place. York saw to him and offered him his own portion of Zippy Water™ and Gabriel took it gratefully. As he sipped the flask, however, York noticed a grave misstep that would surely cost Gabriel his life: his modified Power-helm had been set to Speed mode, not Power mode, the lessened effect that allowed the imbibing of Zippy Water™.  He was surely doomed, such an overload of power would inevitably lead to his body imploding. However, just then, something extraordinary happened.&lt;/p&gt;\n\n&lt;p&gt;Gabriel grew greatly in size, towering several feet over the manlets below, even as he was hunched over. His body seemed to writhe in might, and his eyes soon emitted a fierce, divine glow. He stood upright and, with a booming and unworldly voice, shouted, &lt;strong&gt;&amp;quot;THE ZIPPY WATER MUST FLOW!!!&amp;quot;&lt;/strong&gt; His comrades looked back at him in confusion, and tha Pantherz paused in awe. The very earth quaked and rippled, and from the ground seeped Zippy Water™ in it&amp;#39;s purest form, heated to the point of boiling. Soon geysers of the liquid shot from the ground throwing about all that lay in the gulch aside from the crusaders, a tiny island in an ocean of madness. Seeing his army shattering, the Panther commander bellowed to the sky in both fear and rage, &amp;quot;I cannot STAND these boys! All forces, retreat!&amp;quot; Gone as fast they arrived, the  Pantherz that had survived the devastation fled the gulch leaving the group in a stunned stupor. The geysers soon started to calm, and the liquid flowed out of the gulch and was absorbed back into the ground. Brother Gabriel shrank back to his normal size, and fell to the ground unconscious, drained by his actions. Oscar quietly knelt beside him, then picked him up, and looked towards the bio-dome in the distance, &amp;quot;Whatever intervened for us there might not save us again.&amp;quot; He turned and looked at Styrgos, then continued, &amp;quot;We should keep moving, lest they regain confidence and return here&amp;quot; They all nodded, then reformed back into their line, and marched on ever more.&lt;/p&gt;\n\n&lt;p&gt;To be continued...?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As commissioned by Gilgulim, you asked for this.\n\n-\n\nThe year is 2070, 27 years after the Great Purge, 38 years after the Zuccening. In 2032, Mark Zuckerberg became president of the United States, and with access to top secret tech became the first transhuman, morphing xim into an immortal being known as Zuckerborg. Along with xim came policy changes: Snapchat chips installed into newborn babies' brains to record and share their every action, permanent Facebook accounts assigned to newborns in place of birth certificates, state mandated homosexuality (nullified only via bar mitzvah) and circumcision. 11 years later in 2053 a rogue far right terrorist group known \"Million Dollar Extreme\" sought out the great reckoning of this jester planet. A shaky, most blesséd pact was made between them and a tribe of furry cultists, and an eldritch ritual took place. A grand pyre was constructed, and into it they burned hundreds of thousands of vile images of the 2018 World Cup mascot Zabivaka. This put Russian President Vladimir Putin into a trance like state, the very putridity of the incantation forcing him to immediately fire every nuclear weapon in the Russian arsenal at the United States. Foreseeing the imminent destruction, Zuckerborg fled to Europe and established The Hive, where xe and the Bogdanoffs and their legion of Bogdabots would engage in an eternal stalemate of a war, forever and ever. In the remains of the continental US lay it's surviving populace. Scattered, tiered megacities consisting of Excelciites and the underground depth-grovelers. Vast bio-domes home to the ascended, reptilian tribes of draconic folk. An insectoid under-race lurked and plagued all semblances of civilization that remained. Mutated groups of ethnic separatists form militant hordes that roam the badlands, and scattered in throughout the many wastelands are the crusading remnants of the furry alliance, deformed into bestial and anthropomorphic shapes, marked to purify the West. Our story begins with a fellowship of six of these very wanderers, patrolling around the ruins of Williamsburg, BKLYN...\n\nStyrgos, the group's canine 100% ALPHA, cast his dull eyes across the desolate landscape, then spoke to the companion at his side, \"I haven't seen the sun in full for months. I can only wonder if it's from the Purge or some other source.\" Oscar, the company's workhorse, simply shrugged, \"All the sky is but another neghole to be pozz'd, brother.\" Styrgos hummed to himself and returned to the camp. The alchemist, York, sat at the fire brewing Zippy Water™ to sustain  them through tomorrow's struggles. Brother Gabriel prayed beside him, and across sat Oliver listening to his favorite slumjams (if we're talking music or just beats overall). Yale sat in the commander's tent looking over a map,  and as Styrgos approached pointed at a structure illustrated on it, \"The bio-dome is only 17 miles away, to our north, we will reach it tomorrow should we go uninterrupted.\" Styrgos clasped him around the shoulder, \"We must succeed, the very future of our people depend on it. If we fail, all our work, the Great Purge, all our years of valiant effort and endurance will be for naught.\" Their most holy duties had led them to find that a Zuckerborg informant was hiding in a Draconic settling in the North, passing on valuable insights of the American wastelands to The Hive. If it was not rooted out, Zuckerborg would almost certainly begin recolonization of the wastelands to little resistance, perhaps even granting him the edge needed to break through the Bogdabot legions. Yale shuddered slightly at the thought, but regained his composure and moved out of the tent, and Styrgos gave the order to rest until dawn. That night, like every other night, the lads siphoned from each other the strength they needed to push on, to maintain their fortitude even for just one day more. And tomorrow would be a dire day indeed.\n\n...\n\nYork handed the boys their Zippy Water™ portions that had fermented over night, and they packed up camp and returned to their orderly march. Vital to their survival was this brew, like sweet nectar to the gentlest of butterflies or the mightiest of beehives. It drew from them the ability to exceed their natural capabilities, meaning that despite their small numbers they could match the strength of armies. As a result, York was an essential and irreplaceable member of their team, and Styrgos slowed his pace so that the two walked abreast. While much praise and protection was afforded to York due to his vital role, there was a suspicion that Styrgos could not quell, that kept him entranced in a mire of thought amidst their long marches. \"York, my friend, I have been meaning to ask you,\" York beamed at his leader, \"it is obvious to us all that you are a rat, but, assure me: how can I be sure you are not a well... a (((rat)))?\" Styrgos visualized the ((()))'s by cupping his hands into a C shape and, opening towards each other, moved them incrementally thrice. Oscar and Brother Gabriel murmured carefully with each other, and Oliver was taken aback at the accusation, \"Choose your words carefully, big guy, this is our *alchemist* you're talking to.\" York ignored them and affirmed his commander, \"Captain, I'm not going to travel with you for months at a time, just to stab you in the back. If I truly had subversive intentions, I would have acted on them long ago.\" Styrgos looked at him for a moment more and, satisfied, moved back to his position on point. He had not truly cared about what the answer would be, he was simply happy to have finally asked the question. \n\nThe day dragged on, and as they entered a narrow gulch at around midday, and much to the delight of the fellowship, the bio-dome had come into sight at the canyons end. Oscar stopped in his tracks, his ears twitching. \"What troubles you, son?\" Brother Gabriel inquired, but was quickly met with his shushing. After a few moments passed, Oscar whispered, \"Something assails my ears.\" They all paused and, after a short while, the sound became undeniably apparent. It was a rhythmic roar from all sides that faded into being, at first sounding like a wild stampede, but soon it seemed more like chanting. As it got closer, they were able to finally pick out the words, \"SHE AIN'T NOTHIN' BUT A HOOCHIE MAMA (HOOD RAT HOOD RAT HOOCHIE MAMA)\" being shouted over and over again. Yale gasped, \"Tha Black Pantherz? This far north!? But how?\" Styrgos ignored his questions and ordered the men into a defensive ring, preparing for an attack on all sides. \"Keep your flasks close, lads, we will need all the strength we can muster,\" and within mere minutes, Tha Pantherz were upon them. They poured over the valley walls like a great flood and filed in on all sides, surrounding them and halting mere feet from their formation. Toward the opening of the gulch where the group had been heading, a partition formed that allowed a larger one to walk through, clearly the leader. Styrgos attempted to engage diplomatically, \"We seek no harm here, only safe passage. Allow us through or suffer at the mercy of our self defense.\" Tha Pantherz cackled at his demands, and the leader called out \"Silly ass mohfugga, there's thousands of us and only six of you, you think you can REALLY compete? Ayo boyz! Grease these fools!\" On that command, the horde attempted to converge on them, Oscar held them at bay with his spear, Oliver and Yale stabbed and hewed as the Pantherz beat upon their shields, and Styrgos and Brother Gabriel heaved line after line into the air with their mighty two-handers. York stood in the center of the ring and, as the assaults took their toll on the defenders, handed out Zippy Water™ to restore and enhance their strength. Pantherz fell by the dozens, but the waves were endless, and even with the Zippy Water's™ aid the crusaders soon felt fatigue. Brother Gabriel was caught with a Panther blade on his side, and was forced to retreat into the center while Styrgos took his place. York saw to him and offered him his own portion of Zippy Water™ and Gabriel took it gratefully. As he sipped the flask, however, York noticed a grave misstep that would surely cost Gabriel his life: his modified Power-helm had been set to Speed mode, not Power mode, the lessened effect that allowed the imbibing of Zippy Water™.  He was surely doomed, such an overload of power would inevitably lead to his body imploding. However, just then, something extraordinary happened.\n\nGabriel grew greatly in size, towering several feet over the manlets below, even as he was hunched over. His body seemed to writhe in might, and his eyes soon emitted a fierce, divine glow. He stood upright and, with a booming and unworldly voice, shouted, **\"THE ZIPPY WATER MUST FLOW!!!\"** His comrades looked back at him in confusion, and tha Pantherz paused in awe. The very earth quaked and rippled, and from the ground seeped Zippy Water™ in it's purest form, heated to the point of boiling. Soon geysers of the liquid shot from the ground throwing about all that lay in the gulch aside from the crusaders, a tiny island in an ocean of madness. Seeing his army shattering, the Panther commander bellowed to the sky in both fear and rage, \"I cannot STAND these boys! All forces, retreat!\" Gone as fast they arrived, the  Pantherz that had survived the devastation fled the gulch leaving the group in a stunned stupor. The geysers soon started to calm, and the liquid flowed out of the gulch and was absorbed back into the ground. Brother Gabriel shrank back to his normal size, and fell to the ground unconscious, drained by his actions. Oscar quietly knelt beside him, then picked him up, and looked towards the bio-dome in the distance, \"Whatever intervened for us there might not save us again.\" He turned and looked at Styrgos, then continued, \"We should keep moving, lest they regain confidence and return here\" They all nodded, then reformed back into their line, and marched on ever more.\n\nTo be continued...?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "link_flair_text": null, "id": "7at0t2", "banned_at_utc": null, "view_count": null, "archived": false, "clicked": false, "report_reasons": null, "title": "Furpill Crusaders (ᴄᴏᴍ98 sᴛᴏʀʏ ᴛʀᴀɪʟᴇʀ/sɴᴇᴀᴋ ᴘᴇᴇᴋ) 0_o", "num_crossposts": 0, "saved": false, "can_mod_post": false, "is_crosspostable": false, "pinned": false, "score": 12, "approved_by": null, "over_18": false, "hidden": false, "num_comments": 5, "thumbnail": "self", "subreddit_id": "t5_2vsta", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "secure_media_embed": {}, "removal_reason": null, "can_gild": false, "thumbnail_height": null, "parent_whitelist_status": "all_ads", "name": "t3_7at0t2", "spoiler": false, "permalink": "/r/milliondollarextreme/comments/7at0t2/furpill_crusaders_ᴄᴏᴍ98_sᴛᴏʀʏ_ᴛʀᴀɪʟᴇʀsɴᴇᴀᴋ_ᴘᴇᴇᴋ_0/", "num_reports": null, "whitelist_status": "all_ads", "stickied": false, "created": 1509855496.0, "url": "https://www.reddit.com/r/milliondollarextreme/comments/7at0t2/furpill_crusaders_ᴄᴏᴍ98_sᴛᴏʀʏ_ᴛʀᴀɪʟᴇʀsɴᴇᴀᴋ_ᴘᴇᴇᴋ_0/", "author_flair_text": "wide stance", "quarantine": false, "author": "filewulf", "created_utc": 1509826696.0, "subreddit_name_prefixed": "r/milliondollarextreme", "distinguished": null, "media": null, "upvote_ratio": 0.84, "mod_reports": [], "is_self": true, "visited": false, "subreddit_type": "public", "is_video": false, "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7at0t2", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dpcjzdi", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "sYgma-07", "can_mod_post": false, "ups": 3, "parent_id": "t3_7at0t2", "score": 3, "approved_by": null, "downs": 0, "body": "made me laff, I liked the part about the parantheses\n\nTOP JOB", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;made me laff, I liked the part about the parantheses&lt;/p&gt;\n\n&lt;p&gt;TOP JOB&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7at0t2/furpill_crusaders_ᴄᴏᴍ98_sᴛᴏʀʏ_ᴛʀᴀɪʟᴇʀsɴᴇᴀᴋ_ᴘᴇᴇᴋ_0/dpcjzdi/", "subreddit_type": "public", "name": "t1_dpcjzdi", "created": 1509856042.0, "author_flair_text": "king of di dancehall", "created_utc": 1509827242.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7at0t2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7at0t2", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dpd7i2g", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "filewulf", "can_mod_post": false, "ups": 2, "parent_id": "t1_dpd1tf4", "score": 2, "approved_by": null, "downs": 0, "body": "Hell yeah", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hell yeah&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7at0t2/furpill_crusaders_ᴄᴏᴍ98_sᴛᴏʀʏ_ᴛʀᴀɪʟᴇʀsɴᴇᴀᴋ_ᴘᴇᴇᴋ_0/dpd7i2g/", "subreddit_type": "public", "name": "t1_dpd7i2g", "created": 1509886303.0, "author_flair_text": "wide stance", "created_utc": 1509857503.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dpd1tf4", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "Teeth_Paste", "can_mod_post": false, "ups": 2, "parent_id": "t3_7at0t2", "score": 2, "approved_by": null, "downs": 0, "body": "I love this shit, lol.", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love this shit, lol.&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7at0t2/furpill_crusaders_ᴄᴏᴍ98_sᴛᴏʀʏ_ᴛʀᴀɪʟᴇʀsɴᴇᴀᴋ_ᴘᴇᴇᴋ_0/dpd1tf4/", "subreddit_type": "public", "name": "t1_dpd1tf4", "created": 1509878375.0, "author_flair_text": "💊𝔽𝕌ℝℙ𝕀𝕃𝕃", "created_utc": 1509849575.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7at0t2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "whitelist_status": "all_ads", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vsta", "approved_at_utc": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7at0t2", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "dph1wyj", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "filewulf", "can_mod_post": false, "ups": 1, "parent_id": "t1_dpgqek8", "score": 1, "approved_by": null, "downs": 0, "body": "CYOA first", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;CYOA first&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7at0t2/furpill_crusaders_ᴄᴏᴍ98_sᴛᴏʀʏ_ᴛʀᴀɪʟᴇʀsɴᴇᴀᴋ_ᴘᴇᴇᴋ_0/dph1wyj/", "subreddit_type": "public", "name": "t1_dph1wyj", "created": 1510092898.0, "author_flair_text": "wide stance", "created_utc": 1510064098.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 1, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "dpgqek8", "banned_at_utc": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "psyduck117", "can_mod_post": false, "ups": 1, "parent_id": "t3_7at0t2", "score": 1, "approved_by": null, "downs": 0, "body": "When can I buy the ebook?", "edited": false, "author_flair_css_class": "", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When can I buy the ebook?&lt;/p&gt;\n&lt;/div&gt;", "stickied": false, "can_gild": true, "subreddit": "milliondollarextreme", "score_hidden": false, "permalink": "/r/milliondollarextreme/comments/7at0t2/furpill_crusaders_ᴄᴏᴍ98_sᴛᴏʀʏ_ᴛʀᴀɪʟᴇʀsɴᴇᴀᴋ_ᴘᴇᴇᴋ_0/dpgqek8/", "subreddit_type": "public", "name": "t1_dpgqek8", "created": 1510066822.0, "author_flair_text": "&lt;3 /u/GottenGot", "created_utc": 1510038022.0, "subreddit_name_prefixed": "r/milliondollarextreme", "controversiality": 0, "depth": 0, "mod_reports": [], "num_reports": null, "distinguished": null}}], "after": null, "before": null}}]